zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
/**
 * \brief Component description for PIC32CZ/CA70 PMC
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_PMC_COMPONENT_H_
#define _PIC32CZ_CA70_PMC_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_PMC Power Management Controller
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR PMC */
/* ========================================================================== */

/* -------- PMC_SCER : (PMC Offset: 0x00) (/W 32) System Clock Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t :5;                        /**< bit:   0..4  Reserved                                      */
    uint32_t USBCLK:1;                  /**< bit:      5  Enable USB FS Clock                           */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t PCK0:1;                    /**< bit:      8  Programmable Clock 0 Output Enable            */
    uint32_t PCK1:1;                    /**< bit:      9  Programmable Clock 1 Output Enable            */
    uint32_t PCK2:1;                    /**< bit:     10  Programmable Clock 2 Output Enable            */
    uint32_t PCK3:1;                    /**< bit:     11  Programmable Clock 3 Output Enable            */
    uint32_t PCK4:1;                    /**< bit:     12  Programmable Clock 4 Output Enable            */
    uint32_t PCK5:1;                    /**< bit:     13  Programmable Clock 5 Output Enable            */
    uint32_t PCK6:1;                    /**< bit:     14  Programmable Clock 6 Output Enable            */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PCK:7;                     /**< bit:  8..14  Programmable Clock 6 Output Enable            */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_SCER_bits_t;

#define PMC_SCER_USBCLK_Pos                   (5)                                            /**< (PMC_SCER) Enable USB FS Clock Position */
#define PMC_SCER_USBCLK_Msk                   (0x1U << PMC_SCER_USBCLK_Pos)                  /**< (PMC_SCER) Enable USB FS Clock Mask */
#define PMC_SCER_PCK0_Pos                     (8)                                            /**< (PMC_SCER) Programmable Clock 0 Output Enable Position */
#define PMC_SCER_PCK0_Msk                     (0x1U << PMC_SCER_PCK0_Pos)                    /**< (PMC_SCER) Programmable Clock 0 Output Enable Mask */
#define PMC_SCER_PCK1_Pos                     (9)                                            /**< (PMC_SCER) Programmable Clock 1 Output Enable Position */
#define PMC_SCER_PCK1_Msk                     (0x1U << PMC_SCER_PCK1_Pos)                    /**< (PMC_SCER) Programmable Clock 1 Output Enable Mask */
#define PMC_SCER_PCK2_Pos                     (10)                                           /**< (PMC_SCER) Programmable Clock 2 Output Enable Position */
#define PMC_SCER_PCK2_Msk                     (0x1U << PMC_SCER_PCK2_Pos)                    /**< (PMC_SCER) Programmable Clock 2 Output Enable Mask */
#define PMC_SCER_PCK3_Pos                     (11)                                           /**< (PMC_SCER) Programmable Clock 3 Output Enable Position */
#define PMC_SCER_PCK3_Msk                     (0x1U << PMC_SCER_PCK3_Pos)                    /**< (PMC_SCER) Programmable Clock 3 Output Enable Mask */
#define PMC_SCER_PCK4_Pos                     (12)                                           /**< (PMC_SCER) Programmable Clock 4 Output Enable Position */
#define PMC_SCER_PCK4_Msk                     (0x1U << PMC_SCER_PCK4_Pos)                    /**< (PMC_SCER) Programmable Clock 4 Output Enable Mask */
#define PMC_SCER_PCK5_Pos                     (13)                                           /**< (PMC_SCER) Programmable Clock 5 Output Enable Position */
#define PMC_SCER_PCK5_Msk                     (0x1U << PMC_SCER_PCK5_Pos)                    /**< (PMC_SCER) Programmable Clock 5 Output Enable Mask */
#define PMC_SCER_PCK6_Pos                     (14)                                           /**< (PMC_SCER) Programmable Clock 6 Output Enable Position */
#define PMC_SCER_PCK6_Msk                     (0x1U << PMC_SCER_PCK6_Pos)                    /**< (PMC_SCER) Programmable Clock 6 Output Enable Mask */
#define PMC_SCER_Msk                          (0x00007F20UL)                                 /**< (PMC_SCER) Register Mask  */
#define PMC_SCER_PCK_Pos                      (8)                                            /**< (PMC_SCER Position) Programmable Clock 6 Output Enable */
#define PMC_SCER_PCK_Msk                      (0x7FU << PMC_SCER_PCK_Pos)                    /**< (PMC_SCER Mask) PCK */
#define PMC_SCER_PCK(value)                   (PMC_SCER_PCK_Msk & ((value) << PMC_SCER_PCK_Pos))

/* -------- PMC_SCDR : (PMC Offset: 0x04) (/W 32) System Clock Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t :5;                        /**< bit:   0..4  Reserved                                      */
    uint32_t USBCLK:1;                  /**< bit:      5  Disable USB FS Clock                          */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t PCK0:1;                    /**< bit:      8  Programmable Clock 0 Output Disable           */
    uint32_t PCK1:1;                    /**< bit:      9  Programmable Clock 1 Output Disable           */
    uint32_t PCK2:1;                    /**< bit:     10  Programmable Clock 2 Output Disable           */
    uint32_t PCK3:1;                    /**< bit:     11  Programmable Clock 3 Output Disable           */
    uint32_t PCK4:1;                    /**< bit:     12  Programmable Clock 4 Output Disable           */
    uint32_t PCK5:1;                    /**< bit:     13  Programmable Clock 5 Output Disable           */
    uint32_t PCK6:1;                    /**< bit:     14  Programmable Clock 6 Output Disable           */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PCK:7;                     /**< bit:  8..14  Programmable Clock 6 Output Disable           */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_SCDR_bits_t;

#define PMC_SCDR_USBCLK_Pos                   (5)                                            /**< (PMC_SCDR) Disable USB FS Clock Position */
#define PMC_SCDR_USBCLK_Msk                   (0x1U << PMC_SCDR_USBCLK_Pos)                  /**< (PMC_SCDR) Disable USB FS Clock Mask */
#define PMC_SCDR_PCK0_Pos                     (8)                                            /**< (PMC_SCDR) Programmable Clock 0 Output Disable Position */
#define PMC_SCDR_PCK0_Msk                     (0x1U << PMC_SCDR_PCK0_Pos)                    /**< (PMC_SCDR) Programmable Clock 0 Output Disable Mask */
#define PMC_SCDR_PCK1_Pos                     (9)                                            /**< (PMC_SCDR) Programmable Clock 1 Output Disable Position */
#define PMC_SCDR_PCK1_Msk                     (0x1U << PMC_SCDR_PCK1_Pos)                    /**< (PMC_SCDR) Programmable Clock 1 Output Disable Mask */
#define PMC_SCDR_PCK2_Pos                     (10)                                           /**< (PMC_SCDR) Programmable Clock 2 Output Disable Position */
#define PMC_SCDR_PCK2_Msk                     (0x1U << PMC_SCDR_PCK2_Pos)                    /**< (PMC_SCDR) Programmable Clock 2 Output Disable Mask */
#define PMC_SCDR_PCK3_Pos                     (11)                                           /**< (PMC_SCDR) Programmable Clock 3 Output Disable Position */
#define PMC_SCDR_PCK3_Msk                     (0x1U << PMC_SCDR_PCK3_Pos)                    /**< (PMC_SCDR) Programmable Clock 3 Output Disable Mask */
#define PMC_SCDR_PCK4_Pos                     (12)                                           /**< (PMC_SCDR) Programmable Clock 4 Output Disable Position */
#define PMC_SCDR_PCK4_Msk                     (0x1U << PMC_SCDR_PCK4_Pos)                    /**< (PMC_SCDR) Programmable Clock 4 Output Disable Mask */
#define PMC_SCDR_PCK5_Pos                     (13)                                           /**< (PMC_SCDR) Programmable Clock 5 Output Disable Position */
#define PMC_SCDR_PCK5_Msk                     (0x1U << PMC_SCDR_PCK5_Pos)                    /**< (PMC_SCDR) Programmable Clock 5 Output Disable Mask */
#define PMC_SCDR_PCK6_Pos                     (14)                                           /**< (PMC_SCDR) Programmable Clock 6 Output Disable Position */
#define PMC_SCDR_PCK6_Msk                     (0x1U << PMC_SCDR_PCK6_Pos)                    /**< (PMC_SCDR) Programmable Clock 6 Output Disable Mask */
#define PMC_SCDR_Msk                          (0x00007F20UL)                                 /**< (PMC_SCDR) Register Mask  */
#define PMC_SCDR_PCK_Pos                      (8)                                            /**< (PMC_SCDR Position) Programmable Clock 6 Output Disable */
#define PMC_SCDR_PCK_Msk                      (0x7FU << PMC_SCDR_PCK_Pos)                    /**< (PMC_SCDR Mask) PCK */
#define PMC_SCDR_PCK(value)                   (PMC_SCDR_PCK_Msk & ((value) << PMC_SCDR_PCK_Pos))

