zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
/* -------- PMC_SCSR : (PMC Offset: 0x08) (R/ 32) System Clock Status Register -------- */

typedef union
{
  struct
  {
    uint32_t HCLKS:1;                   /**< bit:      0  HCLK Status                                   */
    uint32_t :4;                        /**< bit:   1..4  Reserved                                      */
    uint32_t USBCLK:1;                  /**< bit:      5  USB FS Clock Status                           */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t PCK0:1;                    /**< bit:      8  Programmable Clock 0 Output Status            */
    uint32_t PCK1:1;                    /**< bit:      9  Programmable Clock 1 Output Status            */
    uint32_t PCK2:1;                    /**< bit:     10  Programmable Clock 2 Output Status            */
    uint32_t PCK3:1;                    /**< bit:     11  Programmable Clock 3 Output Status            */
    uint32_t PCK4:1;                    /**< bit:     12  Programmable Clock 4 Output Status            */
    uint32_t PCK5:1;                    /**< bit:     13  Programmable Clock 5 Output Status            */
    uint32_t PCK6:1;                    /**< bit:     14  Programmable Clock 6 Output Status            */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PCK:7;                     /**< bit:  8..14  Programmable Clock 6 Output Status            */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_SCSR_bits_t;

#define PMC_SCSR_HCLKS_Pos                    (0)                                            /**< (PMC_SCSR) HCLK Status Position */
#define PMC_SCSR_HCLKS_Msk                    (0x1U << PMC_SCSR_HCLKS_Pos)                   /**< (PMC_SCSR) HCLK Status Mask */
#define PMC_SCSR_USBCLK_Pos                   (5)                                            /**< (PMC_SCSR) USB FS Clock Status Position */
#define PMC_SCSR_USBCLK_Msk                   (0x1U << PMC_SCSR_USBCLK_Pos)                  /**< (PMC_SCSR) USB FS Clock Status Mask */
#define PMC_SCSR_PCK0_Pos                     (8)                                            /**< (PMC_SCSR) Programmable Clock 0 Output Status Position */
#define PMC_SCSR_PCK0_Msk                     (0x1U << PMC_SCSR_PCK0_Pos)                    /**< (PMC_SCSR) Programmable Clock 0 Output Status Mask */
#define PMC_SCSR_PCK1_Pos                     (9)                                            /**< (PMC_SCSR) Programmable Clock 1 Output Status Position */
#define PMC_SCSR_PCK1_Msk                     (0x1U << PMC_SCSR_PCK1_Pos)                    /**< (PMC_SCSR) Programmable Clock 1 Output Status Mask */
#define PMC_SCSR_PCK2_Pos                     (10)                                           /**< (PMC_SCSR) Programmable Clock 2 Output Status Position */
#define PMC_SCSR_PCK2_Msk                     (0x1U << PMC_SCSR_PCK2_Pos)                    /**< (PMC_SCSR) Programmable Clock 2 Output Status Mask */
#define PMC_SCSR_PCK3_Pos                     (11)                                           /**< (PMC_SCSR) Programmable Clock 3 Output Status Position */
#define PMC_SCSR_PCK3_Msk                     (0x1U << PMC_SCSR_PCK3_Pos)                    /**< (PMC_SCSR) Programmable Clock 3 Output Status Mask */
#define PMC_SCSR_PCK4_Pos                     (12)                                           /**< (PMC_SCSR) Programmable Clock 4 Output Status Position */
#define PMC_SCSR_PCK4_Msk                     (0x1U << PMC_SCSR_PCK4_Pos)                    /**< (PMC_SCSR) Programmable Clock 4 Output Status Mask */
#define PMC_SCSR_PCK5_Pos                     (13)                                           /**< (PMC_SCSR) Programmable Clock 5 Output Status Position */
#define PMC_SCSR_PCK5_Msk                     (0x1U << PMC_SCSR_PCK5_Pos)                    /**< (PMC_SCSR) Programmable Clock 5 Output Status Mask */
#define PMC_SCSR_PCK6_Pos                     (14)                                           /**< (PMC_SCSR) Programmable Clock 6 Output Status Position */
#define PMC_SCSR_PCK6_Msk                     (0x1U << PMC_SCSR_PCK6_Pos)                    /**< (PMC_SCSR) Programmable Clock 6 Output Status Mask */
#define PMC_SCSR_Msk                          (0x00007F21UL)                                 /**< (PMC_SCSR) Register Mask  */
#define PMC_SCSR_PCK_Pos                      (8)                                            /**< (PMC_SCSR Position) Programmable Clock 6 Output Status */
#define PMC_SCSR_PCK_Msk                      (0x7FU << PMC_SCSR_PCK_Pos)                    /**< (PMC_SCSR Mask) PCK */
#define PMC_SCSR_PCK(value)                   (PMC_SCSR_PCK_Msk & ((value) << PMC_SCSR_PCK_Pos))

/* -------- PMC_PCER0 : (PMC Offset: 0x10) (/W 32) Peripheral Clock Enable Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID7:1;                    /**< bit:      7  Peripheral Clock 7 Enable                     */
    uint32_t PID8:1;                    /**< bit:      8  Peripheral Clock 8 Enable                     */
    uint32_t PID9:1;                    /**< bit:      9  Peripheral Clock 9 Enable                     */
    uint32_t PID10:1;                   /**< bit:     10  Peripheral Clock 10 Enable                    */
    uint32_t PID11:1;                   /**< bit:     11  Peripheral Clock 11 Enable                    */
    uint32_t PID12:1;                   /**< bit:     12  Peripheral Clock 12 Enable                    */
    uint32_t PID13:1;                   /**< bit:     13  Peripheral Clock 13 Enable                    */
    uint32_t PID14:1;                   /**< bit:     14  Peripheral Clock 14 Enable                    */
    uint32_t PID15:1;                   /**< bit:     15  Peripheral Clock 15 Enable                    */
    uint32_t PID16:1;                   /**< bit:     16  Peripheral Clock 16 Enable                    */
    uint32_t PID17:1;                   /**< bit:     17  Peripheral Clock 17 Enable                    */
    uint32_t PID18:1;                   /**< bit:     18  Peripheral Clock 18 Enable                    */
    uint32_t PID19:1;                   /**< bit:     19  Peripheral Clock 19 Enable                    */
    uint32_t PID20:1;                   /**< bit:     20  Peripheral Clock 20 Enable                    */
    uint32_t PID21:1;                   /**< bit:     21  Peripheral Clock 21 Enable                    */
    uint32_t PID22:1;                   /**< bit:     22  Peripheral Clock 22 Enable                    */
    uint32_t PID23:1;                   /**< bit:     23  Peripheral Clock 23 Enable                    */
    uint32_t PID24:1;                   /**< bit:     24  Peripheral Clock 24 Enable                    */
    uint32_t PID25:1;                   /**< bit:     25  Peripheral Clock 25 Enable                    */
    uint32_t PID26:1;                   /**< bit:     26  Peripheral Clock 26 Enable                    */
    uint32_t PID27:1;                   /**< bit:     27  Peripheral Clock 27 Enable                    */
    uint32_t PID28:1;                   /**< bit:     28  Peripheral Clock 28 Enable                    */
    uint32_t PID29:1;                   /**< bit:     29  Peripheral Clock 29 Enable                    */
    uint32_t PID30:1;                   /**< bit:     30  Peripheral Clock 30 Enable                    */
    uint32_t PID31:1;                   /**< bit:     31  Peripheral Clock 31 Enable                    */
  };
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID:25;                    /**< bit:  7..31  Peripheral Clock 3x Enable                    */
  };
  uint32_t w;
} __PMC_PCER0_bits_t;

