zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_PCER0_PID7_Pos                    (7)                                            /**< (PMC_PCER0) Peripheral Clock 7 Enable Position */
#define PMC_PCER0_PID7_Msk                    (0x1U << PMC_PCER0_PID7_Pos)                   /**< (PMC_PCER0) Peripheral Clock 7 Enable Mask */
#define PMC_PCER0_PID8_Pos                    (8)                                            /**< (PMC_PCER0) Peripheral Clock 8 Enable Position */
#define PMC_PCER0_PID8_Msk                    (0x1U << PMC_PCER0_PID8_Pos)                   /**< (PMC_PCER0) Peripheral Clock 8 Enable Mask */
#define PMC_PCER0_PID9_Pos                    (9)                                            /**< (PMC_PCER0) Peripheral Clock 9 Enable Position */
#define PMC_PCER0_PID9_Msk                    (0x1U << PMC_PCER0_PID9_Pos)                   /**< (PMC_PCER0) Peripheral Clock 9 Enable Mask */
#define PMC_PCER0_PID10_Pos                   (10)                                           /**< (PMC_PCER0) Peripheral Clock 10 Enable Position */
#define PMC_PCER0_PID10_Msk                   (0x1U << PMC_PCER0_PID10_Pos)                  /**< (PMC_PCER0) Peripheral Clock 10 Enable Mask */
#define PMC_PCER0_PID11_Pos                   (11)                                           /**< (PMC_PCER0) Peripheral Clock 11 Enable Position */
#define PMC_PCER0_PID11_Msk                   (0x1U << PMC_PCER0_PID11_Pos)                  /**< (PMC_PCER0) Peripheral Clock 11 Enable Mask */
#define PMC_PCER0_PID12_Pos                   (12)                                           /**< (PMC_PCER0) Peripheral Clock 12 Enable Position */
#define PMC_PCER0_PID12_Msk                   (0x1U << PMC_PCER0_PID12_Pos)                  /**< (PMC_PCER0) Peripheral Clock 12 Enable Mask */
#define PMC_PCER0_PID13_Pos                   (13)                                           /**< (PMC_PCER0) Peripheral Clock 13 Enable Position */
#define PMC_PCER0_PID13_Msk                   (0x1U << PMC_PCER0_PID13_Pos)                  /**< (PMC_PCER0) Peripheral Clock 13 Enable Mask */
#define PMC_PCER0_PID14_Pos                   (14)                                           /**< (PMC_PCER0) Peripheral Clock 14 Enable Position */
#define PMC_PCER0_PID14_Msk                   (0x1U << PMC_PCER0_PID14_Pos)                  /**< (PMC_PCER0) Peripheral Clock 14 Enable Mask */
#define PMC_PCER0_PID15_Pos                   (15)                                           /**< (PMC_PCER0) Peripheral Clock 15 Enable Position */
#define PMC_PCER0_PID15_Msk                   (0x1U << PMC_PCER0_PID15_Pos)                  /**< (PMC_PCER0) Peripheral Clock 15 Enable Mask */
#define PMC_PCER0_PID16_Pos                   (16)                                           /**< (PMC_PCER0) Peripheral Clock 16 Enable Position */
#define PMC_PCER0_PID16_Msk                   (0x1U << PMC_PCER0_PID16_Pos)                  /**< (PMC_PCER0) Peripheral Clock 16 Enable Mask */
#define PMC_PCER0_PID17_Pos                   (17)                                           /**< (PMC_PCER0) Peripheral Clock 17 Enable Position */
#define PMC_PCER0_PID17_Msk                   (0x1U << PMC_PCER0_PID17_Pos)                  /**< (PMC_PCER0) Peripheral Clock 17 Enable Mask */
#define PMC_PCER0_PID18_Pos                   (18)                                           /**< (PMC_PCER0) Peripheral Clock 18 Enable Position */
#define PMC_PCER0_PID18_Msk                   (0x1U << PMC_PCER0_PID18_Pos)                  /**< (PMC_PCER0) Peripheral Clock 18 Enable Mask */
#define PMC_PCER0_PID19_Pos                   (19)                                           /**< (PMC_PCER0) Peripheral Clock 19 Enable Position */
#define PMC_PCER0_PID19_Msk                   (0x1U << PMC_PCER0_PID19_Pos)                  /**< (PMC_PCER0) Peripheral Clock 19 Enable Mask */
#define PMC_PCER0_PID20_Pos                   (20)                                           /**< (PMC_PCER0) Peripheral Clock 20 Enable Position */
#define PMC_PCER0_PID20_Msk                   (0x1U << PMC_PCER0_PID20_Pos)                  /**< (PMC_PCER0) Peripheral Clock 20 Enable Mask */
#define PMC_PCER0_PID21_Pos                   (21)                                           /**< (PMC_PCER0) Peripheral Clock 21 Enable Position */
#define PMC_PCER0_PID21_Msk                   (0x1U << PMC_PCER0_PID21_Pos)                  /**< (PMC_PCER0) Peripheral Clock 21 Enable Mask */
#define PMC_PCER0_PID22_Pos                   (22)                                           /**< (PMC_PCER0) Peripheral Clock 22 Enable Position */
#define PMC_PCER0_PID22_Msk                   (0x1U << PMC_PCER0_PID22_Pos)                  /**< (PMC_PCER0) Peripheral Clock 22 Enable Mask */
#define PMC_PCER0_PID23_Pos                   (23)                                           /**< (PMC_PCER0) Peripheral Clock 23 Enable Position */
#define PMC_PCER0_PID23_Msk                   (0x1U << PMC_PCER0_PID23_Pos)                  /**< (PMC_PCER0) Peripheral Clock 23 Enable Mask */
#define PMC_PCER0_PID24_Pos                   (24)                                           /**< (PMC_PCER0) Peripheral Clock 24 Enable Position */
#define PMC_PCER0_PID24_Msk                   (0x1U << PMC_PCER0_PID24_Pos)                  /**< (PMC_PCER0) Peripheral Clock 24 Enable Mask */
#define PMC_PCER0_PID25_Pos                   (25)                                           /**< (PMC_PCER0) Peripheral Clock 25 Enable Position */
#define PMC_PCER0_PID25_Msk                   (0x1U << PMC_PCER0_PID25_Pos)                  /**< (PMC_PCER0) Peripheral Clock 25 Enable Mask */
#define PMC_PCER0_PID26_Pos                   (26)                                           /**< (PMC_PCER0) Peripheral Clock 26 Enable Position */
#define PMC_PCER0_PID26_Msk                   (0x1U << PMC_PCER0_PID26_Pos)                  /**< (PMC_PCER0) Peripheral Clock 26 Enable Mask */
#define PMC_PCER0_PID27_Pos                   (27)                                           /**< (PMC_PCER0) Peripheral Clock 27 Enable Position */
#define PMC_PCER0_PID27_Msk                   (0x1U << PMC_PCER0_PID27_Pos)                  /**< (PMC_PCER0) Peripheral Clock 27 Enable Mask */
#define PMC_PCER0_PID28_Pos                   (28)                                           /**< (PMC_PCER0) Peripheral Clock 28 Enable Position */
#define PMC_PCER0_PID28_Msk                   (0x1U << PMC_PCER0_PID28_Pos)                  /**< (PMC_PCER0) Peripheral Clock 28 Enable Mask */
#define PMC_PCER0_PID29_Pos                   (29)                                           /**< (PMC_PCER0) Peripheral Clock 29 Enable Position */
#define PMC_PCER0_PID29_Msk                   (0x1U << PMC_PCER0_PID29_Pos)                  /**< (PMC_PCER0) Peripheral Clock 29 Enable Mask */
#define PMC_PCER0_PID30_Pos                   (30)                                           /**< (PMC_PCER0) Peripheral Clock 30 Enable Position */
#define PMC_PCER0_PID30_Msk                   (0x1U << PMC_PCER0_PID30_Pos)                  /**< (PMC_PCER0) Peripheral Clock 30 Enable Mask */
#define PMC_PCER0_PID31_Pos                   (31)                                           /**< (PMC_PCER0) Peripheral Clock 31 Enable Position */
#define PMC_PCER0_PID31_Msk                   (0x1U << PMC_PCER0_PID31_Pos)                  /**< (PMC_PCER0) Peripheral Clock 31 Enable Mask */
#define PMC_PCER0_Msk                         (0xFFFFFF80UL)                                 /**< (PMC_PCER0) Register Mask  */
#define PMC_PCER0_PID_Pos                     (7)                                            /**< (PMC_PCER0 Position) Peripheral Clock 3x Enable */
#define PMC_PCER0_PID_Msk                     (0x1FFFFFFU << PMC_PCER0_PID_Pos)              /**< (PMC_PCER0 Mask) PID */
#define PMC_PCER0_PID(value)                  (PMC_PCER0_PID_Msk & ((value) << PMC_PCER0_PID_Pos))

/* -------- PMC_PCDR0 : (PMC Offset: 0x14) (/W 32) Peripheral Clock Disable Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID7:1;                    /**< bit:      7  Peripheral Clock 7 Disable                    */
    uint32_t PID8:1;                    /**< bit:      8  Peripheral Clock 8 Disable                    */
    uint32_t PID9:1;                    /**< bit:      9  Peripheral Clock 9 Disable                    */
    uint32_t PID10:1;                   /**< bit:     10  Peripheral Clock 10 Disable                   */
    uint32_t PID11:1;                   /**< bit:     11  Peripheral Clock 11 Disable                   */
    uint32_t PID12:1;                   /**< bit:     12  Peripheral Clock 12 Disable                   */
    uint32_t PID13:1;                   /**< bit:     13  Peripheral Clock 13 Disable                   */
    uint32_t PID14:1;                   /**< bit:     14  Peripheral Clock 14 Disable                   */
    uint32_t PID15:1;                   /**< bit:     15  Peripheral Clock 15 Disable                   */
    uint32_t PID16:1;                   /**< bit:     16  Peripheral Clock 16 Disable                   */
    uint32_t PID17:1;                   /**< bit:     17  Peripheral Clock 17 Disable                   */
    uint32_t PID18:1;                   /**< bit:     18  Peripheral Clock 18 Disable                   */
    uint32_t PID19:1;                   /**< bit:     19  Peripheral Clock 19 Disable                   */
    uint32_t PID20:1;                   /**< bit:     20  Peripheral Clock 20 Disable                   */
    uint32_t PID21:1;                   /**< bit:     21  Peripheral Clock 21 Disable                   */
    uint32_t PID22:1;                   /**< bit:     22  Peripheral Clock 22 Disable                   */
    uint32_t PID23:1;                   /**< bit:     23  Peripheral Clock 23 Disable                   */
    uint32_t PID24:1;                   /**< bit:     24  Peripheral Clock 24 Disable                   */
    uint32_t PID25:1;                   /**< bit:     25  Peripheral Clock 25 Disable                   */
    uint32_t PID26:1;                   /**< bit:     26  Peripheral Clock 26 Disable                   */
    uint32_t PID27:1;                   /**< bit:     27  Peripheral Clock 27 Disable                   */
    uint32_t PID28:1;                   /**< bit:     28  Peripheral Clock 28 Disable                   */
    uint32_t PID29:1;                   /**< bit:     29  Peripheral Clock 29 Disable                   */
    uint32_t PID30:1;                   /**< bit:     30  Peripheral Clock 30 Disable                   */
    uint32_t PID31:1;                   /**< bit:     31  Peripheral Clock 31 Disable                   */
  };
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID:25;                    /**< bit:  7..31  Peripheral Clock 3x Disable                   */
  };
  uint32_t w;
} __PMC_PCDR0_bits_t;

#define PMC_PCDR0_PID7_Pos                    (7)                                            /**< (PMC_PCDR0) Peripheral Clock 7 Disable Position */
#define PMC_PCDR0_PID7_Msk                    (0x1U << PMC_PCDR0_PID7_Pos)                   /**< (PMC_PCDR0) Peripheral Clock 7 Disable Mask */
#define PMC_PCDR0_PID8_Pos                    (8)                                            /**< (PMC_PCDR0) Peripheral Clock 8 Disable Position */
#define PMC_PCDR0_PID8_Msk                    (0x1U << PMC_PCDR0_PID8_Pos)                   /**< (PMC_PCDR0) Peripheral Clock 8 Disable Mask */
#define PMC_PCDR0_PID9_Pos                    (9)                                            /**< (PMC_PCDR0) Peripheral Clock 9 Disable Position */
#define PMC_PCDR0_PID9_Msk                    (0x1U << PMC_PCDR0_PID9_Pos)                   /**< (PMC_PCDR0) Peripheral Clock 9 Disable Mask */
#define PMC_PCDR0_PID10_Pos                   (10)                                           /**< (PMC_PCDR0) Peripheral Clock 10 Disable Position */
#define PMC_PCDR0_PID10_Msk                   (0x1U << PMC_PCDR0_PID10_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 10 Disable Mask */
#define PMC_PCDR0_PID11_Pos                   (11)                                           /**< (PMC_PCDR0) Peripheral Clock 11 Disable Position */
#define PMC_PCDR0_PID11_Msk                   (0x1U << PMC_PCDR0_PID11_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 11 Disable Mask */
#define PMC_PCDR0_PID12_Pos                   (12)                                           /**< (PMC_PCDR0) Peripheral Clock 12 Disable Position */
#define PMC_PCDR0_PID12_Msk                   (0x1U << PMC_PCDR0_PID12_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 12 Disable Mask */
#define PMC_PCDR0_PID13_Pos                   (13)                                           /**< (PMC_PCDR0) Peripheral Clock 13 Disable Position */
#define PMC_PCDR0_PID13_Msk                   (0x1U << PMC_PCDR0_PID13_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 13 Disable Mask */
#define PMC_PCDR0_PID14_Pos                   (14)                                           /**< (PMC_PCDR0) Peripheral Clock 14 Disable Position */
#define PMC_PCDR0_PID14_Msk                   (0x1U << PMC_PCDR0_PID14_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 14 Disable Mask */
#define PMC_PCDR0_PID15_Pos                   (15)                                           /**< (PMC_PCDR0) Peripheral Clock 15 Disable Position */
#define PMC_PCDR0_PID15_Msk                   (0x1U << PMC_PCDR0_PID15_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 15 Disable Mask */
#define PMC_PCDR0_PID16_Pos                   (16)                                           /**< (PMC_PCDR0) Peripheral Clock 16 Disable Position */
#define PMC_PCDR0_PID16_Msk                   (0x1U << PMC_PCDR0_PID16_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 16 Disable Mask */
#define PMC_PCDR0_PID17_Pos                   (17)                                           /**< (PMC_PCDR0) Peripheral Clock 17 Disable Position */
#define PMC_PCDR0_PID17_Msk                   (0x1U << PMC_PCDR0_PID17_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 17 Disable Mask */
#define PMC_PCDR0_PID18_Pos                   (18)                                           /**< (PMC_PCDR0) Peripheral Clock 18 Disable Position */
#define PMC_PCDR0_PID18_Msk                   (0x1U << PMC_PCDR0_PID18_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 18 Disable Mask */
#define PMC_PCDR0_PID19_Pos                   (19)                                           /**< (PMC_PCDR0) Peripheral Clock 19 Disable Position */
#define PMC_PCDR0_PID19_Msk                   (0x1U << PMC_PCDR0_PID19_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 19 Disable Mask */
#define PMC_PCDR0_PID20_Pos                   (20)                                           /**< (PMC_PCDR0) Peripheral Clock 20 Disable Position */
#define PMC_PCDR0_PID20_Msk                   (0x1U << PMC_PCDR0_PID20_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 20 Disable Mask */
#define PMC_PCDR0_PID21_Pos                   (21)                                           /**< (PMC_PCDR0) Peripheral Clock 21 Disable Position */
#define PMC_PCDR0_PID21_Msk                   (0x1U << PMC_PCDR0_PID21_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 21 Disable Mask */
#define PMC_PCDR0_PID22_Pos                   (22)                                           /**< (PMC_PCDR0) Peripheral Clock 22 Disable Position */
#define PMC_PCDR0_PID22_Msk                   (0x1U << PMC_PCDR0_PID22_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 22 Disable Mask */
#define PMC_PCDR0_PID23_Pos                   (23)                                           /**< (PMC_PCDR0) Peripheral Clock 23 Disable Position */
#define PMC_PCDR0_PID23_Msk                   (0x1U << PMC_PCDR0_PID23_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 23 Disable Mask */
#define PMC_PCDR0_PID24_Pos                   (24)                                           /**< (PMC_PCDR0) Peripheral Clock 24 Disable Position */
#define PMC_PCDR0_PID24_Msk                   (0x1U << PMC_PCDR0_PID24_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 24 Disable Mask */
#define PMC_PCDR0_PID25_Pos                   (25)                                           /**< (PMC_PCDR0) Peripheral Clock 25 Disable Position */
#define PMC_PCDR0_PID25_Msk                   (0x1U << PMC_PCDR0_PID25_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 25 Disable Mask */
#define PMC_PCDR0_PID26_Pos                   (26)                                           /**< (PMC_PCDR0) Peripheral Clock 26 Disable Position */
#define PMC_PCDR0_PID26_Msk                   (0x1U << PMC_PCDR0_PID26_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 26 Disable Mask */
#define PMC_PCDR0_PID27_Pos                   (27)                                           /**< (PMC_PCDR0) Peripheral Clock 27 Disable Position */
#define PMC_PCDR0_PID27_Msk                   (0x1U << PMC_PCDR0_PID27_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 27 Disable Mask */
#define PMC_PCDR0_PID28_Pos                   (28)                                           /**< (PMC_PCDR0) Peripheral Clock 28 Disable Position */
#define PMC_PCDR0_PID28_Msk                   (0x1U << PMC_PCDR0_PID28_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 28 Disable Mask */
#define PMC_PCDR0_PID29_Pos                   (29)                                           /**< (PMC_PCDR0) Peripheral Clock 29 Disable Position */
#define PMC_PCDR0_PID29_Msk                   (0x1U << PMC_PCDR0_PID29_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 29 Disable Mask */
#define PMC_PCDR0_PID30_Pos                   (30)                                           /**< (PMC_PCDR0) Peripheral Clock 30 Disable Position */
#define PMC_PCDR0_PID30_Msk                   (0x1U << PMC_PCDR0_PID30_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 30 Disable Mask */
#define PMC_PCDR0_PID31_Pos                   (31)                                           /**< (PMC_PCDR0) Peripheral Clock 31 Disable Position */
#define PMC_PCDR0_PID31_Msk                   (0x1U << PMC_PCDR0_PID31_Pos)                  /**< (PMC_PCDR0) Peripheral Clock 31 Disable Mask */
#define PMC_PCDR0_Msk                         (0xFFFFFF80UL)                                 /**< (PMC_PCDR0) Register Mask  */
#define PMC_PCDR0_PID_Pos                     (7)                                            /**< (PMC_PCDR0 Position) Peripheral Clock 3x Disable */
#define PMC_PCDR0_PID_Msk                     (0x1FFFFFFU << PMC_PCDR0_PID_Pos)              /**< (PMC_PCDR0 Mask) PID */
#define PMC_PCDR0_PID(value)                  (PMC_PCDR0_PID_Msk & ((value) << PMC_PCDR0_PID_Pos))

/* -------- PMC_PCSR0 : (PMC Offset: 0x18) (R/ 32) Peripheral Clock Status Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID7:1;                    /**< bit:      7  Peripheral Clock 7 Status                     */
    uint32_t PID8:1;                    /**< bit:      8  Peripheral Clock 8 Status                     */
    uint32_t PID9:1;                    /**< bit:      9  Peripheral Clock 9 Status                     */
    uint32_t PID10:1;                   /**< bit:     10  Peripheral Clock 10 Status                    */
    uint32_t PID11:1;                   /**< bit:     11  Peripheral Clock 11 Status                    */
    uint32_t PID12:1;                   /**< bit:     12  Peripheral Clock 12 Status                    */
    uint32_t PID13:1;                   /**< bit:     13  Peripheral Clock 13 Status                    */
    uint32_t PID14:1;                   /**< bit:     14  Peripheral Clock 14 Status                    */
    uint32_t PID15:1;                   /**< bit:     15  Peripheral Clock 15 Status                    */
    uint32_t PID16:1;                   /**< bit:     16  Peripheral Clock 16 Status                    */
    uint32_t PID17:1;                   /**< bit:     17  Peripheral Clock 17 Status                    */
    uint32_t PID18:1;                   /**< bit:     18  Peripheral Clock 18 Status                    */
    uint32_t PID19:1;                   /**< bit:     19  Peripheral Clock 19 Status                    */
    uint32_t PID20:1;                   /**< bit:     20  Peripheral Clock 20 Status                    */
    uint32_t PID21:1;                   /**< bit:     21  Peripheral Clock 21 Status                    */
    uint32_t PID22:1;                   /**< bit:     22  Peripheral Clock 22 Status                    */
    uint32_t PID23:1;                   /**< bit:     23  Peripheral Clock 23 Status                    */
    uint32_t PID24:1;                   /**< bit:     24  Peripheral Clock 24 Status                    */
    uint32_t PID25:1;                   /**< bit:     25  Peripheral Clock 25 Status                    */
    uint32_t PID26:1;                   /**< bit:     26  Peripheral Clock 26 Status                    */
    uint32_t PID27:1;                   /**< bit:     27  Peripheral Clock 27 Status                    */
    uint32_t PID28:1;                   /**< bit:     28  Peripheral Clock 28 Status                    */
    uint32_t PID29:1;                   /**< bit:     29  Peripheral Clock 29 Status                    */
    uint32_t PID30:1;                   /**< bit:     30  Peripheral Clock 30 Status                    */
    uint32_t PID31:1;                   /**< bit:     31  Peripheral Clock 31 Status                    */
  };
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID:25;                    /**< bit:  7..31  Peripheral Clock 3x Status                    */
  };
  uint32_t w;
} __PMC_PCSR0_bits_t;

