zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
/* -------- CKGR_UCKR : (PMC Offset: 0x1c) (R/W 32) UTMI Clock Register -------- */

typedef union
{
  struct
  {
    uint32_t :16;                       /**< bit:  0..15  Reserved                                      */
    uint32_t UPLLEN:1;                  /**< bit:     16  UTMI PLL Enable                               */
    uint32_t :3;                        /**< bit: 17..19  Reserved                                      */
    uint32_t UPLLCOUNT:4;               /**< bit: 20..23  UTMI PLL Startup Time                         */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __CKGR_UCKR_bits_t;

#define CKGR_UCKR_UPLLEN_Pos                  (16)                                           /**< (CKGR_UCKR) UTMI PLL Enable Position */
#define CKGR_UCKR_UPLLEN_Msk                  (0x1U << CKGR_UCKR_UPLLEN_Pos)                 /**< (CKGR_UCKR) UTMI PLL Enable Mask */
#define CKGR_UCKR_UPLLCOUNT_Pos               (20)                                           /**< (CKGR_UCKR) UTMI PLL Startup Time Position */
#define CKGR_UCKR_UPLLCOUNT_Msk               (0xFU << CKGR_UCKR_UPLLCOUNT_Pos)              /**< (CKGR_UCKR) UTMI PLL Startup Time Mask */
#define CKGR_UCKR_UPLLCOUNT(value)            (CKGR_UCKR_UPLLCOUNT_Msk & ((value) << CKGR_UCKR_UPLLCOUNT_Pos))
#define CKGR_UCKR_Msk                         (0x00F10000UL)                                 /**< (CKGR_UCKR) Register Mask  */

/* -------- CKGR_MOR : (PMC Offset: 0x20) (R/W 32) Main Oscillator Register -------- */

typedef union
{
  struct
  {
    uint32_t MOSCXTEN:1;                /**< bit:      0  Main Crystal Oscillator Enable                */
    uint32_t MOSCXTBY:1;                /**< bit:      1  Main Crystal Oscillator Bypass                */
    uint32_t WAITMODE:1;                /**< bit:      2  Wait Mode Command (Write-only)                */
    uint32_t MOSCRCEN:1;                /**< bit:      3  Main RC Oscillator Enable                     */
    uint32_t MOSCRCF:3;                 /**< bit:   4..6  Main RC Oscillator Frequency Selection        */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t MOSCXTST:8;                /**< bit:  8..15  Main Crystal Oscillator Startup Time          */
    uint32_t KEY:8;                     /**< bit: 16..23  Write Access Password                         */
    uint32_t MOSCSEL:1;                 /**< bit:     24  Main Clock Oscillator Selection               */
    uint32_t CFDEN:1;                   /**< bit:     25  Clock Failure Detector Enable                 */
    uint32_t XT32KFME:1;                /**< bit:     26  32.768 kHz Crystal Oscillator Frequency Monitoring Enable */
    uint32_t :5;                        /**< bit: 27..31  Reserved                                      */
  };
  uint32_t w;
} __CKGR_MOR_bits_t;

#define CKGR_MOR_MOSCXTEN_Pos                 (0)                                            /**< (CKGR_MOR) Main Crystal Oscillator Enable Position */
#define CKGR_MOR_MOSCXTEN_Msk                 (0x1U << CKGR_MOR_MOSCXTEN_Pos)                /**< (CKGR_MOR) Main Crystal Oscillator Enable Mask */
#define CKGR_MOR_MOSCXTBY_Pos                 (1)                                            /**< (CKGR_MOR) Main Crystal Oscillator Bypass Position */
#define CKGR_MOR_MOSCXTBY_Msk                 (0x1U << CKGR_MOR_MOSCXTBY_Pos)                /**< (CKGR_MOR) Main Crystal Oscillator Bypass Mask */
#define CKGR_MOR_WAITMODE_Pos                 (2)                                            /**< (CKGR_MOR) Wait Mode Command (Write-only) Position */
#define CKGR_MOR_WAITMODE_Msk                 (0x1U << CKGR_MOR_WAITMODE_Pos)                /**< (CKGR_MOR) Wait Mode Command (Write-only) Mask */
#define CKGR_MOR_MOSCRCEN_Pos                 (3)                                            /**< (CKGR_MOR) Main RC Oscillator Enable Position */
#define CKGR_MOR_MOSCRCEN_Msk                 (0x1U << CKGR_MOR_MOSCRCEN_Pos)                /**< (CKGR_MOR) Main RC Oscillator Enable Mask */
#define CKGR_MOR_MOSCRCF_Pos                  (4)                                            /**< (CKGR_MOR) Main RC Oscillator Frequency Selection Position */
#define CKGR_MOR_MOSCRCF_Msk                  (0x7U << CKGR_MOR_MOSCRCF_Pos)                 /**< (CKGR_MOR) Main RC Oscillator Frequency Selection Mask */
#define CKGR_MOR_MOSCRCF(value)               (CKGR_MOR_MOSCRCF_Msk & ((value) << CKGR_MOR_MOSCRCF_Pos))
#define   CKGR_MOR_MOSCRCF_4_MHz_Val          (0x0U)                                         /**< (CKGR_MOR) The RC oscillator frequency is at 4 MHz  */
#define   CKGR_MOR_MOSCRCF_8_MHz_Val          (0x1U)                                         /**< (CKGR_MOR) The RC oscillator frequency is at 8 MHz  */
#define   CKGR_MOR_MOSCRCF_12_MHz_Val         (0x2U)                                         /**< (CKGR_MOR) The RC oscillator frequency is at 12 MHz  */
#define CKGR_MOR_MOSCRCF_4_MHz                (CKGR_MOR_MOSCRCF_4_MHz_Val << CKGR_MOR_MOSCRCF_Pos)  /**< (CKGR_MOR) The RC oscillator frequency is at 4 MHz Position  */
#define CKGR_MOR_MOSCRCF_8_MHz                (CKGR_MOR_MOSCRCF_8_MHz_Val << CKGR_MOR_MOSCRCF_Pos)  /**< (CKGR_MOR) The RC oscillator frequency is at 8 MHz Position  */
#define CKGR_MOR_MOSCRCF_12_MHz               (CKGR_MOR_MOSCRCF_12_MHz_Val << CKGR_MOR_MOSCRCF_Pos)  /**< (CKGR_MOR) The RC oscillator frequency is at 12 MHz Position  */
#define CKGR_MOR_MOSCXTST_Pos                 (8)                                            /**< (CKGR_MOR) Main Crystal Oscillator Startup Time Position */
#define CKGR_MOR_MOSCXTST_Msk                 (0xFFU << CKGR_MOR_MOSCXTST_Pos)               /**< (CKGR_MOR) Main Crystal Oscillator Startup Time Mask */
#define CKGR_MOR_MOSCXTST(value)              (CKGR_MOR_MOSCXTST_Msk & ((value) << CKGR_MOR_MOSCXTST_Pos))
#define CKGR_MOR_KEY_Pos                      (16)                                           /**< (CKGR_MOR) Write Access Password Position */
#define CKGR_MOR_KEY_Msk                      (0xFFU << CKGR_MOR_KEY_Pos)                    /**< (CKGR_MOR) Write Access Password Mask */
#define CKGR_MOR_KEY(value)                   (CKGR_MOR_KEY_Msk & ((value) << CKGR_MOR_KEY_Pos))
#define   CKGR_MOR_KEY_PASSWD_Val             (0x37U)                                        /**< (CKGR_MOR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define CKGR_MOR_KEY_PASSWD                   (CKGR_MOR_KEY_PASSWD_Val << CKGR_MOR_KEY_Pos)  /**< (CKGR_MOR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define CKGR_MOR_MOSCSEL_Pos                  (24)                                           /**< (CKGR_MOR) Main Clock Oscillator Selection Position */
#define CKGR_MOR_MOSCSEL_Msk                  (0x1U << CKGR_MOR_MOSCSEL_Pos)                 /**< (CKGR_MOR) Main Clock Oscillator Selection Mask */
#define CKGR_MOR_CFDEN_Pos                    (25)                                           /**< (CKGR_MOR) Clock Failure Detector Enable Position */
#define CKGR_MOR_CFDEN_Msk                    (0x1U << CKGR_MOR_CFDEN_Pos)                   /**< (CKGR_MOR) Clock Failure Detector Enable Mask */
#define CKGR_MOR_XT32KFME_Pos                 (26)                                           /**< (CKGR_MOR) 32.768 kHz Crystal Oscillator Frequency Monitoring Enable Position */
#define CKGR_MOR_XT32KFME_Msk                 (0x1U << CKGR_MOR_XT32KFME_Pos)                /**< (CKGR_MOR) 32.768 kHz Crystal Oscillator Frequency Monitoring Enable Mask */
#define CKGR_MOR_Msk                          (0x07FFFF7FUL)                                 /**< (CKGR_MOR) Register Mask  */

/* -------- CKGR_MCFR : (PMC Offset: 0x24) (R/W 32) Main Clock Frequency Register -------- */

typedef union
{
  struct
  {
    uint32_t MAINF:16;                  /**< bit:  0..15  Main Clock Frequency                          */
    uint32_t MAINFRDY:1;                /**< bit:     16  Main Clock Frequency Measure Ready            */
    uint32_t :3;                        /**< bit: 17..19  Reserved                                      */
    uint32_t RCMEAS:1;                  /**< bit:     20  RC Oscillator Frequency Measure (write-only)  */
    uint32_t :3;                        /**< bit: 21..23  Reserved                                      */
    uint32_t CCSS:1;                    /**< bit:     24  Counter Clock Source Selection                */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __CKGR_MCFR_bits_t;

#define CKGR_MCFR_MAINF_Pos                   (0)                                            /**< (CKGR_MCFR) Main Clock Frequency Position */
#define CKGR_MCFR_MAINF_Msk                   (0xFFFFU << CKGR_MCFR_MAINF_Pos)               /**< (CKGR_MCFR) Main Clock Frequency Mask */
#define CKGR_MCFR_MAINF(value)                (CKGR_MCFR_MAINF_Msk & ((value) << CKGR_MCFR_MAINF_Pos))
#define CKGR_MCFR_MAINFRDY_Pos                (16)                                           /**< (CKGR_MCFR) Main Clock Frequency Measure Ready Position */
#define CKGR_MCFR_MAINFRDY_Msk                (0x1U << CKGR_MCFR_MAINFRDY_Pos)               /**< (CKGR_MCFR) Main Clock Frequency Measure Ready Mask */
#define CKGR_MCFR_RCMEAS_Pos                  (20)                                           /**< (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Position */
#define CKGR_MCFR_RCMEAS_Msk                  (0x1U << CKGR_MCFR_RCMEAS_Pos)                 /**< (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Mask */
#define CKGR_MCFR_CCSS_Pos                    (24)                                           /**< (CKGR_MCFR) Counter Clock Source Selection Position */
#define CKGR_MCFR_CCSS_Msk                    (0x1U << CKGR_MCFR_CCSS_Pos)                   /**< (CKGR_MCFR) Counter Clock Source Selection Mask */
#define CKGR_MCFR_Msk                         (0x0111FFFFUL)                                 /**< (CKGR_MCFR) Register Mask  */

/* -------- CKGR_PLLAR : (PMC Offset: 0x28) (R/W 32) PLLA Register -------- */

typedef union
{
  struct
  {
    uint32_t DIVA:8;                    /**< bit:   0..7  PLLA Front End Divider                        */
    uint32_t PLLACOUNT:6;               /**< bit:  8..13  PLLA Counter                                  */
    uint32_t :2;                        /**< bit: 14..15  Reserved                                      */
    uint32_t MULA:11;                   /**< bit: 16..26  PLLA Multiplier                               */
    uint32_t :2;                        /**< bit: 27..28  Reserved                                      */
    uint32_t ONE:1;                     /**< bit:     29  Must Be Set to 1                              */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __CKGR_PLLAR_bits_t;

#define CKGR_PLLAR_DIVA_Pos                   (0)                                            /**< (CKGR_PLLAR) PLLA Front End Divider Position */
#define CKGR_PLLAR_DIVA_Msk                   (0xFFU << CKGR_PLLAR_DIVA_Pos)                 /**< (CKGR_PLLAR) PLLA Front End Divider Mask */
#define CKGR_PLLAR_DIVA(value)                (CKGR_PLLAR_DIVA_Msk & ((value) << CKGR_PLLAR_DIVA_Pos))
#define   CKGR_PLLAR_DIVA_0_Val               (0x0U)                                         /**< (CKGR_PLLAR) Divider output is 0 and PLLA is disabled.  */
#define   CKGR_PLLAR_DIVA_BYPASS_Val          (0x1U)                                         /**< (CKGR_PLLAR) Divider is bypassed (divide by 1) and PLLA is enabled.  */
#define CKGR_PLLAR_DIVA_0                     (CKGR_PLLAR_DIVA_0_Val << CKGR_PLLAR_DIVA_Pos)  /**< (CKGR_PLLAR) Divider output is 0 and PLLA is disabled. Position  */
#define CKGR_PLLAR_DIVA_BYPASS                (CKGR_PLLAR_DIVA_BYPASS_Val << CKGR_PLLAR_DIVA_Pos)  /**< (CKGR_PLLAR) Divider is bypassed (divide by 1) and PLLA is enabled. Position  */
#define CKGR_PLLAR_PLLACOUNT_Pos              (8)                                            /**< (CKGR_PLLAR) PLLA Counter Position */
#define CKGR_PLLAR_PLLACOUNT_Msk              (0x3FU << CKGR_PLLAR_PLLACOUNT_Pos)            /**< (CKGR_PLLAR) PLLA Counter Mask */
#define CKGR_PLLAR_PLLACOUNT(value)           (CKGR_PLLAR_PLLACOUNT_Msk & ((value) << CKGR_PLLAR_PLLACOUNT_Pos))
#define CKGR_PLLAR_MULA_Pos                   (16)                                           /**< (CKGR_PLLAR) PLLA Multiplier Position */
#define CKGR_PLLAR_MULA_Msk                   (0x7FFU << CKGR_PLLAR_MULA_Pos)                /**< (CKGR_PLLAR) PLLA Multiplier Mask */
#define CKGR_PLLAR_MULA(value)                (CKGR_PLLAR_MULA_Msk & ((value) << CKGR_PLLAR_MULA_Pos))
#define CKGR_PLLAR_ONE_Pos                    (29)                                           /**< (CKGR_PLLAR) Must Be Set to 1 Position */
#define CKGR_PLLAR_ONE_Msk                    (0x1U << CKGR_PLLAR_ONE_Pos)                   /**< (CKGR_PLLAR) Must Be Set to 1 Mask */
#define CKGR_PLLAR_Msk                        (0x27FF3FFFUL)                                 /**< (CKGR_PLLAR) Register Mask  */

/* -------- PMC_MCKR : (PMC Offset: 0x30) (R/W 32) Master Clock Register -------- */

typedef union
{
  struct
  {
    uint32_t CSS:2;                     /**< bit:   0..1  Master Clock Source Selection                 */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t PRES:3;                    /**< bit:   4..6  Processor Clock Prescaler                     */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t MDIV:2;                    /**< bit:   8..9  Master Clock Division                         */
    uint32_t :3;                        /**< bit: 10..12  Reserved                                      */
    uint32_t UPLLDIV2:1;                /**< bit:     13  UPLL Divider by 2                             */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_MCKR_bits_t;

#define PMC_MCKR_CSS_Pos                      (0)                                            /**< (PMC_MCKR) Master Clock Source Selection Position */
#define PMC_MCKR_CSS_Msk                      (0x3U << PMC_MCKR_CSS_Pos)                     /**< (PMC_MCKR) Master Clock Source Selection Mask */
#define PMC_MCKR_CSS(value)                   (PMC_MCKR_CSS_Msk & ((value) << PMC_MCKR_CSS_Pos))
#define   PMC_MCKR_CSS_SLOW_CLK_Val           (0x0U)                                         /**< (PMC_MCKR) SLCK is selected  */
#define   PMC_MCKR_CSS_MAIN_CLK_Val           (0x1U)                                         /**< (PMC_MCKR) MAINCK is selected  */
#define   PMC_MCKR_CSS_PLLA_CLK_Val           (0x2U)                                         /**< (PMC_MCKR) PLLACK is selected  */
#define   PMC_MCKR_CSS_UPLL_CLK_Val           (0x3U)                                         /**< (PMC_MCKR) UPPLLCKDIV is selected  */
#define PMC_MCKR_CSS_SLOW_CLK                 (PMC_MCKR_CSS_SLOW_CLK_Val << PMC_MCKR_CSS_Pos)  /**< (PMC_MCKR) SLCK is selected Position  */
#define PMC_MCKR_CSS_MAIN_CLK                 (PMC_MCKR_CSS_MAIN_CLK_Val << PMC_MCKR_CSS_Pos)  /**< (PMC_MCKR) MAINCK is selected Position  */
#define PMC_MCKR_CSS_PLLA_CLK                 (PMC_MCKR_CSS_PLLA_CLK_Val << PMC_MCKR_CSS_Pos)  /**< (PMC_MCKR) PLLACK is selected Position  */
#define PMC_MCKR_CSS_UPLL_CLK                 (PMC_MCKR_CSS_UPLL_CLK_Val << PMC_MCKR_CSS_Pos)  /**< (PMC_MCKR) UPPLLCKDIV is selected Position  */
#define PMC_MCKR_PRES_Pos                     (4)                                            /**< (PMC_MCKR) Processor Clock Prescaler Position */
#define PMC_MCKR_PRES_Msk                     (0x7U << PMC_MCKR_PRES_Pos)                    /**< (PMC_MCKR) Processor Clock Prescaler Mask */
#define PMC_MCKR_PRES(value)                  (PMC_MCKR_PRES_Msk & ((value) << PMC_MCKR_PRES_Pos))
#define   PMC_MCKR_PRES_CLK_1_Val             (0x0U)                                         /**< (PMC_MCKR) Selected clock  */
#define   PMC_MCKR_PRES_CLK_2_Val             (0x1U)                                         /**< (PMC_MCKR) Selected clock divided by 2  */
#define   PMC_MCKR_PRES_CLK_4_Val             (0x2U)                                         /**< (PMC_MCKR) Selected clock divided by 4  */
#define   PMC_MCKR_PRES_CLK_8_Val             (0x3U)                                         /**< (PMC_MCKR) Selected clock divided by 8  */
#define   PMC_MCKR_PRES_CLK_16_Val            (0x4U)                                         /**< (PMC_MCKR) Selected clock divided by 16  */
#define   PMC_MCKR_PRES_CLK_32_Val            (0x5U)                                         /**< (PMC_MCKR) Selected clock divided by 32  */
#define   PMC_MCKR_PRES_CLK_64_Val            (0x6U)                                         /**< (PMC_MCKR) Selected clock divided by 64  */
#define   PMC_MCKR_PRES_CLK_3_Val             (0x7U)                                         /**< (PMC_MCKR) Selected clock divided by 3  */
#define PMC_MCKR_PRES_CLK_1                   (PMC_MCKR_PRES_CLK_1_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock Position  */
#define PMC_MCKR_PRES_CLK_2                   (PMC_MCKR_PRES_CLK_2_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock divided by 2 Position  */
#define PMC_MCKR_PRES_CLK_4                   (PMC_MCKR_PRES_CLK_4_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock divided by 4 Position  */
#define PMC_MCKR_PRES_CLK_8                   (PMC_MCKR_PRES_CLK_8_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock divided by 8 Position  */
#define PMC_MCKR_PRES_CLK_16                  (PMC_MCKR_PRES_CLK_16_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock divided by 16 Position  */
#define PMC_MCKR_PRES_CLK_32                  (PMC_MCKR_PRES_CLK_32_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock divided by 32 Position  */
#define PMC_MCKR_PRES_CLK_64                  (PMC_MCKR_PRES_CLK_64_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock divided by 64 Position  */
#define PMC_MCKR_PRES_CLK_3                   (PMC_MCKR_PRES_CLK_3_Val << PMC_MCKR_PRES_Pos)  /**< (PMC_MCKR) Selected clock divided by 3 Position  */
#define PMC_MCKR_MDIV_Pos                     (8)                                            /**< (PMC_MCKR) Master Clock Division Position */
#define PMC_MCKR_MDIV_Msk                     (0x3U << PMC_MCKR_MDIV_Pos)                    /**< (PMC_MCKR) Master Clock Division Mask */
#define PMC_MCKR_MDIV(value)                  (PMC_MCKR_MDIV_Msk & ((value) << PMC_MCKR_MDIV_Pos))
#define   PMC_MCKR_MDIV_EQ_PCK_Val            (0x0U)                                         /**< (PMC_MCKR) MCK is FCLK divided by 1.  */
#define   PMC_MCKR_MDIV_PCK_DIV2_Val          (0x1U)                                         /**< (PMC_MCKR) MCK is FCLK divided by 2.  */
#define   PMC_MCKR_MDIV_PCK_DIV4_Val          (0x2U)                                         /**< (PMC_MCKR) MCK is FCLK divided by 4.  */
#define   PMC_MCKR_MDIV_PCK_DIV3_Val          (0x3U)                                         /**< (PMC_MCKR) MCK is FCLK divided by 3.  */
#define PMC_MCKR_MDIV_EQ_PCK                  (PMC_MCKR_MDIV_EQ_PCK_Val << PMC_MCKR_MDIV_Pos)  /**< (PMC_MCKR) MCK is FCLK divided by 1. Position  */
#define PMC_MCKR_MDIV_PCK_DIV2                (PMC_MCKR_MDIV_PCK_DIV2_Val << PMC_MCKR_MDIV_Pos)  /**< (PMC_MCKR) MCK is FCLK divided by 2. Position  */
#define PMC_MCKR_MDIV_PCK_DIV4                (PMC_MCKR_MDIV_PCK_DIV4_Val << PMC_MCKR_MDIV_Pos)  /**< (PMC_MCKR) MCK is FCLK divided by 4. Position  */
#define PMC_MCKR_MDIV_PCK_DIV3                (PMC_MCKR_MDIV_PCK_DIV3_Val << PMC_MCKR_MDIV_Pos)  /**< (PMC_MCKR) MCK is FCLK divided by 3. Position  */
#define PMC_MCKR_UPLLDIV2_Pos                 (13)                                           /**< (PMC_MCKR) UPLL Divider by 2 Position */
#define PMC_MCKR_UPLLDIV2_Msk                 (0x1U << PMC_MCKR_UPLLDIV2_Pos)                /**< (PMC_MCKR) UPLL Divider by 2 Mask */
#define PMC_MCKR_Msk                          (0x00002373UL)                                 /**< (PMC_MCKR) Register Mask  */

