zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
/* -------- PMC_USB : (PMC Offset: 0x38) (R/W 32) USB Clock Register -------- */

typedef union
{
  struct
  {
    uint32_t USBS:1;                    /**< bit:      0  USB Input Clock Selection                     */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t USBDIV:4;                  /**< bit:  8..11  Divider for USB_48M                           */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_USB_bits_t;

#define PMC_USB_USBS_Pos                      (0)                                            /**< (PMC_USB) USB Input Clock Selection Position */
#define PMC_USB_USBS_Msk                      (0x1U << PMC_USB_USBS_Pos)                     /**< (PMC_USB) USB Input Clock Selection Mask */
#define PMC_USB_USBDIV_Pos                    (8)                                            /**< (PMC_USB) Divider for USB_48M Position */
#define PMC_USB_USBDIV_Msk                    (0xFU << PMC_USB_USBDIV_Pos)                   /**< (PMC_USB) Divider for USB_48M Mask */
#define PMC_USB_USBDIV(value)                 (PMC_USB_USBDIV_Msk & ((value) << PMC_USB_USBDIV_Pos))
#define PMC_USB_Msk                           (0x00000F01UL)                                 /**< (PMC_USB) Register Mask  */

/* -------- PMC_PCK : (PMC Offset: 0x40) (R/W 32) Programmable Clock Register (chid = 0) 0 -------- */

typedef union
{
  struct
  {
    uint32_t CSS:3;                     /**< bit:   0..2  Programmable Clock Source Selection           */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t PRES:8;                    /**< bit:  4..11  Programmable Clock Prescaler                  */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_PCK_bits_t;

#define PMC_PCK_CSS_Pos                       (0)                                            /**< (PMC_PCK) Programmable Clock Source Selection Position */
#define PMC_PCK_CSS_Msk                       (0x7U << PMC_PCK_CSS_Pos)                      /**< (PMC_PCK) Programmable Clock Source Selection Mask */
#define PMC_PCK_CSS(value)                    (PMC_PCK_CSS_Msk & ((value) << PMC_PCK_CSS_Pos))
#define   PMC_PCK_CSS_SLOW_CLK_Val            (0x0U)                                         /**< (PMC_PCK) SLCK is selected  */
#define   PMC_PCK_CSS_MAIN_CLK_Val            (0x1U)                                         /**< (PMC_PCK) MAINCK is selected  */
#define   PMC_PCK_CSS_PLLA_CLK_Val            (0x2U)                                         /**< (PMC_PCK) PLLACK is selected  */
#define   PMC_PCK_CSS_UPLL_CLK_Val            (0x3U)                                         /**< (PMC_PCK) UPLLCKDIV is selected  */
#define   PMC_PCK_CSS_MCK_Val                 (0x4U)                                         /**< (PMC_PCK) MCK is selected  */
#define PMC_PCK_CSS_SLOW_CLK                  (PMC_PCK_CSS_SLOW_CLK_Val << PMC_PCK_CSS_Pos)  /**< (PMC_PCK) SLCK is selected Position  */
#define PMC_PCK_CSS_MAIN_CLK                  (PMC_PCK_CSS_MAIN_CLK_Val << PMC_PCK_CSS_Pos)  /**< (PMC_PCK) MAINCK is selected Position  */
#define PMC_PCK_CSS_PLLA_CLK                  (PMC_PCK_CSS_PLLA_CLK_Val << PMC_PCK_CSS_Pos)  /**< (PMC_PCK) PLLACK is selected Position  */
#define PMC_PCK_CSS_UPLL_CLK                  (PMC_PCK_CSS_UPLL_CLK_Val << PMC_PCK_CSS_Pos)  /**< (PMC_PCK) UPLLCKDIV is selected Position  */
#define PMC_PCK_CSS_MCK                       (PMC_PCK_CSS_MCK_Val << PMC_PCK_CSS_Pos)       /**< (PMC_PCK) MCK is selected Position  */
#define PMC_PCK_PRES_Pos                      (4)                                            /**< (PMC_PCK) Programmable Clock Prescaler Position */
#define PMC_PCK_PRES_Msk                      (0xFFU << PMC_PCK_PRES_Pos)                    /**< (PMC_PCK) Programmable Clock Prescaler Mask */
#define PMC_PCK_PRES(value)                   (PMC_PCK_PRES_Msk & ((value) << PMC_PCK_PRES_Pos))
#define PMC_PCK_Msk                           (0x00000FF7UL)                                 /**< (PMC_PCK) Register Mask  */

/* -------- PMC_IER : (PMC Offset: 0x60) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t MOSCXTS:1;                 /**< bit:      0  Main Crystal Oscillator Status Interrupt Enable */
    uint32_t LOCKA:1;                   /**< bit:      1  PLLA Lock Interrupt Enable                    */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t MCKRDY:1;                  /**< bit:      3  Master Clock Ready Interrupt Enable           */
    uint32_t :2;                        /**< bit:   4..5  Reserved                                      */
    uint32_t LOCKU:1;                   /**< bit:      6  UTMI PLL Lock Interrupt Enable                */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PCKRDY0:1;                 /**< bit:      8  Programmable Clock Ready 0 Interrupt Enable   */
    uint32_t PCKRDY1:1;                 /**< bit:      9  Programmable Clock Ready 1 Interrupt Enable   */
    uint32_t PCKRDY2:1;                 /**< bit:     10  Programmable Clock Ready 2 Interrupt Enable   */
    uint32_t PCKRDY3:1;                 /**< bit:     11  Programmable Clock Ready 3 Interrupt Enable   */
    uint32_t PCKRDY4:1;                 /**< bit:     12  Programmable Clock Ready 4 Interrupt Enable   */
    uint32_t PCKRDY5:1;                 /**< bit:     13  Programmable Clock Ready 5 Interrupt Enable   */
    uint32_t PCKRDY6:1;                 /**< bit:     14  Programmable Clock Ready 6 Interrupt Enable   */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t MOSCSELS:1;                /**< bit:     16  Main Clock Source Oscillator Selection Status Interrupt Enable */
    uint32_t MOSCRCS:1;                 /**< bit:     17  Main RC Oscillator Status Interrupt Enable    */
    uint32_t CFDEV:1;                   /**< bit:     18  Clock Failure Detector Event Interrupt Enable */
    uint32_t :2;                        /**< bit: 19..20  Reserved                                      */
    uint32_t XT32KERR:1;                /**< bit:     21  32.768 kHz Crystal Oscillator Error Interrupt Enable */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PCKRDY:7;                  /**< bit:  8..14  Programmable Clock Ready x Interrupt Enable   */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_IER_bits_t;

#define PMC_IER_MOSCXTS_Pos                   (0)                                            /**< (PMC_IER) Main Crystal Oscillator Status Interrupt Enable Position */
#define PMC_IER_MOSCXTS_Msk                   (0x1U << PMC_IER_MOSCXTS_Pos)                  /**< (PMC_IER) Main Crystal Oscillator Status Interrupt Enable Mask */
#define PMC_IER_LOCKA_Pos                     (1)                                            /**< (PMC_IER) PLLA Lock Interrupt Enable Position */
#define PMC_IER_LOCKA_Msk                     (0x1U << PMC_IER_LOCKA_Pos)                    /**< (PMC_IER) PLLA Lock Interrupt Enable Mask */
#define PMC_IER_MCKRDY_Pos                    (3)                                            /**< (PMC_IER) Master Clock Ready Interrupt Enable Position */
#define PMC_IER_MCKRDY_Msk                    (0x1U << PMC_IER_MCKRDY_Pos)                   /**< (PMC_IER) Master Clock Ready Interrupt Enable Mask */
#define PMC_IER_LOCKU_Pos                     (6)                                            /**< (PMC_IER) UTMI PLL Lock Interrupt Enable Position */
#define PMC_IER_LOCKU_Msk                     (0x1U << PMC_IER_LOCKU_Pos)                    /**< (PMC_IER) UTMI PLL Lock Interrupt Enable Mask */
#define PMC_IER_PCKRDY0_Pos                   (8)                                            /**< (PMC_IER) Programmable Clock Ready 0 Interrupt Enable Position */
#define PMC_IER_PCKRDY0_Msk                   (0x1U << PMC_IER_PCKRDY0_Pos)                  /**< (PMC_IER) Programmable Clock Ready 0 Interrupt Enable Mask */
#define PMC_IER_PCKRDY1_Pos                   (9)                                            /**< (PMC_IER) Programmable Clock Ready 1 Interrupt Enable Position */
#define PMC_IER_PCKRDY1_Msk                   (0x1U << PMC_IER_PCKRDY1_Pos)                  /**< (PMC_IER) Programmable Clock Ready 1 Interrupt Enable Mask */
#define PMC_IER_PCKRDY2_Pos                   (10)                                           /**< (PMC_IER) Programmable Clock Ready 2 Interrupt Enable Position */
#define PMC_IER_PCKRDY2_Msk                   (0x1U << PMC_IER_PCKRDY2_Pos)                  /**< (PMC_IER) Programmable Clock Ready 2 Interrupt Enable Mask */
#define PMC_IER_PCKRDY3_Pos                   (11)                                           /**< (PMC_IER) Programmable Clock Ready 3 Interrupt Enable Position */
#define PMC_IER_PCKRDY3_Msk                   (0x1U << PMC_IER_PCKRDY3_Pos)                  /**< (PMC_IER) Programmable Clock Ready 3 Interrupt Enable Mask */
#define PMC_IER_PCKRDY4_Pos                   (12)                                           /**< (PMC_IER) Programmable Clock Ready 4 Interrupt Enable Position */
#define PMC_IER_PCKRDY4_Msk                   (0x1U << PMC_IER_PCKRDY4_Pos)                  /**< (PMC_IER) Programmable Clock Ready 4 Interrupt Enable Mask */
#define PMC_IER_PCKRDY5_Pos                   (13)                                           /**< (PMC_IER) Programmable Clock Ready 5 Interrupt Enable Position */
#define PMC_IER_PCKRDY5_Msk                   (0x1U << PMC_IER_PCKRDY5_Pos)                  /**< (PMC_IER) Programmable Clock Ready 5 Interrupt Enable Mask */
#define PMC_IER_PCKRDY6_Pos                   (14)                                           /**< (PMC_IER) Programmable Clock Ready 6 Interrupt Enable Position */
#define PMC_IER_PCKRDY6_Msk                   (0x1U << PMC_IER_PCKRDY6_Pos)                  /**< (PMC_IER) Programmable Clock Ready 6 Interrupt Enable Mask */
#define PMC_IER_MOSCSELS_Pos                  (16)                                           /**< (PMC_IER) Main Clock Source Oscillator Selection Status Interrupt Enable Position */
#define PMC_IER_MOSCSELS_Msk                  (0x1U << PMC_IER_MOSCSELS_Pos)                 /**< (PMC_IER) Main Clock Source Oscillator Selection Status Interrupt Enable Mask */
#define PMC_IER_MOSCRCS_Pos                   (17)                                           /**< (PMC_IER) Main RC Oscillator Status Interrupt Enable Position */
#define PMC_IER_MOSCRCS_Msk                   (0x1U << PMC_IER_MOSCRCS_Pos)                  /**< (PMC_IER) Main RC Oscillator Status Interrupt Enable Mask */
#define PMC_IER_CFDEV_Pos                     (18)                                           /**< (PMC_IER) Clock Failure Detector Event Interrupt Enable Position */
#define PMC_IER_CFDEV_Msk                     (0x1U << PMC_IER_CFDEV_Pos)                    /**< (PMC_IER) Clock Failure Detector Event Interrupt Enable Mask */
#define PMC_IER_XT32KERR_Pos                  (21)                                           /**< (PMC_IER) 32.768 kHz Crystal Oscillator Error Interrupt Enable Position */
#define PMC_IER_XT32KERR_Msk                  (0x1U << PMC_IER_XT32KERR_Pos)                 /**< (PMC_IER) 32.768 kHz Crystal Oscillator Error Interrupt Enable Mask */
#define PMC_IER_Msk                           (0x00277F4BUL)                                 /**< (PMC_IER) Register Mask  */
#define PMC_IER_PCKRDY_Pos                    (8)                                            /**< (PMC_IER Position) Programmable Clock Ready x Interrupt Enable */
#define PMC_IER_PCKRDY_Msk                    (0x7FU << PMC_IER_PCKRDY_Pos)                  /**< (PMC_IER Mask) PCKRDY */
#define PMC_IER_PCKRDY(value)                 (PMC_IER_PCKRDY_Msk & ((value) << PMC_IER_PCKRDY_Pos))

/* -------- PMC_IDR : (PMC Offset: 0x64) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t MOSCXTS:1;                 /**< bit:      0  Main Crystal Oscillator Status Interrupt Disable */
    uint32_t LOCKA:1;                   /**< bit:      1  PLLA Lock Interrupt Disable                   */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t MCKRDY:1;                  /**< bit:      3  Master Clock Ready Interrupt Disable          */
    uint32_t :2;                        /**< bit:   4..5  Reserved                                      */
    uint32_t LOCKU:1;                   /**< bit:      6  UTMI PLL Lock Interrupt Disable               */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PCKRDY0:1;                 /**< bit:      8  Programmable Clock Ready 0 Interrupt Disable  */
    uint32_t PCKRDY1:1;                 /**< bit:      9  Programmable Clock Ready 1 Interrupt Disable  */
    uint32_t PCKRDY2:1;                 /**< bit:     10  Programmable Clock Ready 2 Interrupt Disable  */
    uint32_t PCKRDY3:1;                 /**< bit:     11  Programmable Clock Ready 3 Interrupt Disable  */
    uint32_t PCKRDY4:1;                 /**< bit:     12  Programmable Clock Ready 4 Interrupt Disable  */
    uint32_t PCKRDY5:1;                 /**< bit:     13  Programmable Clock Ready 5 Interrupt Disable  */
    uint32_t PCKRDY6:1;                 /**< bit:     14  Programmable Clock Ready 6 Interrupt Disable  */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t MOSCSELS:1;                /**< bit:     16  Main Clock Source Oscillator Selection Status Interrupt Disable */
    uint32_t MOSCRCS:1;                 /**< bit:     17  Main RC Status Interrupt Disable              */
    uint32_t CFDEV:1;                   /**< bit:     18  Clock Failure Detector Event Interrupt Disable */
    uint32_t :2;                        /**< bit: 19..20  Reserved                                      */
    uint32_t XT32KERR:1;                /**< bit:     21  32.768 kHz Crystal Oscillator Error Interrupt Disable */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PCKRDY:7;                  /**< bit:  8..14  Programmable Clock Ready x Interrupt Disable  */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_IDR_bits_t;

#define PMC_IDR_MOSCXTS_Pos                   (0)                                            /**< (PMC_IDR) Main Crystal Oscillator Status Interrupt Disable Position */
#define PMC_IDR_MOSCXTS_Msk                   (0x1U << PMC_IDR_MOSCXTS_Pos)                  /**< (PMC_IDR) Main Crystal Oscillator Status Interrupt Disable Mask */
#define PMC_IDR_LOCKA_Pos                     (1)                                            /**< (PMC_IDR) PLLA Lock Interrupt Disable Position */
#define PMC_IDR_LOCKA_Msk                     (0x1U << PMC_IDR_LOCKA_Pos)                    /**< (PMC_IDR) PLLA Lock Interrupt Disable Mask */
#define PMC_IDR_MCKRDY_Pos                    (3)                                            /**< (PMC_IDR) Master Clock Ready Interrupt Disable Position */
#define PMC_IDR_MCKRDY_Msk                    (0x1U << PMC_IDR_MCKRDY_Pos)                   /**< (PMC_IDR) Master Clock Ready Interrupt Disable Mask */
#define PMC_IDR_LOCKU_Pos                     (6)                                            /**< (PMC_IDR) UTMI PLL Lock Interrupt Disable Position */
#define PMC_IDR_LOCKU_Msk                     (0x1U << PMC_IDR_LOCKU_Pos)                    /**< (PMC_IDR) UTMI PLL Lock Interrupt Disable Mask */
#define PMC_IDR_PCKRDY0_Pos                   (8)                                            /**< (PMC_IDR) Programmable Clock Ready 0 Interrupt Disable Position */
#define PMC_IDR_PCKRDY0_Msk                   (0x1U << PMC_IDR_PCKRDY0_Pos)                  /**< (PMC_IDR) Programmable Clock Ready 0 Interrupt Disable Mask */
#define PMC_IDR_PCKRDY1_Pos                   (9)                                            /**< (PMC_IDR) Programmable Clock Ready 1 Interrupt Disable Position */
#define PMC_IDR_PCKRDY1_Msk                   (0x1U << PMC_IDR_PCKRDY1_Pos)                  /**< (PMC_IDR) Programmable Clock Ready 1 Interrupt Disable Mask */
#define PMC_IDR_PCKRDY2_Pos                   (10)                                           /**< (PMC_IDR) Programmable Clock Ready 2 Interrupt Disable Position */
#define PMC_IDR_PCKRDY2_Msk                   (0x1U << PMC_IDR_PCKRDY2_Pos)                  /**< (PMC_IDR) Programmable Clock Ready 2 Interrupt Disable Mask */
#define PMC_IDR_PCKRDY3_Pos                   (11)                                           /**< (PMC_IDR) Programmable Clock Ready 3 Interrupt Disable Position */
#define PMC_IDR_PCKRDY3_Msk                   (0x1U << PMC_IDR_PCKRDY3_Pos)                  /**< (PMC_IDR) Programmable Clock Ready 3 Interrupt Disable Mask */
#define PMC_IDR_PCKRDY4_Pos                   (12)                                           /**< (PMC_IDR) Programmable Clock Ready 4 Interrupt Disable Position */
#define PMC_IDR_PCKRDY4_Msk                   (0x1U << PMC_IDR_PCKRDY4_Pos)                  /**< (PMC_IDR) Programmable Clock Ready 4 Interrupt Disable Mask */
#define PMC_IDR_PCKRDY5_Pos                   (13)                                           /**< (PMC_IDR) Programmable Clock Ready 5 Interrupt Disable Position */
#define PMC_IDR_PCKRDY5_Msk                   (0x1U << PMC_IDR_PCKRDY5_Pos)                  /**< (PMC_IDR) Programmable Clock Ready 5 Interrupt Disable Mask */
#define PMC_IDR_PCKRDY6_Pos                   (14)                                           /**< (PMC_IDR) Programmable Clock Ready 6 Interrupt Disable Position */
#define PMC_IDR_PCKRDY6_Msk                   (0x1U << PMC_IDR_PCKRDY6_Pos)                  /**< (PMC_IDR) Programmable Clock Ready 6 Interrupt Disable Mask */
#define PMC_IDR_MOSCSELS_Pos                  (16)                                           /**< (PMC_IDR) Main Clock Source Oscillator Selection Status Interrupt Disable Position */
#define PMC_IDR_MOSCSELS_Msk                  (0x1U << PMC_IDR_MOSCSELS_Pos)                 /**< (PMC_IDR) Main Clock Source Oscillator Selection Status Interrupt Disable Mask */
#define PMC_IDR_MOSCRCS_Pos                   (17)                                           /**< (PMC_IDR) Main RC Status Interrupt Disable Position */
#define PMC_IDR_MOSCRCS_Msk                   (0x1U << PMC_IDR_MOSCRCS_Pos)                  /**< (PMC_IDR) Main RC Status Interrupt Disable Mask */
#define PMC_IDR_CFDEV_Pos                     (18)                                           /**< (PMC_IDR) Clock Failure Detector Event Interrupt Disable Position */
#define PMC_IDR_CFDEV_Msk                     (0x1U << PMC_IDR_CFDEV_Pos)                    /**< (PMC_IDR) Clock Failure Detector Event Interrupt Disable Mask */
#define PMC_IDR_XT32KERR_Pos                  (21)                                           /**< (PMC_IDR) 32.768 kHz Crystal Oscillator Error Interrupt Disable Position */
#define PMC_IDR_XT32KERR_Msk                  (0x1U << PMC_IDR_XT32KERR_Pos)                 /**< (PMC_IDR) 32.768 kHz Crystal Oscillator Error Interrupt Disable Mask */
#define PMC_IDR_Msk                           (0x00277F4BUL)                                 /**< (PMC_IDR) Register Mask  */
#define PMC_IDR_PCKRDY_Pos                    (8)                                            /**< (PMC_IDR Position) Programmable Clock Ready x Interrupt Disable */
#define PMC_IDR_PCKRDY_Msk                    (0x7FU << PMC_IDR_PCKRDY_Pos)                  /**< (PMC_IDR Mask) PCKRDY */
#define PMC_IDR_PCKRDY(value)                 (PMC_IDR_PCKRDY_Msk & ((value) << PMC_IDR_PCKRDY_Pos))

/* -------- PMC_SR : (PMC Offset: 0x68) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t MOSCXTS:1;                 /**< bit:      0  Main Crystal Oscillator Status                */
    uint32_t LOCKA:1;                   /**< bit:      1  PLLA Lock Status                              */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t MCKRDY:1;                  /**< bit:      3  Master Clock Status                           */
    uint32_t :2;                        /**< bit:   4..5  Reserved                                      */
    uint32_t LOCKU:1;                   /**< bit:      6  UTMI PLL Lock Status                          */
    uint32_t OSCSELS:1;                 /**< bit:      7  Slow Clock Source Oscillator Selection        */
    uint32_t PCKRDY0:1;                 /**< bit:      8  Programmable Clock Ready Status               */
    uint32_t PCKRDY1:1;                 /**< bit:      9  Programmable Clock Ready Status               */
    uint32_t PCKRDY2:1;                 /**< bit:     10  Programmable Clock Ready Status               */
    uint32_t PCKRDY3:1;                 /**< bit:     11  Programmable Clock Ready Status               */
    uint32_t PCKRDY4:1;                 /**< bit:     12  Programmable Clock Ready Status               */
    uint32_t PCKRDY5:1;                 /**< bit:     13  Programmable Clock Ready Status               */
    uint32_t PCKRDY6:1;                 /**< bit:     14  Programmable Clock Ready Status               */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t MOSCSELS:1;                /**< bit:     16  Main Clock Source Oscillator Selection Status */
    uint32_t MOSCRCS:1;                 /**< bit:     17  Main RC Oscillator Status                     */
    uint32_t CFDEV:1;                   /**< bit:     18  Clock Failure Detector Event                  */
    uint32_t CFDS:1;                    /**< bit:     19  Clock Failure Detector Status                 */
    uint32_t FOS:1;                     /**< bit:     20  Clock Failure Detector Fault Output Status    */
    uint32_t XT32KERR:1;                /**< bit:     21  Slow Crystal Oscillator Error                 */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PCKRDY:7;                  /**< bit:  8..14  Programmable Clock Ready Status               */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_SR_bits_t;

