zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_SR_MOSCXTS_Pos                    (0)                                            /**< (PMC_SR) Main Crystal Oscillator Status Position */
#define PMC_SR_MOSCXTS_Msk                    (0x1U << PMC_SR_MOSCXTS_Pos)                   /**< (PMC_SR) Main Crystal Oscillator Status Mask */
#define PMC_SR_LOCKA_Pos                      (1)                                            /**< (PMC_SR) PLLA Lock Status Position */
#define PMC_SR_LOCKA_Msk                      (0x1U << PMC_SR_LOCKA_Pos)                     /**< (PMC_SR) PLLA Lock Status Mask */
#define PMC_SR_MCKRDY_Pos                     (3)                                            /**< (PMC_SR) Master Clock Status Position */
#define PMC_SR_MCKRDY_Msk                     (0x1U << PMC_SR_MCKRDY_Pos)                    /**< (PMC_SR) Master Clock Status Mask */
#define PMC_SR_LOCKU_Pos                      (6)                                            /**< (PMC_SR) UTMI PLL Lock Status Position */
#define PMC_SR_LOCKU_Msk                      (0x1U << PMC_SR_LOCKU_Pos)                     /**< (PMC_SR) UTMI PLL Lock Status Mask */
#define PMC_SR_OSCSELS_Pos                    (7)                                            /**< (PMC_SR) Slow Clock Source Oscillator Selection Position */
#define PMC_SR_OSCSELS_Msk                    (0x1U << PMC_SR_OSCSELS_Pos)                   /**< (PMC_SR) Slow Clock Source Oscillator Selection Mask */
#define PMC_SR_PCKRDY0_Pos                    (8)                                            /**< (PMC_SR) Programmable Clock Ready Status Position */
#define PMC_SR_PCKRDY0_Msk                    (0x1U << PMC_SR_PCKRDY0_Pos)                   /**< (PMC_SR) Programmable Clock Ready Status Mask */
#define PMC_SR_PCKRDY1_Pos                    (9)                                            /**< (PMC_SR) Programmable Clock Ready Status Position */
#define PMC_SR_PCKRDY1_Msk                    (0x1U << PMC_SR_PCKRDY1_Pos)                   /**< (PMC_SR) Programmable Clock Ready Status Mask */
#define PMC_SR_PCKRDY2_Pos                    (10)                                           /**< (PMC_SR) Programmable Clock Ready Status Position */
#define PMC_SR_PCKRDY2_Msk                    (0x1U << PMC_SR_PCKRDY2_Pos)                   /**< (PMC_SR) Programmable Clock Ready Status Mask */
#define PMC_SR_PCKRDY3_Pos                    (11)                                           /**< (PMC_SR) Programmable Clock Ready Status Position */
#define PMC_SR_PCKRDY3_Msk                    (0x1U << PMC_SR_PCKRDY3_Pos)                   /**< (PMC_SR) Programmable Clock Ready Status Mask */
#define PMC_SR_PCKRDY4_Pos                    (12)                                           /**< (PMC_SR) Programmable Clock Ready Status Position */
#define PMC_SR_PCKRDY4_Msk                    (0x1U << PMC_SR_PCKRDY4_Pos)                   /**< (PMC_SR) Programmable Clock Ready Status Mask */
#define PMC_SR_PCKRDY5_Pos                    (13)                                           /**< (PMC_SR) Programmable Clock Ready Status Position */
#define PMC_SR_PCKRDY5_Msk                    (0x1U << PMC_SR_PCKRDY5_Pos)                   /**< (PMC_SR) Programmable Clock Ready Status Mask */
#define PMC_SR_PCKRDY6_Pos                    (14)                                           /**< (PMC_SR) Programmable Clock Ready Status Position */
#define PMC_SR_PCKRDY6_Msk                    (0x1U << PMC_SR_PCKRDY6_Pos)                   /**< (PMC_SR) Programmable Clock Ready Status Mask */
#define PMC_SR_MOSCSELS_Pos                   (16)                                           /**< (PMC_SR) Main Clock Source Oscillator Selection Status Position */
#define PMC_SR_MOSCSELS_Msk                   (0x1U << PMC_SR_MOSCSELS_Pos)                  /**< (PMC_SR) Main Clock Source Oscillator Selection Status Mask */
#define PMC_SR_MOSCRCS_Pos                    (17)                                           /**< (PMC_SR) Main RC Oscillator Status Position */
#define PMC_SR_MOSCRCS_Msk                    (0x1U << PMC_SR_MOSCRCS_Pos)                   /**< (PMC_SR) Main RC Oscillator Status Mask */
#define PMC_SR_CFDEV_Pos                      (18)                                           /**< (PMC_SR) Clock Failure Detector Event Position */
#define PMC_SR_CFDEV_Msk                      (0x1U << PMC_SR_CFDEV_Pos)                     /**< (PMC_SR) Clock Failure Detector Event Mask */
#define PMC_SR_CFDS_Pos                       (19)                                           /**< (PMC_SR) Clock Failure Detector Status Position */
#define PMC_SR_CFDS_Msk                       (0x1U << PMC_SR_CFDS_Pos)                      /**< (PMC_SR) Clock Failure Detector Status Mask */
#define PMC_SR_FOS_Pos                        (20)                                           /**< (PMC_SR) Clock Failure Detector Fault Output Status Position */
#define PMC_SR_FOS_Msk                        (0x1U << PMC_SR_FOS_Pos)                       /**< (PMC_SR) Clock Failure Detector Fault Output Status Mask */
#define PMC_SR_XT32KERR_Pos                   (21)                                           /**< (PMC_SR) Slow Crystal Oscillator Error Position */
#define PMC_SR_XT32KERR_Msk                   (0x1U << PMC_SR_XT32KERR_Pos)                  /**< (PMC_SR) Slow Crystal Oscillator Error Mask */
#define PMC_SR_Msk                            (0x003F7FCBUL)                                 /**< (PMC_SR) Register Mask  */
#define PMC_SR_PCKRDY_Pos                     (8)                                            /**< (PMC_SR Position) Programmable Clock Ready Status */
#define PMC_SR_PCKRDY_Msk                     (0x7FU << PMC_SR_PCKRDY_Pos)                   /**< (PMC_SR Mask) PCKRDY */
#define PMC_SR_PCKRDY(value)                  (PMC_SR_PCKRDY_Msk & ((value) << PMC_SR_PCKRDY_Pos))

/* -------- PMC_IMR : (PMC Offset: 0x6c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t MOSCXTS:1;                 /**< bit:      0  Main Crystal Oscillator Status Interrupt Mask */
    uint32_t LOCKA:1;                   /**< bit:      1  PLLA Lock Interrupt Mask                      */
    uint32_t :1;                        /**< bit:      2  Reserved                                      */
    uint32_t MCKRDY:1;                  /**< bit:      3  Master Clock Ready Interrupt Mask             */
    uint32_t :2;                        /**< bit:   4..5  Reserved                                      */
    uint32_t LOCKU:1;                   /**< bit:      6  UTMI PLL Lock Interrupt Mask                  */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t PCKRDY0:1;                 /**< bit:      8  Programmable Clock Ready 0 Interrupt Mask     */
    uint32_t PCKRDY1:1;                 /**< bit:      9  Programmable Clock Ready 1 Interrupt Mask     */
    uint32_t PCKRDY2:1;                 /**< bit:     10  Programmable Clock Ready 2 Interrupt Mask     */
    uint32_t PCKRDY3:1;                 /**< bit:     11  Programmable Clock Ready 3 Interrupt Mask     */
    uint32_t PCKRDY4:1;                 /**< bit:     12  Programmable Clock Ready 4 Interrupt Mask     */
    uint32_t PCKRDY5:1;                 /**< bit:     13  Programmable Clock Ready 5 Interrupt Mask     */
    uint32_t PCKRDY6:1;                 /**< bit:     14  Programmable Clock Ready 6 Interrupt Mask     */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t MOSCSELS:1;                /**< bit:     16  Main Clock Source Oscillator Selection Status Interrupt Mask */
    uint32_t MOSCRCS:1;                 /**< bit:     17  Main RC Status Interrupt Mask                 */
    uint32_t CFDEV:1;                   /**< bit:     18  Clock Failure Detector Event Interrupt Mask   */
    uint32_t :2;                        /**< bit: 19..20  Reserved                                      */
    uint32_t XT32KERR:1;                /**< bit:     21  32.768 kHz Crystal Oscillator Error Interrupt Mask */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t PCKRDY:7;                  /**< bit:  8..14  Programmable Clock Ready x Interrupt Mask     */
    uint32_t :17;                       /**< bit: 15..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_IMR_bits_t;

