zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_IMR_MOSCXTS_Pos                   (0)                                            /**< (PMC_IMR) Main Crystal Oscillator Status Interrupt Mask Position */
#define PMC_IMR_MOSCXTS_Msk                   (0x1U << PMC_IMR_MOSCXTS_Pos)                  /**< (PMC_IMR) Main Crystal Oscillator Status Interrupt Mask Mask */
#define PMC_IMR_LOCKA_Pos                     (1)                                            /**< (PMC_IMR) PLLA Lock Interrupt Mask Position */
#define PMC_IMR_LOCKA_Msk                     (0x1U << PMC_IMR_LOCKA_Pos)                    /**< (PMC_IMR) PLLA Lock Interrupt Mask Mask */
#define PMC_IMR_MCKRDY_Pos                    (3)                                            /**< (PMC_IMR) Master Clock Ready Interrupt Mask Position */
#define PMC_IMR_MCKRDY_Msk                    (0x1U << PMC_IMR_MCKRDY_Pos)                   /**< (PMC_IMR) Master Clock Ready Interrupt Mask Mask */
#define PMC_IMR_LOCKU_Pos                     (6)                                            /**< (PMC_IMR) UTMI PLL Lock Interrupt Mask Position */
#define PMC_IMR_LOCKU_Msk                     (0x1U << PMC_IMR_LOCKU_Pos)                    /**< (PMC_IMR) UTMI PLL Lock Interrupt Mask Mask */
#define PMC_IMR_PCKRDY0_Pos                   (8)                                            /**< (PMC_IMR) Programmable Clock Ready 0 Interrupt Mask Position */
#define PMC_IMR_PCKRDY0_Msk                   (0x1U << PMC_IMR_PCKRDY0_Pos)                  /**< (PMC_IMR) Programmable Clock Ready 0 Interrupt Mask Mask */
#define PMC_IMR_PCKRDY1_Pos                   (9)                                            /**< (PMC_IMR) Programmable Clock Ready 1 Interrupt Mask Position */
#define PMC_IMR_PCKRDY1_Msk                   (0x1U << PMC_IMR_PCKRDY1_Pos)                  /**< (PMC_IMR) Programmable Clock Ready 1 Interrupt Mask Mask */
#define PMC_IMR_PCKRDY2_Pos                   (10)                                           /**< (PMC_IMR) Programmable Clock Ready 2 Interrupt Mask Position */
#define PMC_IMR_PCKRDY2_Msk                   (0x1U << PMC_IMR_PCKRDY2_Pos)                  /**< (PMC_IMR) Programmable Clock Ready 2 Interrupt Mask Mask */
#define PMC_IMR_PCKRDY3_Pos                   (11)                                           /**< (PMC_IMR) Programmable Clock Ready 3 Interrupt Mask Position */
#define PMC_IMR_PCKRDY3_Msk                   (0x1U << PMC_IMR_PCKRDY3_Pos)                  /**< (PMC_IMR) Programmable Clock Ready 3 Interrupt Mask Mask */
#define PMC_IMR_PCKRDY4_Pos                   (12)                                           /**< (PMC_IMR) Programmable Clock Ready 4 Interrupt Mask Position */
#define PMC_IMR_PCKRDY4_Msk                   (0x1U << PMC_IMR_PCKRDY4_Pos)                  /**< (PMC_IMR) Programmable Clock Ready 4 Interrupt Mask Mask */
#define PMC_IMR_PCKRDY5_Pos                   (13)                                           /**< (PMC_IMR) Programmable Clock Ready 5 Interrupt Mask Position */
#define PMC_IMR_PCKRDY5_Msk                   (0x1U << PMC_IMR_PCKRDY5_Pos)                  /**< (PMC_IMR) Programmable Clock Ready 5 Interrupt Mask Mask */
#define PMC_IMR_PCKRDY6_Pos                   (14)                                           /**< (PMC_IMR) Programmable Clock Ready 6 Interrupt Mask Position */
#define PMC_IMR_PCKRDY6_Msk                   (0x1U << PMC_IMR_PCKRDY6_Pos)                  /**< (PMC_IMR) Programmable Clock Ready 6 Interrupt Mask Mask */
#define PMC_IMR_MOSCSELS_Pos                  (16)                                           /**< (PMC_IMR) Main Clock Source Oscillator Selection Status Interrupt Mask Position */
#define PMC_IMR_MOSCSELS_Msk                  (0x1U << PMC_IMR_MOSCSELS_Pos)                 /**< (PMC_IMR) Main Clock Source Oscillator Selection Status Interrupt Mask Mask */
#define PMC_IMR_MOSCRCS_Pos                   (17)                                           /**< (PMC_IMR) Main RC Status Interrupt Mask Position */
#define PMC_IMR_MOSCRCS_Msk                   (0x1U << PMC_IMR_MOSCRCS_Pos)                  /**< (PMC_IMR) Main RC Status Interrupt Mask Mask */
#define PMC_IMR_CFDEV_Pos                     (18)                                           /**< (PMC_IMR) Clock Failure Detector Event Interrupt Mask Position */
#define PMC_IMR_CFDEV_Msk                     (0x1U << PMC_IMR_CFDEV_Pos)                    /**< (PMC_IMR) Clock Failure Detector Event Interrupt Mask Mask */
#define PMC_IMR_XT32KERR_Pos                  (21)                                           /**< (PMC_IMR) 32.768 kHz Crystal Oscillator Error Interrupt Mask Position */
#define PMC_IMR_XT32KERR_Msk                  (0x1U << PMC_IMR_XT32KERR_Pos)                 /**< (PMC_IMR) 32.768 kHz Crystal Oscillator Error Interrupt Mask Mask */
#define PMC_IMR_Msk                           (0x00277F4BUL)                                 /**< (PMC_IMR) Register Mask  */
#define PMC_IMR_PCKRDY_Pos                    (8)                                            /**< (PMC_IMR Position) Programmable Clock Ready x Interrupt Mask */
#define PMC_IMR_PCKRDY_Msk                    (0x7FU << PMC_IMR_PCKRDY_Pos)                  /**< (PMC_IMR Mask) PCKRDY */
#define PMC_IMR_PCKRDY(value)                 (PMC_IMR_PCKRDY_Msk & ((value) << PMC_IMR_PCKRDY_Pos))

/* -------- PMC_FSMR : (PMC Offset: 0x70) (R/W 32) Fast Startup Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t FSTT0:1;                   /**< bit:      0  Fast Startup Input Enable 0                   */
    uint32_t FSTT1:1;                   /**< bit:      1  Fast Startup Input Enable 1                   */
    uint32_t FSTT2:1;                   /**< bit:      2  Fast Startup Input Enable 2                   */
    uint32_t FSTT3:1;                   /**< bit:      3  Fast Startup Input Enable 3                   */
    uint32_t FSTT4:1;                   /**< bit:      4  Fast Startup Input Enable 4                   */
    uint32_t FSTT5:1;                   /**< bit:      5  Fast Startup Input Enable 5                   */
    uint32_t FSTT6:1;                   /**< bit:      6  Fast Startup Input Enable 6                   */
    uint32_t FSTT7:1;                   /**< bit:      7  Fast Startup Input Enable 7                   */
    uint32_t FSTT8:1;                   /**< bit:      8  Fast Startup Input Enable 8                   */
    uint32_t FSTT9:1;                   /**< bit:      9  Fast Startup Input Enable 9                   */
    uint32_t FSTT10:1;                  /**< bit:     10  Fast Startup Input Enable 10                  */
    uint32_t FSTT11:1;                  /**< bit:     11  Fast Startup Input Enable 11                  */
    uint32_t FSTT12:1;                  /**< bit:     12  Fast Startup Input Enable 12                  */
    uint32_t FSTT13:1;                  /**< bit:     13  Fast Startup Input Enable 13                  */
    uint32_t FSTT14:1;                  /**< bit:     14  Fast Startup Input Enable 14                  */
    uint32_t FSTT15:1;                  /**< bit:     15  Fast Startup Input Enable 15                  */
    uint32_t RTTAL:1;                   /**< bit:     16  RTT Alarm Enable                              */
    uint32_t RTCAL:1;                   /**< bit:     17  RTC Alarm Enable                              */
    uint32_t USBAL:1;                   /**< bit:     18  USB Alarm Enable                              */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t LPM:1;                     /**< bit:     20  Low-power Mode                                */
    uint32_t FLPM:2;                    /**< bit: 21..22  Flash Low-power Mode                          */
    uint32_t FFLPM:1;                   /**< bit:     23  Force Flash Low-power Mode                    */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  struct
  {
    uint32_t FSTT:16;                   /**< bit:  0..15  Fast Startup Input Enable x                   */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_FSMR_bits_t;

#define PMC_FSMR_FSTT0_Pos                    (0)                                            /**< (PMC_FSMR) Fast Startup Input Enable 0 Position */
#define PMC_FSMR_FSTT0_Msk                    (0x1U << PMC_FSMR_FSTT0_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 0 Mask */
#define PMC_FSMR_FSTT1_Pos                    (1)                                            /**< (PMC_FSMR) Fast Startup Input Enable 1 Position */
#define PMC_FSMR_FSTT1_Msk                    (0x1U << PMC_FSMR_FSTT1_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 1 Mask */
#define PMC_FSMR_FSTT2_Pos                    (2)                                            /**< (PMC_FSMR) Fast Startup Input Enable 2 Position */
#define PMC_FSMR_FSTT2_Msk                    (0x1U << PMC_FSMR_FSTT2_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 2 Mask */
#define PMC_FSMR_FSTT3_Pos                    (3)                                            /**< (PMC_FSMR) Fast Startup Input Enable 3 Position */
#define PMC_FSMR_FSTT3_Msk                    (0x1U << PMC_FSMR_FSTT3_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 3 Mask */
#define PMC_FSMR_FSTT4_Pos                    (4)                                            /**< (PMC_FSMR) Fast Startup Input Enable 4 Position */
#define PMC_FSMR_FSTT4_Msk                    (0x1U << PMC_FSMR_FSTT4_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 4 Mask */
#define PMC_FSMR_FSTT5_Pos                    (5)                                            /**< (PMC_FSMR) Fast Startup Input Enable 5 Position */
#define PMC_FSMR_FSTT5_Msk                    (0x1U << PMC_FSMR_FSTT5_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 5 Mask */
#define PMC_FSMR_FSTT6_Pos                    (6)                                            /**< (PMC_FSMR) Fast Startup Input Enable 6 Position */
#define PMC_FSMR_FSTT6_Msk                    (0x1U << PMC_FSMR_FSTT6_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 6 Mask */
#define PMC_FSMR_FSTT7_Pos                    (7)                                            /**< (PMC_FSMR) Fast Startup Input Enable 7 Position */
#define PMC_FSMR_FSTT7_Msk                    (0x1U << PMC_FSMR_FSTT7_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 7 Mask */
#define PMC_FSMR_FSTT8_Pos                    (8)                                            /**< (PMC_FSMR) Fast Startup Input Enable 8 Position */
#define PMC_FSMR_FSTT8_Msk                    (0x1U << PMC_FSMR_FSTT8_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 8 Mask */
#define PMC_FSMR_FSTT9_Pos                    (9)                                            /**< (PMC_FSMR) Fast Startup Input Enable 9 Position */
#define PMC_FSMR_FSTT9_Msk                    (0x1U << PMC_FSMR_FSTT9_Pos)                   /**< (PMC_FSMR) Fast Startup Input Enable 9 Mask */
#define PMC_FSMR_FSTT10_Pos                   (10)                                           /**< (PMC_FSMR) Fast Startup Input Enable 10 Position */
#define PMC_FSMR_FSTT10_Msk                   (0x1U << PMC_FSMR_FSTT10_Pos)                  /**< (PMC_FSMR) Fast Startup Input Enable 10 Mask */
#define PMC_FSMR_FSTT11_Pos                   (11)                                           /**< (PMC_FSMR) Fast Startup Input Enable 11 Position */
#define PMC_FSMR_FSTT11_Msk                   (0x1U << PMC_FSMR_FSTT11_Pos)                  /**< (PMC_FSMR) Fast Startup Input Enable 11 Mask */
#define PMC_FSMR_FSTT12_Pos                   (12)                                           /**< (PMC_FSMR) Fast Startup Input Enable 12 Position */
#define PMC_FSMR_FSTT12_Msk                   (0x1U << PMC_FSMR_FSTT12_Pos)                  /**< (PMC_FSMR) Fast Startup Input Enable 12 Mask */
#define PMC_FSMR_FSTT13_Pos                   (13)                                           /**< (PMC_FSMR) Fast Startup Input Enable 13 Position */
#define PMC_FSMR_FSTT13_Msk                   (0x1U << PMC_FSMR_FSTT13_Pos)                  /**< (PMC_FSMR) Fast Startup Input Enable 13 Mask */
#define PMC_FSMR_FSTT14_Pos                   (14)                                           /**< (PMC_FSMR) Fast Startup Input Enable 14 Position */
#define PMC_FSMR_FSTT14_Msk                   (0x1U << PMC_FSMR_FSTT14_Pos)                  /**< (PMC_FSMR) Fast Startup Input Enable 14 Mask */
#define PMC_FSMR_FSTT15_Pos                   (15)                                           /**< (PMC_FSMR) Fast Startup Input Enable 15 Position */
#define PMC_FSMR_FSTT15_Msk                   (0x1U << PMC_FSMR_FSTT15_Pos)                  /**< (PMC_FSMR) Fast Startup Input Enable 15 Mask */
#define PMC_FSMR_RTTAL_Pos                    (16)                                           /**< (PMC_FSMR) RTT Alarm Enable Position */
#define PMC_FSMR_RTTAL_Msk                    (0x1U << PMC_FSMR_RTTAL_Pos)                   /**< (PMC_FSMR) RTT Alarm Enable Mask */
#define PMC_FSMR_RTCAL_Pos                    (17)                                           /**< (PMC_FSMR) RTC Alarm Enable Position */
#define PMC_FSMR_RTCAL_Msk                    (0x1U << PMC_FSMR_RTCAL_Pos)                   /**< (PMC_FSMR) RTC Alarm Enable Mask */
#define PMC_FSMR_USBAL_Pos                    (18)                                           /**< (PMC_FSMR) USB Alarm Enable Position */
#define PMC_FSMR_USBAL_Msk                    (0x1U << PMC_FSMR_USBAL_Pos)                   /**< (PMC_FSMR) USB Alarm Enable Mask */
#define PMC_FSMR_LPM_Pos                      (20)                                           /**< (PMC_FSMR) Low-power Mode Position */
#define PMC_FSMR_LPM_Msk                      (0x1U << PMC_FSMR_LPM_Pos)                     /**< (PMC_FSMR) Low-power Mode Mask */
#define PMC_FSMR_FLPM_Pos                     (21)                                           /**< (PMC_FSMR) Flash Low-power Mode Position */
#define PMC_FSMR_FLPM_Msk                     (0x3U << PMC_FSMR_FLPM_Pos)                    /**< (PMC_FSMR) Flash Low-power Mode Mask */
#define PMC_FSMR_FLPM(value)                  (PMC_FSMR_FLPM_Msk & ((value) << PMC_FSMR_FLPM_Pos))
#define   PMC_FSMR_FLPM_FLASH_STANDBY_Val     (0x0U)                                         /**< (PMC_FSMR) Flash is in Standby Mode when system enters Wait Mode  */
#define   PMC_FSMR_FLPM_FLASH_DEEP_POWERDOWN_Val (0x1U)                                         /**< (PMC_FSMR) Flash is in Deep-power-down mode when system enters Wait Mode  */
#define   PMC_FSMR_FLPM_FLASH_IDLE_Val        (0x2U)                                         /**< (PMC_FSMR) Idle mode  */
#define PMC_FSMR_FLPM_FLASH_STANDBY           (PMC_FSMR_FLPM_FLASH_STANDBY_Val << PMC_FSMR_FLPM_Pos)  /**< (PMC_FSMR) Flash is in Standby Mode when system enters Wait Mode Position  */
#define PMC_FSMR_FLPM_FLASH_DEEP_POWERDOWN    (PMC_FSMR_FLPM_FLASH_DEEP_POWERDOWN_Val << PMC_FSMR_FLPM_Pos)  /**< (PMC_FSMR) Flash is in Deep-power-down mode when system enters Wait Mode Position  */
#define PMC_FSMR_FLPM_FLASH_IDLE              (PMC_FSMR_FLPM_FLASH_IDLE_Val << PMC_FSMR_FLPM_Pos)  /**< (PMC_FSMR) Idle mode Position  */
#define PMC_FSMR_FFLPM_Pos                    (23)                                           /**< (PMC_FSMR) Force Flash Low-power Mode Position */
#define PMC_FSMR_FFLPM_Msk                    (0x1U << PMC_FSMR_FFLPM_Pos)                   /**< (PMC_FSMR) Force Flash Low-power Mode Mask */
#define PMC_FSMR_Msk                          (0x00F7FFFFUL)                                 /**< (PMC_FSMR) Register Mask  */
#define PMC_FSMR_FSTT_Pos                     (0)                                            /**< (PMC_FSMR Position) Fast Startup Input Enable x */
#define PMC_FSMR_FSTT_Msk                     (0xFFFFU << PMC_FSMR_FSTT_Pos)                 /**< (PMC_FSMR Mask) FSTT */
#define PMC_FSMR_FSTT(value)                  (PMC_FSMR_FSTT_Msk & ((value) << PMC_FSMR_FSTT_Pos))

/* -------- PMC_FSPR : (PMC Offset: 0x74) (R/W 32) Fast Startup Polarity Register -------- */

typedef union
{
  struct
  {
    uint32_t FSTP0:1;                   /**< bit:      0  Fast Startup Input Polarity 0                 */
    uint32_t FSTP1:1;                   /**< bit:      1  Fast Startup Input Polarity 1                 */
    uint32_t FSTP2:1;                   /**< bit:      2  Fast Startup Input Polarity 2                 */
    uint32_t FSTP3:1;                   /**< bit:      3  Fast Startup Input Polarity 3                 */
    uint32_t FSTP4:1;                   /**< bit:      4  Fast Startup Input Polarity 4                 */
    uint32_t FSTP5:1;                   /**< bit:      5  Fast Startup Input Polarity 5                 */
    uint32_t FSTP6:1;                   /**< bit:      6  Fast Startup Input Polarity 6                 */
    uint32_t FSTP7:1;                   /**< bit:      7  Fast Startup Input Polarity 7                 */
    uint32_t FSTP8:1;                   /**< bit:      8  Fast Startup Input Polarity 8                 */
    uint32_t FSTP9:1;                   /**< bit:      9  Fast Startup Input Polarity 9                 */
    uint32_t FSTP10:1;                  /**< bit:     10  Fast Startup Input Polarity 10                */
    uint32_t FSTP11:1;                  /**< bit:     11  Fast Startup Input Polarity 11                */
    uint32_t FSTP12:1;                  /**< bit:     12  Fast Startup Input Polarity 12                */
    uint32_t FSTP13:1;                  /**< bit:     13  Fast Startup Input Polarity 13                */
    uint32_t FSTP14:1;                  /**< bit:     14  Fast Startup Input Polarity 14                */
    uint32_t FSTP15:1;                  /**< bit:     15  Fast Startup Input Polarity 15                */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  struct
  {
    uint32_t FSTP:16;                   /**< bit:  0..15  Fast Startup Input Polarity x5                */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_FSPR_bits_t;

