zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_FSPR_FSTP0_Pos                    (0)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 0 Position */
#define PMC_FSPR_FSTP0_Msk                    (0x1U << PMC_FSPR_FSTP0_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 0 Mask */
#define PMC_FSPR_FSTP1_Pos                    (1)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 1 Position */
#define PMC_FSPR_FSTP1_Msk                    (0x1U << PMC_FSPR_FSTP1_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 1 Mask */
#define PMC_FSPR_FSTP2_Pos                    (2)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 2 Position */
#define PMC_FSPR_FSTP2_Msk                    (0x1U << PMC_FSPR_FSTP2_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 2 Mask */
#define PMC_FSPR_FSTP3_Pos                    (3)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 3 Position */
#define PMC_FSPR_FSTP3_Msk                    (0x1U << PMC_FSPR_FSTP3_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 3 Mask */
#define PMC_FSPR_FSTP4_Pos                    (4)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 4 Position */
#define PMC_FSPR_FSTP4_Msk                    (0x1U << PMC_FSPR_FSTP4_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 4 Mask */
#define PMC_FSPR_FSTP5_Pos                    (5)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 5 Position */
#define PMC_FSPR_FSTP5_Msk                    (0x1U << PMC_FSPR_FSTP5_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 5 Mask */
#define PMC_FSPR_FSTP6_Pos                    (6)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 6 Position */
#define PMC_FSPR_FSTP6_Msk                    (0x1U << PMC_FSPR_FSTP6_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 6 Mask */
#define PMC_FSPR_FSTP7_Pos                    (7)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 7 Position */
#define PMC_FSPR_FSTP7_Msk                    (0x1U << PMC_FSPR_FSTP7_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 7 Mask */
#define PMC_FSPR_FSTP8_Pos                    (8)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 8 Position */
#define PMC_FSPR_FSTP8_Msk                    (0x1U << PMC_FSPR_FSTP8_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 8 Mask */
#define PMC_FSPR_FSTP9_Pos                    (9)                                            /**< (PMC_FSPR) Fast Startup Input Polarity 9 Position */
#define PMC_FSPR_FSTP9_Msk                    (0x1U << PMC_FSPR_FSTP9_Pos)                   /**< (PMC_FSPR) Fast Startup Input Polarity 9 Mask */
#define PMC_FSPR_FSTP10_Pos                   (10)                                           /**< (PMC_FSPR) Fast Startup Input Polarity 10 Position */
#define PMC_FSPR_FSTP10_Msk                   (0x1U << PMC_FSPR_FSTP10_Pos)                  /**< (PMC_FSPR) Fast Startup Input Polarity 10 Mask */
#define PMC_FSPR_FSTP11_Pos                   (11)                                           /**< (PMC_FSPR) Fast Startup Input Polarity 11 Position */
#define PMC_FSPR_FSTP11_Msk                   (0x1U << PMC_FSPR_FSTP11_Pos)                  /**< (PMC_FSPR) Fast Startup Input Polarity 11 Mask */
#define PMC_FSPR_FSTP12_Pos                   (12)                                           /**< (PMC_FSPR) Fast Startup Input Polarity 12 Position */
#define PMC_FSPR_FSTP12_Msk                   (0x1U << PMC_FSPR_FSTP12_Pos)                  /**< (PMC_FSPR) Fast Startup Input Polarity 12 Mask */
#define PMC_FSPR_FSTP13_Pos                   (13)                                           /**< (PMC_FSPR) Fast Startup Input Polarity 13 Position */
#define PMC_FSPR_FSTP13_Msk                   (0x1U << PMC_FSPR_FSTP13_Pos)                  /**< (PMC_FSPR) Fast Startup Input Polarity 13 Mask */
#define PMC_FSPR_FSTP14_Pos                   (14)                                           /**< (PMC_FSPR) Fast Startup Input Polarity 14 Position */
#define PMC_FSPR_FSTP14_Msk                   (0x1U << PMC_FSPR_FSTP14_Pos)                  /**< (PMC_FSPR) Fast Startup Input Polarity 14 Mask */
#define PMC_FSPR_FSTP15_Pos                   (15)                                           /**< (PMC_FSPR) Fast Startup Input Polarity 15 Position */
#define PMC_FSPR_FSTP15_Msk                   (0x1U << PMC_FSPR_FSTP15_Pos)                  /**< (PMC_FSPR) Fast Startup Input Polarity 15 Mask */
#define PMC_FSPR_Msk                          (0x0000FFFFUL)                                 /**< (PMC_FSPR) Register Mask  */
#define PMC_FSPR_FSTP_Pos                     (0)                                            /**< (PMC_FSPR Position) Fast Startup Input Polarity x5 */
#define PMC_FSPR_FSTP_Msk                     (0xFFFFU << PMC_FSPR_FSTP_Pos)                 /**< (PMC_FSPR Mask) FSTP */
#define PMC_FSPR_FSTP(value)                  (PMC_FSPR_FSTP_Msk & ((value) << PMC_FSPR_FSTP_Pos))

/* -------- PMC_FOCR : (PMC Offset: 0x78) (/W 32) Fault Output Clear Register -------- */

typedef union
{
  struct
  {
    uint32_t FOCLR:1;                   /**< bit:      0  Fault Output Clear                            */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_FOCR_bits_t;

#define PMC_FOCR_FOCLR_Pos                    (0)                                            /**< (PMC_FOCR) Fault Output Clear Position */
#define PMC_FOCR_FOCLR_Msk                    (0x1U << PMC_FOCR_FOCLR_Pos)                   /**< (PMC_FOCR) Fault Output Clear Mask */
#define PMC_FOCR_Msk                          (0x00000001UL)                                 /**< (PMC_FOCR) Register Mask  */

/* -------- PMC_WPMR : (PMC Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __PMC_WPMR_bits_t;

