zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_WPMR_WPEN_Pos                     (0)                                            /**< (PMC_WPMR) Write Protection Enable Position */
#define PMC_WPMR_WPEN_Msk                     (0x1U << PMC_WPMR_WPEN_Pos)                    /**< (PMC_WPMR) Write Protection Enable Mask */
#define PMC_WPMR_WPKEY_Pos                    (8)                                            /**< (PMC_WPMR) Write Protection Key Position */
#define PMC_WPMR_WPKEY_Msk                    (0xFFFFFFU << PMC_WPMR_WPKEY_Pos)              /**< (PMC_WPMR) Write Protection Key Mask */
#define PMC_WPMR_WPKEY(value)                 (PMC_WPMR_WPKEY_Msk & ((value) << PMC_WPMR_WPKEY_Pos))
#define   PMC_WPMR_WPKEY_PASSWD_Val           (0x504D43U)                                    /**< (PMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PMC_WPMR_WPKEY_PASSWD                 (PMC_WPMR_WPKEY_PASSWD_Val << PMC_WPMR_WPKEY_Pos)  /**< (PMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define PMC_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (PMC_WPMR) Register Mask  */

/* -------- PMC_WPSR : (PMC Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:16;                 /**< bit:  8..23  Write Protection Violation Source             */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_WPSR_bits_t;

#define PMC_WPSR_WPVS_Pos                     (0)                                            /**< (PMC_WPSR) Write Protection Violation Status Position */
#define PMC_WPSR_WPVS_Msk                     (0x1U << PMC_WPSR_WPVS_Pos)                    /**< (PMC_WPSR) Write Protection Violation Status Mask */
#define PMC_WPSR_WPVSRC_Pos                   (8)                                            /**< (PMC_WPSR) Write Protection Violation Source Position */
#define PMC_WPSR_WPVSRC_Msk                   (0xFFFFU << PMC_WPSR_WPVSRC_Pos)               /**< (PMC_WPSR) Write Protection Violation Source Mask */
#define PMC_WPSR_WPVSRC(value)                (PMC_WPSR_WPVSRC_Msk & ((value) << PMC_WPSR_WPVSRC_Pos))
#define PMC_WPSR_Msk                          (0x00FFFF01UL)                                 /**< (PMC_WPSR) Register Mask  */

/* -------- PMC_PCER1 : (PMC Offset: 0x100) (/W 32) Peripheral Clock Enable Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t PID32:1;                   /**< bit:      0  Peripheral Clock 32 Enable                    */
    uint32_t PID33:1;                   /**< bit:      1  Peripheral Clock 33 Enable                    */
    uint32_t PID34:1;                   /**< bit:      2  Peripheral Clock 34 Enable                    */
    uint32_t PID35:1;                   /**< bit:      3  Peripheral Clock 35 Enable                    */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PID37:1;                   /**< bit:      5  Peripheral Clock 37 Enable                    */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t PID39:1;                   /**< bit:      7  Peripheral Clock 39 Enable                    */
    uint32_t PID40:1;                   /**< bit:      8  Peripheral Clock 40 Enable                    */
    uint32_t PID41:1;                   /**< bit:      9  Peripheral Clock 41 Enable                    */
    uint32_t PID42:1;                   /**< bit:     10  Peripheral Clock 42 Enable                    */
    uint32_t PID43:1;                   /**< bit:     11  Peripheral Clock 43 Enable                    */
    uint32_t PID44:1;                   /**< bit:     12  Peripheral Clock 44 Enable                    */
    uint32_t PID45:1;                   /**< bit:     13  Peripheral Clock 45 Enable                    */
    uint32_t PID46:1;                   /**< bit:     14  Peripheral Clock 46 Enable                    */
    uint32_t PID47:1;                   /**< bit:     15  Peripheral Clock 47 Enable                    */
    uint32_t PID48:1;                   /**< bit:     16  Peripheral Clock 48 Enable                    */
    uint32_t PID49:1;                   /**< bit:     17  Peripheral Clock 49 Enable                    */
    uint32_t PID50:1;                   /**< bit:     18  Peripheral Clock 50 Enable                    */
    uint32_t PID51:1;                   /**< bit:     19  Peripheral Clock 51 Enable                    */
    uint32_t PID52:1;                   /**< bit:     20  Peripheral Clock 52 Enable                    */
    uint32_t PID53:1;                   /**< bit:     21  Peripheral Clock 53 Enable                    */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t PID56:1;                   /**< bit:     24  Peripheral Clock 56 Enable                    */
    uint32_t PID57:1;                   /**< bit:     25  Peripheral Clock 57 Enable                    */
    uint32_t PID58:1;                   /**< bit:     26  Peripheral Clock 58 Enable                    */
    uint32_t PID59:1;                   /**< bit:     27  Peripheral Clock 59 Enable                    */
    uint32_t PID60:1;                   /**< bit:     28  Peripheral Clock 60 Enable                    */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  {
    uint32_t PID:25;                    /**< bit:  0..24  Peripheral Clock 6x Enable                    */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_PCER1_bits_t;

