zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
/* -------- PMC_PCDR1 : (PMC Offset: 0x104) (/W 32) Peripheral Clock Disable Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t PID32:1;                   /**< bit:      0  Peripheral Clock 32 Disable                   */
    uint32_t PID33:1;                   /**< bit:      1  Peripheral Clock 33 Disable                   */
    uint32_t PID34:1;                   /**< bit:      2  Peripheral Clock 34 Disable                   */
    uint32_t PID35:1;                   /**< bit:      3  Peripheral Clock 35 Disable                   */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PID37:1;                   /**< bit:      5  Peripheral Clock 37 Disable                   */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t PID39:1;                   /**< bit:      7  Peripheral Clock 39 Disable                   */
    uint32_t PID40:1;                   /**< bit:      8  Peripheral Clock 40 Disable                   */
    uint32_t PID41:1;                   /**< bit:      9  Peripheral Clock 41 Disable                   */
    uint32_t PID42:1;                   /**< bit:     10  Peripheral Clock 42 Disable                   */
    uint32_t PID43:1;                   /**< bit:     11  Peripheral Clock 43 Disable                   */
    uint32_t PID44:1;                   /**< bit:     12  Peripheral Clock 44 Disable                   */
    uint32_t PID45:1;                   /**< bit:     13  Peripheral Clock 45 Disable                   */
    uint32_t PID46:1;                   /**< bit:     14  Peripheral Clock 46 Disable                   */
    uint32_t PID47:1;                   /**< bit:     15  Peripheral Clock 47 Disable                   */
    uint32_t PID48:1;                   /**< bit:     16  Peripheral Clock 48 Disable                   */
    uint32_t PID49:1;                   /**< bit:     17  Peripheral Clock 49 Disable                   */
    uint32_t PID50:1;                   /**< bit:     18  Peripheral Clock 50 Disable                   */
    uint32_t PID51:1;                   /**< bit:     19  Peripheral Clock 51 Disable                   */
    uint32_t PID52:1;                   /**< bit:     20  Peripheral Clock 52 Disable                   */
    uint32_t PID53:1;                   /**< bit:     21  Peripheral Clock 53 Disable                   */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t PID56:1;                   /**< bit:     24  Peripheral Clock 56 Disable                   */
    uint32_t PID57:1;                   /**< bit:     25  Peripheral Clock 57 Disable                   */
    uint32_t PID58:1;                   /**< bit:     26  Peripheral Clock 58 Disable                   */
    uint32_t PID59:1;                   /**< bit:     27  Peripheral Clock 59 Disable                   */
    uint32_t PID60:1;                   /**< bit:     28  Peripheral Clock 60 Disable                   */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  {
    uint32_t PID:25;                    /**< bit:  0..24  Peripheral Clock 6x Disable                   */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_PCDR1_bits_t;

#define PMC_PCDR1_PID32_Pos                   (0)                                            /**< (PMC_PCDR1) Peripheral Clock 32 Disable Position */
#define PMC_PCDR1_PID32_Msk                   (0x1U << PMC_PCDR1_PID32_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 32 Disable Mask */
#define PMC_PCDR1_PID33_Pos                   (1)                                            /**< (PMC_PCDR1) Peripheral Clock 33 Disable Position */
#define PMC_PCDR1_PID33_Msk                   (0x1U << PMC_PCDR1_PID33_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 33 Disable Mask */
#define PMC_PCDR1_PID34_Pos                   (2)                                            /**< (PMC_PCDR1) Peripheral Clock 34 Disable Position */
#define PMC_PCDR1_PID34_Msk                   (0x1U << PMC_PCDR1_PID34_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 34 Disable Mask */
#define PMC_PCDR1_PID35_Pos                   (3)                                            /**< (PMC_PCDR1) Peripheral Clock 35 Disable Position */
#define PMC_PCDR1_PID35_Msk                   (0x1U << PMC_PCDR1_PID35_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 35 Disable Mask */
#define PMC_PCDR1_PID37_Pos                   (5)                                            /**< (PMC_PCDR1) Peripheral Clock 37 Disable Position */
#define PMC_PCDR1_PID37_Msk                   (0x1U << PMC_PCDR1_PID37_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 37 Disable Mask */
#define PMC_PCDR1_PID39_Pos                   (7)                                            /**< (PMC_PCDR1) Peripheral Clock 39 Disable Position */
#define PMC_PCDR1_PID39_Msk                   (0x1U << PMC_PCDR1_PID39_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 39 Disable Mask */
#define PMC_PCDR1_PID40_Pos                   (8)                                            /**< (PMC_PCDR1) Peripheral Clock 40 Disable Position */
#define PMC_PCDR1_PID40_Msk                   (0x1U << PMC_PCDR1_PID40_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 40 Disable Mask */
#define PMC_PCDR1_PID41_Pos                   (9)                                            /**< (PMC_PCDR1) Peripheral Clock 41 Disable Position */
#define PMC_PCDR1_PID41_Msk                   (0x1U << PMC_PCDR1_PID41_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 41 Disable Mask */
#define PMC_PCDR1_PID42_Pos                   (10)                                           /**< (PMC_PCDR1) Peripheral Clock 42 Disable Position */
#define PMC_PCDR1_PID42_Msk                   (0x1U << PMC_PCDR1_PID42_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 42 Disable Mask */
#define PMC_PCDR1_PID43_Pos                   (11)                                           /**< (PMC_PCDR1) Peripheral Clock 43 Disable Position */
#define PMC_PCDR1_PID43_Msk                   (0x1U << PMC_PCDR1_PID43_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 43 Disable Mask */
#define PMC_PCDR1_PID44_Pos                   (12)                                           /**< (PMC_PCDR1) Peripheral Clock 44 Disable Position */
#define PMC_PCDR1_PID44_Msk                   (0x1U << PMC_PCDR1_PID44_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 44 Disable Mask */
#define PMC_PCDR1_PID45_Pos                   (13)                                           /**< (PMC_PCDR1) Peripheral Clock 45 Disable Position */
#define PMC_PCDR1_PID45_Msk                   (0x1U << PMC_PCDR1_PID45_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 45 Disable Mask */
#define PMC_PCDR1_PID46_Pos                   (14)                                           /**< (PMC_PCDR1) Peripheral Clock 46 Disable Position */
#define PMC_PCDR1_PID46_Msk                   (0x1U << PMC_PCDR1_PID46_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 46 Disable Mask */
#define PMC_PCDR1_PID47_Pos                   (15)                                           /**< (PMC_PCDR1) Peripheral Clock 47 Disable Position */
#define PMC_PCDR1_PID47_Msk                   (0x1U << PMC_PCDR1_PID47_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 47 Disable Mask */
#define PMC_PCDR1_PID48_Pos                   (16)                                           /**< (PMC_PCDR1) Peripheral Clock 48 Disable Position */
#define PMC_PCDR1_PID48_Msk                   (0x1U << PMC_PCDR1_PID48_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 48 Disable Mask */
#define PMC_PCDR1_PID49_Pos                   (17)                                           /**< (PMC_PCDR1) Peripheral Clock 49 Disable Position */
#define PMC_PCDR1_PID49_Msk                   (0x1U << PMC_PCDR1_PID49_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 49 Disable Mask */
#define PMC_PCDR1_PID50_Pos                   (18)                                           /**< (PMC_PCDR1) Peripheral Clock 50 Disable Position */
#define PMC_PCDR1_PID50_Msk                   (0x1U << PMC_PCDR1_PID50_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 50 Disable Mask */
#define PMC_PCDR1_PID51_Pos                   (19)                                           /**< (PMC_PCDR1) Peripheral Clock 51 Disable Position */
#define PMC_PCDR1_PID51_Msk                   (0x1U << PMC_PCDR1_PID51_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 51 Disable Mask */
#define PMC_PCDR1_PID52_Pos                   (20)                                           /**< (PMC_PCDR1) Peripheral Clock 52 Disable Position */
#define PMC_PCDR1_PID52_Msk                   (0x1U << PMC_PCDR1_PID52_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 52 Disable Mask */
#define PMC_PCDR1_PID53_Pos                   (21)                                           /**< (PMC_PCDR1) Peripheral Clock 53 Disable Position */
#define PMC_PCDR1_PID53_Msk                   (0x1U << PMC_PCDR1_PID53_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 53 Disable Mask */
#define PMC_PCDR1_PID56_Pos                   (24)                                           /**< (PMC_PCDR1) Peripheral Clock 56 Disable Position */
#define PMC_PCDR1_PID56_Msk                   (0x1U << PMC_PCDR1_PID56_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 56 Disable Mask */
#define PMC_PCDR1_PID57_Pos                   (25)                                           /**< (PMC_PCDR1) Peripheral Clock 57 Disable Position */
#define PMC_PCDR1_PID57_Msk                   (0x1U << PMC_PCDR1_PID57_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 57 Disable Mask */
#define PMC_PCDR1_PID58_Pos                   (26)                                           /**< (PMC_PCDR1) Peripheral Clock 58 Disable Position */
#define PMC_PCDR1_PID58_Msk                   (0x1U << PMC_PCDR1_PID58_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 58 Disable Mask */
#define PMC_PCDR1_PID59_Pos                   (27)                                           /**< (PMC_PCDR1) Peripheral Clock 59 Disable Position */
#define PMC_PCDR1_PID59_Msk                   (0x1U << PMC_PCDR1_PID59_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 59 Disable Mask */
#define PMC_PCDR1_PID60_Pos                   (28)                                           /**< (PMC_PCDR1) Peripheral Clock 60 Disable Position */
#define PMC_PCDR1_PID60_Msk                   (0x1U << PMC_PCDR1_PID60_Pos)                  /**< (PMC_PCDR1) Peripheral Clock 60 Disable Mask */
#define PMC_PCDR1_Msk                         (0x1F3FFFAFUL)                                 /**< (PMC_PCDR1) Register Mask  */
#define PMC_PCDR1_PID_Pos                     (0)                                            /**< (PMC_PCDR1 Position) Peripheral Clock 6x Disable */
#define PMC_PCDR1_PID_Msk                     (0x1FFFFFFU << PMC_PCDR1_PID_Pos)              /**< (PMC_PCDR1 Mask) PID */
#define PMC_PCDR1_PID(value)                  (PMC_PCDR1_PID_Msk & ((value) << PMC_PCDR1_PID_Pos))

/* -------- PMC_PCSR1 : (PMC Offset: 0x108) (R/ 32) Peripheral Clock Status Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t PID32:1;                   /**< bit:      0  Peripheral Clock 32 Status                    */
    uint32_t PID33:1;                   /**< bit:      1  Peripheral Clock 33 Status                    */
    uint32_t PID34:1;                   /**< bit:      2  Peripheral Clock 34 Status                    */
    uint32_t PID35:1;                   /**< bit:      3  Peripheral Clock 35 Status                    */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PID37:1;                   /**< bit:      5  Peripheral Clock 37 Status                    */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t PID39:1;                   /**< bit:      7  Peripheral Clock 39 Status                    */
    uint32_t PID40:1;                   /**< bit:      8  Peripheral Clock 40 Status                    */
    uint32_t PID41:1;                   /**< bit:      9  Peripheral Clock 41 Status                    */
    uint32_t PID42:1;                   /**< bit:     10  Peripheral Clock 42 Status                    */
    uint32_t PID43:1;                   /**< bit:     11  Peripheral Clock 43 Status                    */
    uint32_t PID44:1;                   /**< bit:     12  Peripheral Clock 44 Status                    */
    uint32_t PID45:1;                   /**< bit:     13  Peripheral Clock 45 Status                    */
    uint32_t PID46:1;                   /**< bit:     14  Peripheral Clock 46 Status                    */
    uint32_t PID47:1;                   /**< bit:     15  Peripheral Clock 47 Status                    */
    uint32_t PID48:1;                   /**< bit:     16  Peripheral Clock 48 Status                    */
    uint32_t PID49:1;                   /**< bit:     17  Peripheral Clock 49 Status                    */
    uint32_t PID50:1;                   /**< bit:     18  Peripheral Clock 50 Status                    */
    uint32_t PID51:1;                   /**< bit:     19  Peripheral Clock 51 Status                    */
    uint32_t PID52:1;                   /**< bit:     20  Peripheral Clock 52 Status                    */
    uint32_t PID53:1;                   /**< bit:     21  Peripheral Clock 53 Status                    */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t PID56:1;                   /**< bit:     24  Peripheral Clock 56 Status                    */
    uint32_t PID57:1;                   /**< bit:     25  Peripheral Clock 57 Status                    */
    uint32_t PID58:1;                   /**< bit:     26  Peripheral Clock 58 Status                    */
    uint32_t PID59:1;                   /**< bit:     27  Peripheral Clock 59 Status                    */
    uint32_t PID60:1;                   /**< bit:     28  Peripheral Clock 60 Status                    */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  {
    uint32_t PID:25;                    /**< bit:  0..24  Peripheral Clock 6x Status                    */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_PCSR1_bits_t;

