zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_PCSR1_PID32_Pos                   (0)                                            /**< (PMC_PCSR1) Peripheral Clock 32 Status Position */
#define PMC_PCSR1_PID32_Msk                   (0x1U << PMC_PCSR1_PID32_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 32 Status Mask */
#define PMC_PCSR1_PID33_Pos                   (1)                                            /**< (PMC_PCSR1) Peripheral Clock 33 Status Position */
#define PMC_PCSR1_PID33_Msk                   (0x1U << PMC_PCSR1_PID33_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 33 Status Mask */
#define PMC_PCSR1_PID34_Pos                   (2)                                            /**< (PMC_PCSR1) Peripheral Clock 34 Status Position */
#define PMC_PCSR1_PID34_Msk                   (0x1U << PMC_PCSR1_PID34_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 34 Status Mask */
#define PMC_PCSR1_PID35_Pos                   (3)                                            /**< (PMC_PCSR1) Peripheral Clock 35 Status Position */
#define PMC_PCSR1_PID35_Msk                   (0x1U << PMC_PCSR1_PID35_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 35 Status Mask */
#define PMC_PCSR1_PID37_Pos                   (5)                                            /**< (PMC_PCSR1) Peripheral Clock 37 Status Position */
#define PMC_PCSR1_PID37_Msk                   (0x1U << PMC_PCSR1_PID37_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 37 Status Mask */
#define PMC_PCSR1_PID39_Pos                   (7)                                            /**< (PMC_PCSR1) Peripheral Clock 39 Status Position */
#define PMC_PCSR1_PID39_Msk                   (0x1U << PMC_PCSR1_PID39_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 39 Status Mask */
#define PMC_PCSR1_PID40_Pos                   (8)                                            /**< (PMC_PCSR1) Peripheral Clock 40 Status Position */
#define PMC_PCSR1_PID40_Msk                   (0x1U << PMC_PCSR1_PID40_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 40 Status Mask */
#define PMC_PCSR1_PID41_Pos                   (9)                                            /**< (PMC_PCSR1) Peripheral Clock 41 Status Position */
#define PMC_PCSR1_PID41_Msk                   (0x1U << PMC_PCSR1_PID41_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 41 Status Mask */
#define PMC_PCSR1_PID42_Pos                   (10)                                           /**< (PMC_PCSR1) Peripheral Clock 42 Status Position */
#define PMC_PCSR1_PID42_Msk                   (0x1U << PMC_PCSR1_PID42_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 42 Status Mask */
#define PMC_PCSR1_PID43_Pos                   (11)                                           /**< (PMC_PCSR1) Peripheral Clock 43 Status Position */
#define PMC_PCSR1_PID43_Msk                   (0x1U << PMC_PCSR1_PID43_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 43 Status Mask */
#define PMC_PCSR1_PID44_Pos                   (12)                                           /**< (PMC_PCSR1) Peripheral Clock 44 Status Position */
#define PMC_PCSR1_PID44_Msk                   (0x1U << PMC_PCSR1_PID44_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 44 Status Mask */
#define PMC_PCSR1_PID45_Pos                   (13)                                           /**< (PMC_PCSR1) Peripheral Clock 45 Status Position */
#define PMC_PCSR1_PID45_Msk                   (0x1U << PMC_PCSR1_PID45_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 45 Status Mask */
#define PMC_PCSR1_PID46_Pos                   (14)                                           /**< (PMC_PCSR1) Peripheral Clock 46 Status Position */
#define PMC_PCSR1_PID46_Msk                   (0x1U << PMC_PCSR1_PID46_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 46 Status Mask */
#define PMC_PCSR1_PID47_Pos                   (15)                                           /**< (PMC_PCSR1) Peripheral Clock 47 Status Position */
#define PMC_PCSR1_PID47_Msk                   (0x1U << PMC_PCSR1_PID47_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 47 Status Mask */
#define PMC_PCSR1_PID48_Pos                   (16)                                           /**< (PMC_PCSR1) Peripheral Clock 48 Status Position */
#define PMC_PCSR1_PID48_Msk                   (0x1U << PMC_PCSR1_PID48_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 48 Status Mask */
#define PMC_PCSR1_PID49_Pos                   (17)                                           /**< (PMC_PCSR1) Peripheral Clock 49 Status Position */
#define PMC_PCSR1_PID49_Msk                   (0x1U << PMC_PCSR1_PID49_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 49 Status Mask */
#define PMC_PCSR1_PID50_Pos                   (18)                                           /**< (PMC_PCSR1) Peripheral Clock 50 Status Position */
#define PMC_PCSR1_PID50_Msk                   (0x1U << PMC_PCSR1_PID50_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 50 Status Mask */
#define PMC_PCSR1_PID51_Pos                   (19)                                           /**< (PMC_PCSR1) Peripheral Clock 51 Status Position */
#define PMC_PCSR1_PID51_Msk                   (0x1U << PMC_PCSR1_PID51_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 51 Status Mask */
#define PMC_PCSR1_PID52_Pos                   (20)                                           /**< (PMC_PCSR1) Peripheral Clock 52 Status Position */
#define PMC_PCSR1_PID52_Msk                   (0x1U << PMC_PCSR1_PID52_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 52 Status Mask */
#define PMC_PCSR1_PID53_Pos                   (21)                                           /**< (PMC_PCSR1) Peripheral Clock 53 Status Position */
#define PMC_PCSR1_PID53_Msk                   (0x1U << PMC_PCSR1_PID53_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 53 Status Mask */
#define PMC_PCSR1_PID56_Pos                   (24)                                           /**< (PMC_PCSR1) Peripheral Clock 56 Status Position */
#define PMC_PCSR1_PID56_Msk                   (0x1U << PMC_PCSR1_PID56_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 56 Status Mask */
#define PMC_PCSR1_PID57_Pos                   (25)                                           /**< (PMC_PCSR1) Peripheral Clock 57 Status Position */
#define PMC_PCSR1_PID57_Msk                   (0x1U << PMC_PCSR1_PID57_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 57 Status Mask */
#define PMC_PCSR1_PID58_Pos                   (26)                                           /**< (PMC_PCSR1) Peripheral Clock 58 Status Position */
#define PMC_PCSR1_PID58_Msk                   (0x1U << PMC_PCSR1_PID58_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 58 Status Mask */
#define PMC_PCSR1_PID59_Pos                   (27)                                           /**< (PMC_PCSR1) Peripheral Clock 59 Status Position */
#define PMC_PCSR1_PID59_Msk                   (0x1U << PMC_PCSR1_PID59_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 59 Status Mask */
#define PMC_PCSR1_PID60_Pos                   (28)                                           /**< (PMC_PCSR1) Peripheral Clock 60 Status Position */
#define PMC_PCSR1_PID60_Msk                   (0x1U << PMC_PCSR1_PID60_Pos)                  /**< (PMC_PCSR1) Peripheral Clock 60 Status Mask */
#define PMC_PCSR1_Msk                         (0x1F3FFFAFUL)                                 /**< (PMC_PCSR1) Register Mask  */
#define PMC_PCSR1_PID_Pos                     (0)                                            /**< (PMC_PCSR1 Position) Peripheral Clock 6x Status */
#define PMC_PCSR1_PID_Msk                     (0x1FFFFFFU << PMC_PCSR1_PID_Pos)              /**< (PMC_PCSR1 Mask) PID */
#define PMC_PCSR1_PID(value)                  (PMC_PCSR1_PID_Msk & ((value) << PMC_PCSR1_PID_Pos))

/* -------- PMC_PCR : (PMC Offset: 0x10c) (R/W 32) Peripheral Control Register -------- */

typedef union
{
  struct
  {
    uint32_t PID:7;                     /**< bit:   0..6  Peripheral ID                                 */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t GCLKCSS:3;                 /**< bit:  8..10  Generic Clock Source Selection                */
    uint32_t :1;                        /**< bit:     11  Reserved                                      */
    uint32_t CMD:1;                     /**< bit:     12  Command                                       */
    uint32_t :7;                        /**< bit: 13..19  Reserved                                      */
    uint32_t GCLKDIV:8;                 /**< bit: 20..27  Generic Clock Division Ratio                  */
    uint32_t EN:1;                      /**< bit:     28  Enable                                        */
    uint32_t GCLKEN:1;                  /**< bit:     29  Generic Clock Enable                          */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_PCR_bits_t;

