zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_PCR_PID_Pos                       (0)                                            /**< (PMC_PCR) Peripheral ID Position */
#define PMC_PCR_PID_Msk                       (0x7FU << PMC_PCR_PID_Pos)                     /**< (PMC_PCR) Peripheral ID Mask */
#define PMC_PCR_PID(value)                    (PMC_PCR_PID_Msk & ((value) << PMC_PCR_PID_Pos))
#define PMC_PCR_GCLKCSS_Pos                   (8)                                            /**< (PMC_PCR) Generic Clock Source Selection Position */
#define PMC_PCR_GCLKCSS_Msk                   (0x7U << PMC_PCR_GCLKCSS_Pos)                  /**< (PMC_PCR) Generic Clock Source Selection Mask */
#define PMC_PCR_GCLKCSS(value)                (PMC_PCR_GCLKCSS_Msk & ((value) << PMC_PCR_GCLKCSS_Pos))
#define   PMC_PCR_GCLKCSS_SLOW_CLK_Val        (0x0U)                                         /**< (PMC_PCR) SLCK is selected  */
#define   PMC_PCR_GCLKCSS_MAIN_CLK_Val        (0x1U)                                         /**< (PMC_PCR) MAINCK is selected  */
#define   PMC_PCR_GCLKCSS_PLLA_CLK_Val        (0x2U)                                         /**< (PMC_PCR) PLLACK is selected  */
#define   PMC_PCR_GCLKCSS_UPLL_CLK_Val        (0x3U)                                         /**< (PMC_PCR) UPLLCK is selected  */
#define   PMC_PCR_GCLKCSS_MCK_CLK_Val         (0x4U)                                         /**< (PMC_PCR) MCK is selected  */
#define PMC_PCR_GCLKCSS_SLOW_CLK              (PMC_PCR_GCLKCSS_SLOW_CLK_Val << PMC_PCR_GCLKCSS_Pos)  /**< (PMC_PCR) SLCK is selected Position  */
#define PMC_PCR_GCLKCSS_MAIN_CLK              (PMC_PCR_GCLKCSS_MAIN_CLK_Val << PMC_PCR_GCLKCSS_Pos)  /**< (PMC_PCR) MAINCK is selected Position  */
#define PMC_PCR_GCLKCSS_PLLA_CLK              (PMC_PCR_GCLKCSS_PLLA_CLK_Val << PMC_PCR_GCLKCSS_Pos)  /**< (PMC_PCR) PLLACK is selected Position  */
#define PMC_PCR_GCLKCSS_UPLL_CLK              (PMC_PCR_GCLKCSS_UPLL_CLK_Val << PMC_PCR_GCLKCSS_Pos)  /**< (PMC_PCR) UPLLCK is selected Position  */
#define PMC_PCR_GCLKCSS_MCK_CLK               (PMC_PCR_GCLKCSS_MCK_CLK_Val << PMC_PCR_GCLKCSS_Pos)  /**< (PMC_PCR) MCK is selected Position  */
#define PMC_PCR_CMD_Pos                       (12)                                           /**< (PMC_PCR) Command Position */
#define PMC_PCR_CMD_Msk                       (0x1U << PMC_PCR_CMD_Pos)                      /**< (PMC_PCR) Command Mask */
#define PMC_PCR_GCLKDIV_Pos                   (20)                                           /**< (PMC_PCR) Generic Clock Division Ratio Position */
#define PMC_PCR_GCLKDIV_Msk                   (0xFFU << PMC_PCR_GCLKDIV_Pos)                 /**< (PMC_PCR) Generic Clock Division Ratio Mask */
#define PMC_PCR_GCLKDIV(value)                (PMC_PCR_GCLKDIV_Msk & ((value) << PMC_PCR_GCLKDIV_Pos))
#define PMC_PCR_EN_Pos                        (28)                                           /**< (PMC_PCR) Enable Position */
#define PMC_PCR_EN_Msk                        (0x1U << PMC_PCR_EN_Pos)                       /**< (PMC_PCR) Enable Mask */
#define PMC_PCR_GCLKEN_Pos                    (29)                                           /**< (PMC_PCR) Generic Clock Enable Position */
#define PMC_PCR_GCLKEN_Msk                    (0x1U << PMC_PCR_GCLKEN_Pos)                   /**< (PMC_PCR) Generic Clock Enable Mask */
#define PMC_PCR_Msk                           (0x3FF0177FUL)                                 /**< (PMC_PCR) Register Mask  */

/* -------- PMC_OCR : (PMC Offset: 0x110) (R/W 32) Oscillator Calibration Register -------- */

typedef union
{
  struct
  {
    uint32_t CAL4:7;                    /**< bit:   0..6  Main RC Oscillator Calibration Bits for 4 MHz */
    uint32_t SEL4:1;                    /**< bit:      7  Selection of Main RC Oscillator Calibration Bits for 4 MHz */
    uint32_t CAL8:7;                    /**< bit:  8..14  Main RC Oscillator Calibration Bits for 8 MHz */
    uint32_t SEL8:1;                    /**< bit:     15  Selection of Main RC Oscillator Calibration Bits for 8 MHz */
    uint32_t CAL12:7;                   /**< bit: 16..22  Main RC Oscillator Calibration Bits for 12 MHz */
    uint32_t SEL12:1;                   /**< bit:     23  Selection of Main RC Oscillator Calibration Bits for 12 MHz */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_OCR_bits_t;

#define PMC_OCR_CAL4_Pos                      (0)                                            /**< (PMC_OCR) Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR_CAL4_Msk                      (0x7FU << PMC_OCR_CAL4_Pos)                    /**< (PMC_OCR) Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR_CAL4(value)                   (PMC_OCR_CAL4_Msk & ((value) << PMC_OCR_CAL4_Pos))
#define PMC_OCR_SEL4_Pos                      (7)                                            /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR_SEL4_Msk                      (0x1U << PMC_OCR_SEL4_Pos)                     /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR_CAL8_Pos                      (8)                                            /**< (PMC_OCR) Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR_CAL8_Msk                      (0x7FU << PMC_OCR_CAL8_Pos)                    /**< (PMC_OCR) Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR_CAL8(value)                   (PMC_OCR_CAL8_Msk & ((value) << PMC_OCR_CAL8_Pos))
#define PMC_OCR_SEL8_Pos                      (15)                                           /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR_SEL8_Msk                      (0x1U << PMC_OCR_SEL8_Pos)                     /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR_CAL12_Pos                     (16)                                           /**< (PMC_OCR) Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR_CAL12_Msk                     (0x7FU << PMC_OCR_CAL12_Pos)                   /**< (PMC_OCR) Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR_CAL12(value)                  (PMC_OCR_CAL12_Msk & ((value) << PMC_OCR_CAL12_Pos))
#define PMC_OCR_SEL12_Pos                     (23)                                           /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR_SEL12_Msk                     (0x1U << PMC_OCR_SEL12_Pos)                    /**< (PMC_OCR) Selection of Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR_Msk                           (0x00FFFFFFUL)                                 /**< (PMC_OCR) Register Mask  */

/* -------- PMC_SLPWK_ER0 : (PMC Offset: 0x114) (/W 32) SleepWalking Enable Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID7:1;                    /**< bit:      7  Peripheral 7 SleepWalking Enable              */
    uint32_t PID8:1;                    /**< bit:      8  Peripheral 8 SleepWalking Enable              */
    uint32_t PID9:1;                    /**< bit:      9  Peripheral 9 SleepWalking Enable              */
    uint32_t PID10:1;                   /**< bit:     10  Peripheral 10 SleepWalking Enable             */
    uint32_t PID11:1;                   /**< bit:     11  Peripheral 11 SleepWalking Enable             */
    uint32_t PID12:1;                   /**< bit:     12  Peripheral 12 SleepWalking Enable             */
    uint32_t PID13:1;                   /**< bit:     13  Peripheral 13 SleepWalking Enable             */
    uint32_t PID14:1;                   /**< bit:     14  Peripheral 14 SleepWalking Enable             */
    uint32_t PID15:1;                   /**< bit:     15  Peripheral 15 SleepWalking Enable             */
    uint32_t PID16:1;                   /**< bit:     16  Peripheral 16 SleepWalking Enable             */
    uint32_t PID17:1;                   /**< bit:     17  Peripheral 17 SleepWalking Enable             */
    uint32_t PID18:1;                   /**< bit:     18  Peripheral 18 SleepWalking Enable             */
    uint32_t PID19:1;                   /**< bit:     19  Peripheral 19 SleepWalking Enable             */
    uint32_t PID20:1;                   /**< bit:     20  Peripheral 20 SleepWalking Enable             */
    uint32_t PID21:1;                   /**< bit:     21  Peripheral 21 SleepWalking Enable             */
    uint32_t PID22:1;                   /**< bit:     22  Peripheral 22 SleepWalking Enable             */
    uint32_t PID23:1;                   /**< bit:     23  Peripheral 23 SleepWalking Enable             */
    uint32_t PID24:1;                   /**< bit:     24  Peripheral 24 SleepWalking Enable             */
    uint32_t PID25:1;                   /**< bit:     25  Peripheral 25 SleepWalking Enable             */
    uint32_t PID26:1;                   /**< bit:     26  Peripheral 26 SleepWalking Enable             */
    uint32_t PID27:1;                   /**< bit:     27  Peripheral 27 SleepWalking Enable             */
    uint32_t PID28:1;                   /**< bit:     28  Peripheral 28 SleepWalking Enable             */
    uint32_t PID29:1;                   /**< bit:     29  Peripheral 29 SleepWalking Enable             */
    uint32_t PID30:1;                   /**< bit:     30  Peripheral 30 SleepWalking Enable             */
    uint32_t PID31:1;                   /**< bit:     31  Peripheral 31 SleepWalking Enable             */
  };
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID:25;                    /**< bit:  7..31  Peripheral 3x SleepWalking Enable             */
  };
  uint32_t w;
} __PMC_SLPWK_ER0_bits_t;

#define PMC_SLPWK_ER0_PID7_Pos                (7)                                            /**< (PMC_SLPWK_ER0) Peripheral 7 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID7_Msk                (0x1U << PMC_SLPWK_ER0_PID7_Pos)               /**< (PMC_SLPWK_ER0) Peripheral 7 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID8_Pos                (8)                                            /**< (PMC_SLPWK_ER0) Peripheral 8 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID8_Msk                (0x1U << PMC_SLPWK_ER0_PID8_Pos)               /**< (PMC_SLPWK_ER0) Peripheral 8 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID9_Pos                (9)                                            /**< (PMC_SLPWK_ER0) Peripheral 9 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID9_Msk                (0x1U << PMC_SLPWK_ER0_PID9_Pos)               /**< (PMC_SLPWK_ER0) Peripheral 9 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID10_Pos               (10)                                           /**< (PMC_SLPWK_ER0) Peripheral 10 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID10_Msk               (0x1U << PMC_SLPWK_ER0_PID10_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 10 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID11_Pos               (11)                                           /**< (PMC_SLPWK_ER0) Peripheral 11 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID11_Msk               (0x1U << PMC_SLPWK_ER0_PID11_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 11 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID12_Pos               (12)                                           /**< (PMC_SLPWK_ER0) Peripheral 12 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID12_Msk               (0x1U << PMC_SLPWK_ER0_PID12_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 12 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID13_Pos               (13)                                           /**< (PMC_SLPWK_ER0) Peripheral 13 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID13_Msk               (0x1U << PMC_SLPWK_ER0_PID13_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 13 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID14_Pos               (14)                                           /**< (PMC_SLPWK_ER0) Peripheral 14 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID14_Msk               (0x1U << PMC_SLPWK_ER0_PID14_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 14 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID15_Pos               (15)                                           /**< (PMC_SLPWK_ER0) Peripheral 15 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID15_Msk               (0x1U << PMC_SLPWK_ER0_PID15_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 15 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID16_Pos               (16)                                           /**< (PMC_SLPWK_ER0) Peripheral 16 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID16_Msk               (0x1U << PMC_SLPWK_ER0_PID16_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 16 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID17_Pos               (17)                                           /**< (PMC_SLPWK_ER0) Peripheral 17 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID17_Msk               (0x1U << PMC_SLPWK_ER0_PID17_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 17 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID18_Pos               (18)                                           /**< (PMC_SLPWK_ER0) Peripheral 18 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID18_Msk               (0x1U << PMC_SLPWK_ER0_PID18_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 18 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID19_Pos               (19)                                           /**< (PMC_SLPWK_ER0) Peripheral 19 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID19_Msk               (0x1U << PMC_SLPWK_ER0_PID19_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 19 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID20_Pos               (20)                                           /**< (PMC_SLPWK_ER0) Peripheral 20 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID20_Msk               (0x1U << PMC_SLPWK_ER0_PID20_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 20 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID21_Pos               (21)                                           /**< (PMC_SLPWK_ER0) Peripheral 21 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID21_Msk               (0x1U << PMC_SLPWK_ER0_PID21_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 21 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID22_Pos               (22)                                           /**< (PMC_SLPWK_ER0) Peripheral 22 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID22_Msk               (0x1U << PMC_SLPWK_ER0_PID22_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 22 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID23_Pos               (23)                                           /**< (PMC_SLPWK_ER0) Peripheral 23 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID23_Msk               (0x1U << PMC_SLPWK_ER0_PID23_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 23 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID24_Pos               (24)                                           /**< (PMC_SLPWK_ER0) Peripheral 24 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID24_Msk               (0x1U << PMC_SLPWK_ER0_PID24_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 24 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID25_Pos               (25)                                           /**< (PMC_SLPWK_ER0) Peripheral 25 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID25_Msk               (0x1U << PMC_SLPWK_ER0_PID25_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 25 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID26_Pos               (26)                                           /**< (PMC_SLPWK_ER0) Peripheral 26 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID26_Msk               (0x1U << PMC_SLPWK_ER0_PID26_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 26 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID27_Pos               (27)                                           /**< (PMC_SLPWK_ER0) Peripheral 27 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID27_Msk               (0x1U << PMC_SLPWK_ER0_PID27_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 27 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID28_Pos               (28)                                           /**< (PMC_SLPWK_ER0) Peripheral 28 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID28_Msk               (0x1U << PMC_SLPWK_ER0_PID28_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 28 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID29_Pos               (29)                                           /**< (PMC_SLPWK_ER0) Peripheral 29 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID29_Msk               (0x1U << PMC_SLPWK_ER0_PID29_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 29 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID30_Pos               (30)                                           /**< (PMC_SLPWK_ER0) Peripheral 30 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID30_Msk               (0x1U << PMC_SLPWK_ER0_PID30_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 30 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_PID31_Pos               (31)                                           /**< (PMC_SLPWK_ER0) Peripheral 31 SleepWalking Enable Position */
#define PMC_SLPWK_ER0_PID31_Msk               (0x1U << PMC_SLPWK_ER0_PID31_Pos)              /**< (PMC_SLPWK_ER0) Peripheral 31 SleepWalking Enable Mask */
#define PMC_SLPWK_ER0_Msk                     (0xFFFFFF80UL)                                 /**< (PMC_SLPWK_ER0) Register Mask  */
#define PMC_SLPWK_ER0_PID_Pos                 (7)                                            /**< (PMC_SLPWK_ER0 Position) Peripheral 3x SleepWalking Enable */
#define PMC_SLPWK_ER0_PID_Msk                 (0x1FFFFFFU << PMC_SLPWK_ER0_PID_Pos)          /**< (PMC_SLPWK_ER0 Mask) PID */
#define PMC_SLPWK_ER0_PID(value)              (PMC_SLPWK_ER0_PID_Msk & ((value) << PMC_SLPWK_ER0_PID_Pos))

/* -------- PMC_SLPWK_DR0 : (PMC Offset: 0x118) (/W 32) SleepWalking Disable Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID7:1;                    /**< bit:      7  Peripheral 7 SleepWalking Disable             */
    uint32_t PID8:1;                    /**< bit:      8  Peripheral 8 SleepWalking Disable             */
    uint32_t PID9:1;                    /**< bit:      9  Peripheral 9 SleepWalking Disable             */
    uint32_t PID10:1;                   /**< bit:     10  Peripheral 10 SleepWalking Disable            */
    uint32_t PID11:1;                   /**< bit:     11  Peripheral 11 SleepWalking Disable            */
    uint32_t PID12:1;                   /**< bit:     12  Peripheral 12 SleepWalking Disable            */
    uint32_t PID13:1;                   /**< bit:     13  Peripheral 13 SleepWalking Disable            */
    uint32_t PID14:1;                   /**< bit:     14  Peripheral 14 SleepWalking Disable            */
    uint32_t PID15:1;                   /**< bit:     15  Peripheral 15 SleepWalking Disable            */
    uint32_t PID16:1;                   /**< bit:     16  Peripheral 16 SleepWalking Disable            */
    uint32_t PID17:1;                   /**< bit:     17  Peripheral 17 SleepWalking Disable            */
    uint32_t PID18:1;                   /**< bit:     18  Peripheral 18 SleepWalking Disable            */
    uint32_t PID19:1;                   /**< bit:     19  Peripheral 19 SleepWalking Disable            */
    uint32_t PID20:1;                   /**< bit:     20  Peripheral 20 SleepWalking Disable            */
    uint32_t PID21:1;                   /**< bit:     21  Peripheral 21 SleepWalking Disable            */
    uint32_t PID22:1;                   /**< bit:     22  Peripheral 22 SleepWalking Disable            */
    uint32_t PID23:1;                   /**< bit:     23  Peripheral 23 SleepWalking Disable            */
    uint32_t PID24:1;                   /**< bit:     24  Peripheral 24 SleepWalking Disable            */
    uint32_t PID25:1;                   /**< bit:     25  Peripheral 25 SleepWalking Disable            */
    uint32_t PID26:1;                   /**< bit:     26  Peripheral 26 SleepWalking Disable            */
    uint32_t PID27:1;                   /**< bit:     27  Peripheral 27 SleepWalking Disable            */
    uint32_t PID28:1;                   /**< bit:     28  Peripheral 28 SleepWalking Disable            */
    uint32_t PID29:1;                   /**< bit:     29  Peripheral 29 SleepWalking Disable            */
    uint32_t PID30:1;                   /**< bit:     30  Peripheral 30 SleepWalking Disable            */
    uint32_t PID31:1;                   /**< bit:     31  Peripheral 31 SleepWalking Disable            */
  };
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID:25;                    /**< bit:  7..31  Peripheral 3x SleepWalking Disable            */
  };
  uint32_t w;
} __PMC_SLPWK_DR0_bits_t;

