zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_SLPWK_DR0_PID7_Pos                (7)                                            /**< (PMC_SLPWK_DR0) Peripheral 7 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID7_Msk                (0x1U << PMC_SLPWK_DR0_PID7_Pos)               /**< (PMC_SLPWK_DR0) Peripheral 7 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID8_Pos                (8)                                            /**< (PMC_SLPWK_DR0) Peripheral 8 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID8_Msk                (0x1U << PMC_SLPWK_DR0_PID8_Pos)               /**< (PMC_SLPWK_DR0) Peripheral 8 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID9_Pos                (9)                                            /**< (PMC_SLPWK_DR0) Peripheral 9 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID9_Msk                (0x1U << PMC_SLPWK_DR0_PID9_Pos)               /**< (PMC_SLPWK_DR0) Peripheral 9 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID10_Pos               (10)                                           /**< (PMC_SLPWK_DR0) Peripheral 10 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID10_Msk               (0x1U << PMC_SLPWK_DR0_PID10_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 10 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID11_Pos               (11)                                           /**< (PMC_SLPWK_DR0) Peripheral 11 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID11_Msk               (0x1U << PMC_SLPWK_DR0_PID11_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 11 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID12_Pos               (12)                                           /**< (PMC_SLPWK_DR0) Peripheral 12 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID12_Msk               (0x1U << PMC_SLPWK_DR0_PID12_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 12 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID13_Pos               (13)                                           /**< (PMC_SLPWK_DR0) Peripheral 13 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID13_Msk               (0x1U << PMC_SLPWK_DR0_PID13_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 13 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID14_Pos               (14)                                           /**< (PMC_SLPWK_DR0) Peripheral 14 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID14_Msk               (0x1U << PMC_SLPWK_DR0_PID14_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 14 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID15_Pos               (15)                                           /**< (PMC_SLPWK_DR0) Peripheral 15 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID15_Msk               (0x1U << PMC_SLPWK_DR0_PID15_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 15 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID16_Pos               (16)                                           /**< (PMC_SLPWK_DR0) Peripheral 16 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID16_Msk               (0x1U << PMC_SLPWK_DR0_PID16_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 16 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID17_Pos               (17)                                           /**< (PMC_SLPWK_DR0) Peripheral 17 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID17_Msk               (0x1U << PMC_SLPWK_DR0_PID17_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 17 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID18_Pos               (18)                                           /**< (PMC_SLPWK_DR0) Peripheral 18 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID18_Msk               (0x1U << PMC_SLPWK_DR0_PID18_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 18 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID19_Pos               (19)                                           /**< (PMC_SLPWK_DR0) Peripheral 19 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID19_Msk               (0x1U << PMC_SLPWK_DR0_PID19_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 19 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID20_Pos               (20)                                           /**< (PMC_SLPWK_DR0) Peripheral 20 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID20_Msk               (0x1U << PMC_SLPWK_DR0_PID20_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 20 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID21_Pos               (21)                                           /**< (PMC_SLPWK_DR0) Peripheral 21 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID21_Msk               (0x1U << PMC_SLPWK_DR0_PID21_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 21 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID22_Pos               (22)                                           /**< (PMC_SLPWK_DR0) Peripheral 22 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID22_Msk               (0x1U << PMC_SLPWK_DR0_PID22_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 22 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID23_Pos               (23)                                           /**< (PMC_SLPWK_DR0) Peripheral 23 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID23_Msk               (0x1U << PMC_SLPWK_DR0_PID23_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 23 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID24_Pos               (24)                                           /**< (PMC_SLPWK_DR0) Peripheral 24 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID24_Msk               (0x1U << PMC_SLPWK_DR0_PID24_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 24 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID25_Pos               (25)                                           /**< (PMC_SLPWK_DR0) Peripheral 25 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID25_Msk               (0x1U << PMC_SLPWK_DR0_PID25_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 25 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID26_Pos               (26)                                           /**< (PMC_SLPWK_DR0) Peripheral 26 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID26_Msk               (0x1U << PMC_SLPWK_DR0_PID26_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 26 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID27_Pos               (27)                                           /**< (PMC_SLPWK_DR0) Peripheral 27 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID27_Msk               (0x1U << PMC_SLPWK_DR0_PID27_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 27 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID28_Pos               (28)                                           /**< (PMC_SLPWK_DR0) Peripheral 28 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID28_Msk               (0x1U << PMC_SLPWK_DR0_PID28_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 28 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID29_Pos               (29)                                           /**< (PMC_SLPWK_DR0) Peripheral 29 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID29_Msk               (0x1U << PMC_SLPWK_DR0_PID29_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 29 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID30_Pos               (30)                                           /**< (PMC_SLPWK_DR0) Peripheral 30 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID30_Msk               (0x1U << PMC_SLPWK_DR0_PID30_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 30 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_PID31_Pos               (31)                                           /**< (PMC_SLPWK_DR0) Peripheral 31 SleepWalking Disable Position */
#define PMC_SLPWK_DR0_PID31_Msk               (0x1U << PMC_SLPWK_DR0_PID31_Pos)              /**< (PMC_SLPWK_DR0) Peripheral 31 SleepWalking Disable Mask */
#define PMC_SLPWK_DR0_Msk                     (0xFFFFFF80UL)                                 /**< (PMC_SLPWK_DR0) Register Mask  */
#define PMC_SLPWK_DR0_PID_Pos                 (7)                                            /**< (PMC_SLPWK_DR0 Position) Peripheral 3x SleepWalking Disable */
#define PMC_SLPWK_DR0_PID_Msk                 (0x1FFFFFFU << PMC_SLPWK_DR0_PID_Pos)          /**< (PMC_SLPWK_DR0 Mask) PID */
#define PMC_SLPWK_DR0_PID(value)              (PMC_SLPWK_DR0_PID_Msk & ((value) << PMC_SLPWK_DR0_PID_Pos))

/* -------- PMC_SLPWK_SR0 : (PMC Offset: 0x11c) (R/ 32) SleepWalking Status Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID7:1;                    /**< bit:      7  Peripheral 7 SleepWalking Status              */
    uint32_t PID8:1;                    /**< bit:      8  Peripheral 8 SleepWalking Status              */
    uint32_t PID9:1;                    /**< bit:      9  Peripheral 9 SleepWalking Status              */
    uint32_t PID10:1;                   /**< bit:     10  Peripheral 10 SleepWalking Status             */
    uint32_t PID11:1;                   /**< bit:     11  Peripheral 11 SleepWalking Status             */
    uint32_t PID12:1;                   /**< bit:     12  Peripheral 12 SleepWalking Status             */
    uint32_t PID13:1;                   /**< bit:     13  Peripheral 13 SleepWalking Status             */
    uint32_t PID14:1;                   /**< bit:     14  Peripheral 14 SleepWalking Status             */
    uint32_t PID15:1;                   /**< bit:     15  Peripheral 15 SleepWalking Status             */
    uint32_t PID16:1;                   /**< bit:     16  Peripheral 16 SleepWalking Status             */
    uint32_t PID17:1;                   /**< bit:     17  Peripheral 17 SleepWalking Status             */
    uint32_t PID18:1;                   /**< bit:     18  Peripheral 18 SleepWalking Status             */
    uint32_t PID19:1;                   /**< bit:     19  Peripheral 19 SleepWalking Status             */
    uint32_t PID20:1;                   /**< bit:     20  Peripheral 20 SleepWalking Status             */
    uint32_t PID21:1;                   /**< bit:     21  Peripheral 21 SleepWalking Status             */
    uint32_t PID22:1;                   /**< bit:     22  Peripheral 22 SleepWalking Status             */
    uint32_t PID23:1;                   /**< bit:     23  Peripheral 23 SleepWalking Status             */
    uint32_t PID24:1;                   /**< bit:     24  Peripheral 24 SleepWalking Status             */
    uint32_t PID25:1;                   /**< bit:     25  Peripheral 25 SleepWalking Status             */
    uint32_t PID26:1;                   /**< bit:     26  Peripheral 26 SleepWalking Status             */
    uint32_t PID27:1;                   /**< bit:     27  Peripheral 27 SleepWalking Status             */
    uint32_t PID28:1;                   /**< bit:     28  Peripheral 28 SleepWalking Status             */
    uint32_t PID29:1;                   /**< bit:     29  Peripheral 29 SleepWalking Status             */
    uint32_t PID30:1;                   /**< bit:     30  Peripheral 30 SleepWalking Status             */
    uint32_t PID31:1;                   /**< bit:     31  Peripheral 31 SleepWalking Status             */
  };
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID:25;                    /**< bit:  7..31  Peripheral 3x SleepWalking Status             */
  };
  uint32_t w;
} __PMC_SLPWK_SR0_bits_t;

#define PMC_SLPWK_SR0_PID7_Pos                (7)                                            /**< (PMC_SLPWK_SR0) Peripheral 7 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID7_Msk                (0x1U << PMC_SLPWK_SR0_PID7_Pos)               /**< (PMC_SLPWK_SR0) Peripheral 7 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID8_Pos                (8)                                            /**< (PMC_SLPWK_SR0) Peripheral 8 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID8_Msk                (0x1U << PMC_SLPWK_SR0_PID8_Pos)               /**< (PMC_SLPWK_SR0) Peripheral 8 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID9_Pos                (9)                                            /**< (PMC_SLPWK_SR0) Peripheral 9 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID9_Msk                (0x1U << PMC_SLPWK_SR0_PID9_Pos)               /**< (PMC_SLPWK_SR0) Peripheral 9 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID10_Pos               (10)                                           /**< (PMC_SLPWK_SR0) Peripheral 10 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID10_Msk               (0x1U << PMC_SLPWK_SR0_PID10_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 10 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID11_Pos               (11)                                           /**< (PMC_SLPWK_SR0) Peripheral 11 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID11_Msk               (0x1U << PMC_SLPWK_SR0_PID11_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 11 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID12_Pos               (12)                                           /**< (PMC_SLPWK_SR0) Peripheral 12 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID12_Msk               (0x1U << PMC_SLPWK_SR0_PID12_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 12 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID13_Pos               (13)                                           /**< (PMC_SLPWK_SR0) Peripheral 13 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID13_Msk               (0x1U << PMC_SLPWK_SR0_PID13_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 13 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID14_Pos               (14)                                           /**< (PMC_SLPWK_SR0) Peripheral 14 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID14_Msk               (0x1U << PMC_SLPWK_SR0_PID14_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 14 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID15_Pos               (15)                                           /**< (PMC_SLPWK_SR0) Peripheral 15 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID15_Msk               (0x1U << PMC_SLPWK_SR0_PID15_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 15 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID16_Pos               (16)                                           /**< (PMC_SLPWK_SR0) Peripheral 16 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID16_Msk               (0x1U << PMC_SLPWK_SR0_PID16_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 16 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID17_Pos               (17)                                           /**< (PMC_SLPWK_SR0) Peripheral 17 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID17_Msk               (0x1U << PMC_SLPWK_SR0_PID17_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 17 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID18_Pos               (18)                                           /**< (PMC_SLPWK_SR0) Peripheral 18 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID18_Msk               (0x1U << PMC_SLPWK_SR0_PID18_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 18 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID19_Pos               (19)                                           /**< (PMC_SLPWK_SR0) Peripheral 19 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID19_Msk               (0x1U << PMC_SLPWK_SR0_PID19_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 19 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID20_Pos               (20)                                           /**< (PMC_SLPWK_SR0) Peripheral 20 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID20_Msk               (0x1U << PMC_SLPWK_SR0_PID20_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 20 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID21_Pos               (21)                                           /**< (PMC_SLPWK_SR0) Peripheral 21 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID21_Msk               (0x1U << PMC_SLPWK_SR0_PID21_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 21 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID22_Pos               (22)                                           /**< (PMC_SLPWK_SR0) Peripheral 22 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID22_Msk               (0x1U << PMC_SLPWK_SR0_PID22_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 22 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID23_Pos               (23)                                           /**< (PMC_SLPWK_SR0) Peripheral 23 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID23_Msk               (0x1U << PMC_SLPWK_SR0_PID23_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 23 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID24_Pos               (24)                                           /**< (PMC_SLPWK_SR0) Peripheral 24 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID24_Msk               (0x1U << PMC_SLPWK_SR0_PID24_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 24 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID25_Pos               (25)                                           /**< (PMC_SLPWK_SR0) Peripheral 25 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID25_Msk               (0x1U << PMC_SLPWK_SR0_PID25_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 25 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID26_Pos               (26)                                           /**< (PMC_SLPWK_SR0) Peripheral 26 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID26_Msk               (0x1U << PMC_SLPWK_SR0_PID26_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 26 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID27_Pos               (27)                                           /**< (PMC_SLPWK_SR0) Peripheral 27 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID27_Msk               (0x1U << PMC_SLPWK_SR0_PID27_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 27 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID28_Pos               (28)                                           /**< (PMC_SLPWK_SR0) Peripheral 28 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID28_Msk               (0x1U << PMC_SLPWK_SR0_PID28_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 28 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID29_Pos               (29)                                           /**< (PMC_SLPWK_SR0) Peripheral 29 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID29_Msk               (0x1U << PMC_SLPWK_SR0_PID29_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 29 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID30_Pos               (30)                                           /**< (PMC_SLPWK_SR0) Peripheral 30 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID30_Msk               (0x1U << PMC_SLPWK_SR0_PID30_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 30 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_PID31_Pos               (31)                                           /**< (PMC_SLPWK_SR0) Peripheral 31 SleepWalking Status Position */
#define PMC_SLPWK_SR0_PID31_Msk               (0x1U << PMC_SLPWK_SR0_PID31_Pos)              /**< (PMC_SLPWK_SR0) Peripheral 31 SleepWalking Status Mask */
#define PMC_SLPWK_SR0_Msk                     (0xFFFFFF80UL)                                 /**< (PMC_SLPWK_SR0) Register Mask  */
#define PMC_SLPWK_SR0_PID_Pos                 (7)                                            /**< (PMC_SLPWK_SR0 Position) Peripheral 3x SleepWalking Status */
#define PMC_SLPWK_SR0_PID_Msk                 (0x1FFFFFFU << PMC_SLPWK_SR0_PID_Pos)          /**< (PMC_SLPWK_SR0 Mask) PID */
#define PMC_SLPWK_SR0_PID(value)              (PMC_SLPWK_SR0_PID_Msk & ((value) << PMC_SLPWK_SR0_PID_Pos))

