zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
/* -------- PMC_SLPWK_ASR0 : (PMC Offset: 0x120) (R/ 32) SleepWalking Activity Status Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID7:1;                    /**< bit:      7  Peripheral 7 Activity Status                  */
    uint32_t PID8:1;                    /**< bit:      8  Peripheral 8 Activity Status                  */
    uint32_t PID9:1;                    /**< bit:      9  Peripheral 9 Activity Status                  */
    uint32_t PID10:1;                   /**< bit:     10  Peripheral 10 Activity Status                 */
    uint32_t PID11:1;                   /**< bit:     11  Peripheral 11 Activity Status                 */
    uint32_t PID12:1;                   /**< bit:     12  Peripheral 12 Activity Status                 */
    uint32_t PID13:1;                   /**< bit:     13  Peripheral 13 Activity Status                 */
    uint32_t PID14:1;                   /**< bit:     14  Peripheral 14 Activity Status                 */
    uint32_t PID15:1;                   /**< bit:     15  Peripheral 15 Activity Status                 */
    uint32_t PID16:1;                   /**< bit:     16  Peripheral 16 Activity Status                 */
    uint32_t PID17:1;                   /**< bit:     17  Peripheral 17 Activity Status                 */
    uint32_t PID18:1;                   /**< bit:     18  Peripheral 18 Activity Status                 */
    uint32_t PID19:1;                   /**< bit:     19  Peripheral 19 Activity Status                 */
    uint32_t PID20:1;                   /**< bit:     20  Peripheral 20 Activity Status                 */
    uint32_t PID21:1;                   /**< bit:     21  Peripheral 21 Activity Status                 */
    uint32_t PID22:1;                   /**< bit:     22  Peripheral 22 Activity Status                 */
    uint32_t PID23:1;                   /**< bit:     23  Peripheral 23 Activity Status                 */
    uint32_t PID24:1;                   /**< bit:     24  Peripheral 24 Activity Status                 */
    uint32_t PID25:1;                   /**< bit:     25  Peripheral 25 Activity Status                 */
    uint32_t PID26:1;                   /**< bit:     26  Peripheral 26 Activity Status                 */
    uint32_t PID27:1;                   /**< bit:     27  Peripheral 27 Activity Status                 */
    uint32_t PID28:1;                   /**< bit:     28  Peripheral 28 Activity Status                 */
    uint32_t PID29:1;                   /**< bit:     29  Peripheral 29 Activity Status                 */
    uint32_t PID30:1;                   /**< bit:     30  Peripheral 30 Activity Status                 */
    uint32_t PID31:1;                   /**< bit:     31  Peripheral 31 Activity Status                 */
  };
  struct
  {
    uint32_t :7;                        /**< bit:   0..6  Reserved                                      */
    uint32_t PID:25;                    /**< bit:  7..31  Peripheral 3x Activity Status                 */
  };
  uint32_t w;
} __PMC_SLPWK_ASR0_bits_t;

#define PMC_SLPWK_ASR0_PID7_Pos               (7)                                            /**< (PMC_SLPWK_ASR0) Peripheral 7 Activity Status Position */
#define PMC_SLPWK_ASR0_PID7_Msk               (0x1U << PMC_SLPWK_ASR0_PID7_Pos)              /**< (PMC_SLPWK_ASR0) Peripheral 7 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID8_Pos               (8)                                            /**< (PMC_SLPWK_ASR0) Peripheral 8 Activity Status Position */
#define PMC_SLPWK_ASR0_PID8_Msk               (0x1U << PMC_SLPWK_ASR0_PID8_Pos)              /**< (PMC_SLPWK_ASR0) Peripheral 8 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID9_Pos               (9)                                            /**< (PMC_SLPWK_ASR0) Peripheral 9 Activity Status Position */
#define PMC_SLPWK_ASR0_PID9_Msk               (0x1U << PMC_SLPWK_ASR0_PID9_Pos)              /**< (PMC_SLPWK_ASR0) Peripheral 9 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID10_Pos              (10)                                           /**< (PMC_SLPWK_ASR0) Peripheral 10 Activity Status Position */
#define PMC_SLPWK_ASR0_PID10_Msk              (0x1U << PMC_SLPWK_ASR0_PID10_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 10 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID11_Pos              (11)                                           /**< (PMC_SLPWK_ASR0) Peripheral 11 Activity Status Position */
#define PMC_SLPWK_ASR0_PID11_Msk              (0x1U << PMC_SLPWK_ASR0_PID11_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 11 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID12_Pos              (12)                                           /**< (PMC_SLPWK_ASR0) Peripheral 12 Activity Status Position */
#define PMC_SLPWK_ASR0_PID12_Msk              (0x1U << PMC_SLPWK_ASR0_PID12_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 12 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID13_Pos              (13)                                           /**< (PMC_SLPWK_ASR0) Peripheral 13 Activity Status Position */
#define PMC_SLPWK_ASR0_PID13_Msk              (0x1U << PMC_SLPWK_ASR0_PID13_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 13 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID14_Pos              (14)                                           /**< (PMC_SLPWK_ASR0) Peripheral 14 Activity Status Position */
#define PMC_SLPWK_ASR0_PID14_Msk              (0x1U << PMC_SLPWK_ASR0_PID14_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 14 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID15_Pos              (15)                                           /**< (PMC_SLPWK_ASR0) Peripheral 15 Activity Status Position */
#define PMC_SLPWK_ASR0_PID15_Msk              (0x1U << PMC_SLPWK_ASR0_PID15_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 15 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID16_Pos              (16)                                           /**< (PMC_SLPWK_ASR0) Peripheral 16 Activity Status Position */
#define PMC_SLPWK_ASR0_PID16_Msk              (0x1U << PMC_SLPWK_ASR0_PID16_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 16 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID17_Pos              (17)                                           /**< (PMC_SLPWK_ASR0) Peripheral 17 Activity Status Position */
#define PMC_SLPWK_ASR0_PID17_Msk              (0x1U << PMC_SLPWK_ASR0_PID17_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 17 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID18_Pos              (18)                                           /**< (PMC_SLPWK_ASR0) Peripheral 18 Activity Status Position */
#define PMC_SLPWK_ASR0_PID18_Msk              (0x1U << PMC_SLPWK_ASR0_PID18_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 18 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID19_Pos              (19)                                           /**< (PMC_SLPWK_ASR0) Peripheral 19 Activity Status Position */
#define PMC_SLPWK_ASR0_PID19_Msk              (0x1U << PMC_SLPWK_ASR0_PID19_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 19 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID20_Pos              (20)                                           /**< (PMC_SLPWK_ASR0) Peripheral 20 Activity Status Position */
#define PMC_SLPWK_ASR0_PID20_Msk              (0x1U << PMC_SLPWK_ASR0_PID20_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 20 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID21_Pos              (21)                                           /**< (PMC_SLPWK_ASR0) Peripheral 21 Activity Status Position */
#define PMC_SLPWK_ASR0_PID21_Msk              (0x1U << PMC_SLPWK_ASR0_PID21_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 21 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID22_Pos              (22)                                           /**< (PMC_SLPWK_ASR0) Peripheral 22 Activity Status Position */
#define PMC_SLPWK_ASR0_PID22_Msk              (0x1U << PMC_SLPWK_ASR0_PID22_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 22 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID23_Pos              (23)                                           /**< (PMC_SLPWK_ASR0) Peripheral 23 Activity Status Position */
#define PMC_SLPWK_ASR0_PID23_Msk              (0x1U << PMC_SLPWK_ASR0_PID23_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 23 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID24_Pos              (24)                                           /**< (PMC_SLPWK_ASR0) Peripheral 24 Activity Status Position */
#define PMC_SLPWK_ASR0_PID24_Msk              (0x1U << PMC_SLPWK_ASR0_PID24_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 24 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID25_Pos              (25)                                           /**< (PMC_SLPWK_ASR0) Peripheral 25 Activity Status Position */
#define PMC_SLPWK_ASR0_PID25_Msk              (0x1U << PMC_SLPWK_ASR0_PID25_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 25 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID26_Pos              (26)                                           /**< (PMC_SLPWK_ASR0) Peripheral 26 Activity Status Position */
#define PMC_SLPWK_ASR0_PID26_Msk              (0x1U << PMC_SLPWK_ASR0_PID26_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 26 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID27_Pos              (27)                                           /**< (PMC_SLPWK_ASR0) Peripheral 27 Activity Status Position */
#define PMC_SLPWK_ASR0_PID27_Msk              (0x1U << PMC_SLPWK_ASR0_PID27_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 27 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID28_Pos              (28)                                           /**< (PMC_SLPWK_ASR0) Peripheral 28 Activity Status Position */
#define PMC_SLPWK_ASR0_PID28_Msk              (0x1U << PMC_SLPWK_ASR0_PID28_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 28 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID29_Pos              (29)                                           /**< (PMC_SLPWK_ASR0) Peripheral 29 Activity Status Position */
#define PMC_SLPWK_ASR0_PID29_Msk              (0x1U << PMC_SLPWK_ASR0_PID29_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 29 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID30_Pos              (30)                                           /**< (PMC_SLPWK_ASR0) Peripheral 30 Activity Status Position */
#define PMC_SLPWK_ASR0_PID30_Msk              (0x1U << PMC_SLPWK_ASR0_PID30_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 30 Activity Status Mask */
#define PMC_SLPWK_ASR0_PID31_Pos              (31)                                           /**< (PMC_SLPWK_ASR0) Peripheral 31 Activity Status Position */
#define PMC_SLPWK_ASR0_PID31_Msk              (0x1U << PMC_SLPWK_ASR0_PID31_Pos)             /**< (PMC_SLPWK_ASR0) Peripheral 31 Activity Status Mask */
#define PMC_SLPWK_ASR0_Msk                    (0xFFFFFF80UL)                                 /**< (PMC_SLPWK_ASR0) Register Mask  */
#define PMC_SLPWK_ASR0_PID_Pos                (7)                                            /**< (PMC_SLPWK_ASR0 Position) Peripheral 3x Activity Status */
#define PMC_SLPWK_ASR0_PID_Msk                (0x1FFFFFFU << PMC_SLPWK_ASR0_PID_Pos)         /**< (PMC_SLPWK_ASR0 Mask) PID */
#define PMC_SLPWK_ASR0_PID(value)             (PMC_SLPWK_ASR0_PID_Msk & ((value) << PMC_SLPWK_ASR0_PID_Pos))

/* -------- PMC_PMMR : (PMC Offset: 0x130) (R/W 32) PLL Maximum Multiplier Value Register -------- */

typedef union
{
  struct
  {
    uint32_t PLLA_MMAX:11;              /**< bit:  0..10  PLLA Maximum Allowed Multiplier Value         */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_PMMR_bits_t;

#define PMC_PMMR_PLLA_MMAX_Pos                (0)                                            /**< (PMC_PMMR) PLLA Maximum Allowed Multiplier Value Position */
#define PMC_PMMR_PLLA_MMAX_Msk                (0x7FFU << PMC_PMMR_PLLA_MMAX_Pos)             /**< (PMC_PMMR) PLLA Maximum Allowed Multiplier Value Mask */
#define PMC_PMMR_PLLA_MMAX(value)             (PMC_PMMR_PLLA_MMAX_Msk & ((value) << PMC_PMMR_PLLA_MMAX_Pos))
#define PMC_PMMR_Msk                          (0x000007FFUL)                                 /**< (PMC_PMMR) Register Mask  */

/* -------- PMC_SLPWK_ER1 : (PMC Offset: 0x134) (/W 32) SleepWalking Enable Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t PID32:1;                   /**< bit:      0  Peripheral 32 SleepWalking Enable             */
    uint32_t PID33:1;                   /**< bit:      1  Peripheral 33 SleepWalking Enable             */
    uint32_t PID34:1;                   /**< bit:      2  Peripheral 34 SleepWalking Enable             */
    uint32_t PID35:1;                   /**< bit:      3  Peripheral 35 SleepWalking Enable             */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PID37:1;                   /**< bit:      5  Peripheral 37 SleepWalking Enable             */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t PID39:1;                   /**< bit:      7  Peripheral 39 SleepWalking Enable             */
    uint32_t PID40:1;                   /**< bit:      8  Peripheral 40 SleepWalking Enable             */
    uint32_t PID41:1;                   /**< bit:      9  Peripheral 41 SleepWalking Enable             */
    uint32_t PID42:1;                   /**< bit:     10  Peripheral 42 SleepWalking Enable             */
    uint32_t PID43:1;                   /**< bit:     11  Peripheral 43 SleepWalking Enable             */
    uint32_t PID44:1;                   /**< bit:     12  Peripheral 44 SleepWalking Enable             */
    uint32_t PID45:1;                   /**< bit:     13  Peripheral 45 SleepWalking Enable             */
    uint32_t PID46:1;                   /**< bit:     14  Peripheral 46 SleepWalking Enable             */
    uint32_t PID47:1;                   /**< bit:     15  Peripheral 47 SleepWalking Enable             */
    uint32_t PID48:1;                   /**< bit:     16  Peripheral 48 SleepWalking Enable             */
    uint32_t PID49:1;                   /**< bit:     17  Peripheral 49 SleepWalking Enable             */
    uint32_t PID50:1;                   /**< bit:     18  Peripheral 50 SleepWalking Enable             */
    uint32_t PID51:1;                   /**< bit:     19  Peripheral 51 SleepWalking Enable             */
    uint32_t PID52:1;                   /**< bit:     20  Peripheral 52 SleepWalking Enable             */
    uint32_t PID53:1;                   /**< bit:     21  Peripheral 53 SleepWalking Enable             */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t PID56:1;                   /**< bit:     24  Peripheral 56 SleepWalking Enable             */
    uint32_t PID57:1;                   /**< bit:     25  Peripheral 57 SleepWalking Enable             */
    uint32_t PID58:1;                   /**< bit:     26  Peripheral 58 SleepWalking Enable             */
    uint32_t PID59:1;                   /**< bit:     27  Peripheral 59 SleepWalking Enable             */
    uint32_t PID60:1;                   /**< bit:     28  Peripheral 60 SleepWalking Enable             */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  {
    uint32_t PID:25;                    /**< bit:  0..24  Peripheral 6x SleepWalking Enable             */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_SLPWK_ER1_bits_t;

