zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
#define PMC_SLPWK_ER1_PID32_Pos               (0)                                            /**< (PMC_SLPWK_ER1) Peripheral 32 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID32_Msk               (0x1U << PMC_SLPWK_ER1_PID32_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 32 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID33_Pos               (1)                                            /**< (PMC_SLPWK_ER1) Peripheral 33 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID33_Msk               (0x1U << PMC_SLPWK_ER1_PID33_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 33 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID34_Pos               (2)                                            /**< (PMC_SLPWK_ER1) Peripheral 34 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID34_Msk               (0x1U << PMC_SLPWK_ER1_PID34_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 34 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID35_Pos               (3)                                            /**< (PMC_SLPWK_ER1) Peripheral 35 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID35_Msk               (0x1U << PMC_SLPWK_ER1_PID35_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 35 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID37_Pos               (5)                                            /**< (PMC_SLPWK_ER1) Peripheral 37 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID37_Msk               (0x1U << PMC_SLPWK_ER1_PID37_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 37 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID39_Pos               (7)                                            /**< (PMC_SLPWK_ER1) Peripheral 39 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID39_Msk               (0x1U << PMC_SLPWK_ER1_PID39_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 39 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID40_Pos               (8)                                            /**< (PMC_SLPWK_ER1) Peripheral 40 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID40_Msk               (0x1U << PMC_SLPWK_ER1_PID40_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 40 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID41_Pos               (9)                                            /**< (PMC_SLPWK_ER1) Peripheral 41 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID41_Msk               (0x1U << PMC_SLPWK_ER1_PID41_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 41 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID42_Pos               (10)                                           /**< (PMC_SLPWK_ER1) Peripheral 42 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID42_Msk               (0x1U << PMC_SLPWK_ER1_PID42_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 42 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID43_Pos               (11)                                           /**< (PMC_SLPWK_ER1) Peripheral 43 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID43_Msk               (0x1U << PMC_SLPWK_ER1_PID43_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 43 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID44_Pos               (12)                                           /**< (PMC_SLPWK_ER1) Peripheral 44 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID44_Msk               (0x1U << PMC_SLPWK_ER1_PID44_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 44 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID45_Pos               (13)                                           /**< (PMC_SLPWK_ER1) Peripheral 45 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID45_Msk               (0x1U << PMC_SLPWK_ER1_PID45_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 45 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID46_Pos               (14)                                           /**< (PMC_SLPWK_ER1) Peripheral 46 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID46_Msk               (0x1U << PMC_SLPWK_ER1_PID46_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 46 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID47_Pos               (15)                                           /**< (PMC_SLPWK_ER1) Peripheral 47 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID47_Msk               (0x1U << PMC_SLPWK_ER1_PID47_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 47 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID48_Pos               (16)                                           /**< (PMC_SLPWK_ER1) Peripheral 48 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID48_Msk               (0x1U << PMC_SLPWK_ER1_PID48_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 48 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID49_Pos               (17)                                           /**< (PMC_SLPWK_ER1) Peripheral 49 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID49_Msk               (0x1U << PMC_SLPWK_ER1_PID49_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 49 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID50_Pos               (18)                                           /**< (PMC_SLPWK_ER1) Peripheral 50 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID50_Msk               (0x1U << PMC_SLPWK_ER1_PID50_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 50 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID51_Pos               (19)                                           /**< (PMC_SLPWK_ER1) Peripheral 51 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID51_Msk               (0x1U << PMC_SLPWK_ER1_PID51_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 51 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID52_Pos               (20)                                           /**< (PMC_SLPWK_ER1) Peripheral 52 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID52_Msk               (0x1U << PMC_SLPWK_ER1_PID52_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 52 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID53_Pos               (21)                                           /**< (PMC_SLPWK_ER1) Peripheral 53 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID53_Msk               (0x1U << PMC_SLPWK_ER1_PID53_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 53 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID56_Pos               (24)                                           /**< (PMC_SLPWK_ER1) Peripheral 56 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID56_Msk               (0x1U << PMC_SLPWK_ER1_PID56_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 56 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID57_Pos               (25)                                           /**< (PMC_SLPWK_ER1) Peripheral 57 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID57_Msk               (0x1U << PMC_SLPWK_ER1_PID57_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 57 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID58_Pos               (26)                                           /**< (PMC_SLPWK_ER1) Peripheral 58 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID58_Msk               (0x1U << PMC_SLPWK_ER1_PID58_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 58 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID59_Pos               (27)                                           /**< (PMC_SLPWK_ER1) Peripheral 59 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID59_Msk               (0x1U << PMC_SLPWK_ER1_PID59_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 59 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_PID60_Pos               (28)                                           /**< (PMC_SLPWK_ER1) Peripheral 60 SleepWalking Enable Position */
#define PMC_SLPWK_ER1_PID60_Msk               (0x1U << PMC_SLPWK_ER1_PID60_Pos)              /**< (PMC_SLPWK_ER1) Peripheral 60 SleepWalking Enable Mask */
#define PMC_SLPWK_ER1_Msk                     (0x1F3FFFAFUL)                                 /**< (PMC_SLPWK_ER1) Register Mask  */
#define PMC_SLPWK_ER1_PID_Pos                 (0)                                            /**< (PMC_SLPWK_ER1 Position) Peripheral 6x SleepWalking Enable */
#define PMC_SLPWK_ER1_PID_Msk                 (0x1FFFFFFU << PMC_SLPWK_ER1_PID_Pos)          /**< (PMC_SLPWK_ER1 Mask) PID */
#define PMC_SLPWK_ER1_PID(value)              (PMC_SLPWK_ER1_PID_Msk & ((value) << PMC_SLPWK_ER1_PID_Pos))

/* -------- PMC_SLPWK_DR1 : (PMC Offset: 0x138) (/W 32) SleepWalking Disable Register 1 -------- */

typedef union
{
  struct
  {
    uint32_t PID32:1;                   /**< bit:      0  Peripheral 32 SleepWalking Disable            */
    uint32_t PID33:1;                   /**< bit:      1  Peripheral 33 SleepWalking Disable            */
    uint32_t PID34:1;                   /**< bit:      2  Peripheral 34 SleepWalking Disable            */
    uint32_t PID35:1;                   /**< bit:      3  Peripheral 35 SleepWalking Disable            */
    uint32_t :1;                        /**< bit:      4  Reserved                                      */
    uint32_t PID37:1;                   /**< bit:      5  Peripheral 37 SleepWalking Disable            */
    uint32_t :1;                        /**< bit:      6  Reserved                                      */
    uint32_t PID39:1;                   /**< bit:      7  Peripheral 39 SleepWalking Disable            */
    uint32_t PID40:1;                   /**< bit:      8  Peripheral 40 SleepWalking Disable            */
    uint32_t PID41:1;                   /**< bit:      9  Peripheral 41 SleepWalking Disable            */
    uint32_t PID42:1;                   /**< bit:     10  Peripheral 42 SleepWalking Disable            */
    uint32_t PID43:1;                   /**< bit:     11  Peripheral 43 SleepWalking Disable            */
    uint32_t PID44:1;                   /**< bit:     12  Peripheral 44 SleepWalking Disable            */
    uint32_t PID45:1;                   /**< bit:     13  Peripheral 45 SleepWalking Disable            */
    uint32_t PID46:1;                   /**< bit:     14  Peripheral 46 SleepWalking Disable            */
    uint32_t PID47:1;                   /**< bit:     15  Peripheral 47 SleepWalking Disable            */
    uint32_t PID48:1;                   /**< bit:     16  Peripheral 48 SleepWalking Disable            */
    uint32_t PID49:1;                   /**< bit:     17  Peripheral 49 SleepWalking Disable            */
    uint32_t PID50:1;                   /**< bit:     18  Peripheral 50 SleepWalking Disable            */
    uint32_t PID51:1;                   /**< bit:     19  Peripheral 51 SleepWalking Disable            */
    uint32_t PID52:1;                   /**< bit:     20  Peripheral 52 SleepWalking Disable            */
    uint32_t PID53:1;                   /**< bit:     21  Peripheral 53 SleepWalking Disable            */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t PID56:1;                   /**< bit:     24  Peripheral 56 SleepWalking Disable            */
    uint32_t PID57:1;                   /**< bit:     25  Peripheral 57 SleepWalking Disable            */
    uint32_t PID58:1;                   /**< bit:     26  Peripheral 58 SleepWalking Disable            */
    uint32_t PID59:1;                   /**< bit:     27  Peripheral 59 SleepWalking Disable            */
    uint32_t PID60:1;                   /**< bit:     28  Peripheral 60 SleepWalking Disable            */
    uint32_t :3;                        /**< bit: 29..31  Reserved                                      */
  };
  struct
  {
    uint32_t PID:25;                    /**< bit:  0..24  Peripheral 6x SleepWalking Disable            */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_SLPWK_DR1_bits_t;

#define PMC_SLPWK_DR1_PID32_Pos               (0)                                            /**< (PMC_SLPWK_DR1) Peripheral 32 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID32_Msk               (0x1U << PMC_SLPWK_DR1_PID32_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 32 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID33_Pos               (1)                                            /**< (PMC_SLPWK_DR1) Peripheral 33 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID33_Msk               (0x1U << PMC_SLPWK_DR1_PID33_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 33 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID34_Pos               (2)                                            /**< (PMC_SLPWK_DR1) Peripheral 34 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID34_Msk               (0x1U << PMC_SLPWK_DR1_PID34_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 34 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID35_Pos               (3)                                            /**< (PMC_SLPWK_DR1) Peripheral 35 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID35_Msk               (0x1U << PMC_SLPWK_DR1_PID35_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 35 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID37_Pos               (5)                                            /**< (PMC_SLPWK_DR1) Peripheral 37 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID37_Msk               (0x1U << PMC_SLPWK_DR1_PID37_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 37 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID39_Pos               (7)                                            /**< (PMC_SLPWK_DR1) Peripheral 39 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID39_Msk               (0x1U << PMC_SLPWK_DR1_PID39_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 39 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID40_Pos               (8)                                            /**< (PMC_SLPWK_DR1) Peripheral 40 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID40_Msk               (0x1U << PMC_SLPWK_DR1_PID40_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 40 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID41_Pos               (9)                                            /**< (PMC_SLPWK_DR1) Peripheral 41 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID41_Msk               (0x1U << PMC_SLPWK_DR1_PID41_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 41 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID42_Pos               (10)                                           /**< (PMC_SLPWK_DR1) Peripheral 42 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID42_Msk               (0x1U << PMC_SLPWK_DR1_PID42_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 42 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID43_Pos               (11)                                           /**< (PMC_SLPWK_DR1) Peripheral 43 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID43_Msk               (0x1U << PMC_SLPWK_DR1_PID43_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 43 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID44_Pos               (12)                                           /**< (PMC_SLPWK_DR1) Peripheral 44 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID44_Msk               (0x1U << PMC_SLPWK_DR1_PID44_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 44 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID45_Pos               (13)                                           /**< (PMC_SLPWK_DR1) Peripheral 45 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID45_Msk               (0x1U << PMC_SLPWK_DR1_PID45_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 45 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID46_Pos               (14)                                           /**< (PMC_SLPWK_DR1) Peripheral 46 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID46_Msk               (0x1U << PMC_SLPWK_DR1_PID46_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 46 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID47_Pos               (15)                                           /**< (PMC_SLPWK_DR1) Peripheral 47 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID47_Msk               (0x1U << PMC_SLPWK_DR1_PID47_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 47 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID48_Pos               (16)                                           /**< (PMC_SLPWK_DR1) Peripheral 48 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID48_Msk               (0x1U << PMC_SLPWK_DR1_PID48_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 48 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID49_Pos               (17)                                           /**< (PMC_SLPWK_DR1) Peripheral 49 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID49_Msk               (0x1U << PMC_SLPWK_DR1_PID49_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 49 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID50_Pos               (18)                                           /**< (PMC_SLPWK_DR1) Peripheral 50 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID50_Msk               (0x1U << PMC_SLPWK_DR1_PID50_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 50 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID51_Pos               (19)                                           /**< (PMC_SLPWK_DR1) Peripheral 51 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID51_Msk               (0x1U << PMC_SLPWK_DR1_PID51_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 51 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID52_Pos               (20)                                           /**< (PMC_SLPWK_DR1) Peripheral 52 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID52_Msk               (0x1U << PMC_SLPWK_DR1_PID52_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 52 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID53_Pos               (21)                                           /**< (PMC_SLPWK_DR1) Peripheral 53 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID53_Msk               (0x1U << PMC_SLPWK_DR1_PID53_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 53 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID56_Pos               (24)                                           /**< (PMC_SLPWK_DR1) Peripheral 56 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID56_Msk               (0x1U << PMC_SLPWK_DR1_PID56_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 56 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID57_Pos               (25)                                           /**< (PMC_SLPWK_DR1) Peripheral 57 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID57_Msk               (0x1U << PMC_SLPWK_DR1_PID57_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 57 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID58_Pos               (26)                                           /**< (PMC_SLPWK_DR1) Peripheral 58 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID58_Msk               (0x1U << PMC_SLPWK_DR1_PID58_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 58 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID59_Pos               (27)                                           /**< (PMC_SLPWK_DR1) Peripheral 59 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID59_Msk               (0x1U << PMC_SLPWK_DR1_PID59_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 59 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_PID60_Pos               (28)                                           /**< (PMC_SLPWK_DR1) Peripheral 60 SleepWalking Disable Position */
#define PMC_SLPWK_DR1_PID60_Msk               (0x1U << PMC_SLPWK_DR1_PID60_Pos)              /**< (PMC_SLPWK_DR1) Peripheral 60 SleepWalking Disable Mask */
#define PMC_SLPWK_DR1_Msk                     (0x1F3FFFAFUL)                                 /**< (PMC_SLPWK_DR1) Register Mask  */
#define PMC_SLPWK_DR1_PID_Pos                 (0)                                            /**< (PMC_SLPWK_DR1 Position) Peripheral 6x SleepWalking Disable */
#define PMC_SLPWK_DR1_PID_Msk                 (0x1FFFFFFU << PMC_SLPWK_DR1_PID_Pos)          /**< (PMC_SLPWK_DR1 Mask) PID */
#define PMC_SLPWK_DR1_PID(value)              (PMC_SLPWK_DR1_PID_Msk & ((value) << PMC_SLPWK_DR1_PID_Pos))

/* -------- PMC_SLPWK_SR1 : (PMC Offset: 0x13c) (R/ 32) SleepWalking Status Register 1 -------- */

