zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
typedef union
{
  struct
  {
    uint32_t AIP:1;                     /**< bit:      0  Activity In Progress                          */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_SLPWK_AIPR_bits_t;

#define PMC_SLPWK_AIPR_AIP_Pos                (0)                                            /**< (PMC_SLPWK_AIPR) Activity In Progress Position */
#define PMC_SLPWK_AIPR_AIP_Msk                (0x1U << PMC_SLPWK_AIPR_AIP_Pos)               /**< (PMC_SLPWK_AIPR) Activity In Progress Mask */
#define PMC_SLPWK_AIPR_Msk                    (0x00000001UL)                                 /**< (PMC_SLPWK_AIPR) Register Mask  */

/* -------- PMC_APLLACR : (PMC Offset: 0x158) (R/W 32) Audio PLL Analog Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t DCOFLTSEL:4;               /**< bit:   0..3  DCO Filter Selection                          */
    uint32_t FLTSEL:4;                  /**< bit:   4..7  PLL Filter Selection                          */
    uint32_t BIAS:2;                    /**< bit:   8..9  Bias Voltage Selection                        */
    uint32_t :22;                       /**< bit: 10..31  Reserved                                      */
  };
  uint32_t w;
} __PMC_APLLACR_bits_t;

#define PMC_APLLACR_DCOFLTSEL_Pos             (0)                                            /**< (PMC_APLLACR) DCO Filter Selection Position */
#define PMC_APLLACR_DCOFLTSEL_Msk             (0xFU << PMC_APLLACR_DCOFLTSEL_Pos)            /**< (PMC_APLLACR) DCO Filter Selection Mask */
#define PMC_APLLACR_DCOFLTSEL(value)          (PMC_APLLACR_DCOFLTSEL_Msk & ((value) << PMC_APLLACR_DCOFLTSEL_Pos))
#define PMC_APLLACR_FLTSEL_Pos                (4)                                            /**< (PMC_APLLACR) PLL Filter Selection Position */
#define PMC_APLLACR_FLTSEL_Msk                (0xFU << PMC_APLLACR_FLTSEL_Pos)               /**< (PMC_APLLACR) PLL Filter Selection Mask */
#define PMC_APLLACR_FLTSEL(value)             (PMC_APLLACR_FLTSEL_Msk & ((value) << PMC_APLLACR_FLTSEL_Pos))
#define PMC_APLLACR_BIAS_Pos                  (8)                                            /**< (PMC_APLLACR) Bias Voltage Selection Position */
#define PMC_APLLACR_BIAS_Msk                  (0x3U << PMC_APLLACR_BIAS_Pos)                 /**< (PMC_APLLACR) Bias Voltage Selection Mask */
#define PMC_APLLACR_BIAS(value)               (PMC_APLLACR_BIAS_Msk & ((value) << PMC_APLLACR_BIAS_Pos))
#define PMC_APLLACR_Msk                       (0x000003FFUL)                                 /**< (PMC_APLLACR) Register Mask  */

/* -------- PMC_WMST : (PMC Offset: 0x15c) (R/W 32) Wait Mode Startup Time Register -------- */

typedef union
{
  struct
  {
    uint32_t WMST:8;                    /**< bit:   0..7  Wait Mode Startup Time                        */
    uint32_t :16;                       /**< bit:  8..23  Reserved                                      */
    uint32_t KEY:8;                     /**< bit: 24..31  Write Access Password                         */
  };
  uint32_t w;
} __PMC_WMST_bits_t;

#define PMC_WMST_WMST_Pos                     (0)                                            /**< (PMC_WMST) Wait Mode Startup Time Position */
#define PMC_WMST_WMST_Msk                     (0xFFU << PMC_WMST_WMST_Pos)                   /**< (PMC_WMST) Wait Mode Startup Time Mask */
#define PMC_WMST_WMST(value)                  (PMC_WMST_WMST_Msk & ((value) << PMC_WMST_WMST_Pos))
#define PMC_WMST_KEY_Pos                      (24)                                           /**< (PMC_WMST) Write Access Password Position */
#define PMC_WMST_KEY_Msk                      (0xFFU << PMC_WMST_KEY_Pos)                    /**< (PMC_WMST) Write Access Password Mask */
#define PMC_WMST_KEY(value)                   (PMC_WMST_KEY_Msk & ((value) << PMC_WMST_KEY_Pos))
#define   PMC_WMST_KEY_PASSWD_Val             (0x5AU)                                        /**< (PMC_WMST) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define PMC_WMST_KEY_PASSWD                   (PMC_WMST_KEY_PASSWD_Val << PMC_WMST_KEY_Pos)  /**< (PMC_WMST) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define PMC_WMST_Msk                          (0xFF0000FFUL)                                 /**< (PMC_WMST) Register Mask  */

/** \brief PMC register offsets definitions */
#define PMC_SCER_OFFSET              (0x00)         /**< (PMC_SCER) System Clock Enable Register Offset */
#define PMC_SCDR_OFFSET              (0x04)         /**< (PMC_SCDR) System Clock Disable Register Offset */
#define PMC_SCSR_OFFSET              (0x08)         /**< (PMC_SCSR) System Clock Status Register Offset */
#define PMC_PCER0_OFFSET             (0x10)         /**< (PMC_PCER0) Peripheral Clock Enable Register 0 Offset */
#define PMC_PCDR0_OFFSET             (0x14)         /**< (PMC_PCDR0) Peripheral Clock Disable Register 0 Offset */
#define PMC_PCSR0_OFFSET             (0x18)         /**< (PMC_PCSR0) Peripheral Clock Status Register 0 Offset */
#define CKGR_UCKR_OFFSET             (0x1C)         /**< (CKGR_UCKR) UTMI Clock Register Offset */
#define CKGR_MOR_OFFSET              (0x20)         /**< (CKGR_MOR) Main Oscillator Register Offset */
#define CKGR_MCFR_OFFSET             (0x24)         /**< (CKGR_MCFR) Main Clock Frequency Register Offset */
#define CKGR_PLLAR_OFFSET            (0x28)         /**< (CKGR_PLLAR) PLLA Register Offset */
#define PMC_MCKR_OFFSET              (0x30)         /**< (PMC_MCKR) Master Clock Register Offset */
#define PMC_USB_OFFSET               (0x38)         /**< (PMC_USB) USB Clock Register Offset */
#define PMC_PCK_OFFSET               (0x40)         /**< (PMC_PCK) Programmable Clock Register (chid = 0) 0 Offset */
#define PMC_IER_OFFSET               (0x60)         /**< (PMC_IER) Interrupt Enable Register Offset */
#define PMC_IDR_OFFSET               (0x64)         /**< (PMC_IDR) Interrupt Disable Register Offset */
#define PMC_SR_OFFSET                (0x68)         /**< (PMC_SR) Status Register Offset */
#define PMC_IMR_OFFSET               (0x6C)         /**< (PMC_IMR) Interrupt Mask Register Offset */
#define PMC_FSMR_OFFSET              (0x70)         /**< (PMC_FSMR) Fast Startup Mode Register Offset */
#define PMC_FSPR_OFFSET              (0x74)         /**< (PMC_FSPR) Fast Startup Polarity Register Offset */
#define PMC_FOCR_OFFSET              (0x78)         /**< (PMC_FOCR) Fault Output Clear Register Offset */
#define PMC_WPMR_OFFSET              (0xE4)         /**< (PMC_WPMR) Write Protection Mode Register Offset */
#define PMC_WPSR_OFFSET              (0xE8)         /**< (PMC_WPSR) Write Protection Status Register Offset */
#define PMC_PCER1_OFFSET             (0x100)        /**< (PMC_PCER1) Peripheral Clock Enable Register 1 Offset */
#define PMC_PCDR1_OFFSET             (0x104)        /**< (PMC_PCDR1) Peripheral Clock Disable Register 1 Offset */
#define PMC_PCSR1_OFFSET             (0x108)        /**< (PMC_PCSR1) Peripheral Clock Status Register 1 Offset */
#define PMC_PCR_OFFSET               (0x10C)        /**< (PMC_PCR) Peripheral Control Register Offset */
#define PMC_OCR_OFFSET               (0x110)        /**< (PMC_OCR) Oscillator Calibration Register Offset */
#define PMC_SLPWK_ER0_OFFSET         (0x114)        /**< (PMC_SLPWK_ER0) SleepWalking Enable Register 0 Offset */
#define PMC_SLPWK_DR0_OFFSET         (0x118)        /**< (PMC_SLPWK_DR0) SleepWalking Disable Register 0 Offset */
#define PMC_SLPWK_SR0_OFFSET         (0x11C)        /**< (PMC_SLPWK_SR0) SleepWalking Status Register 0 Offset */
#define PMC_SLPWK_ASR0_OFFSET        (0x120)        /**< (PMC_SLPWK_ASR0) SleepWalking Activity Status Register 0 Offset */
#define PMC_PMMR_OFFSET              (0x130)        /**< (PMC_PMMR) PLL Maximum Multiplier Value Register Offset */
#define PMC_SLPWK_ER1_OFFSET         (0x134)        /**< (PMC_SLPWK_ER1) SleepWalking Enable Register 1 Offset */
#define PMC_SLPWK_DR1_OFFSET         (0x138)        /**< (PMC_SLPWK_DR1) SleepWalking Disable Register 1 Offset */
#define PMC_SLPWK_SR1_OFFSET         (0x13C)        /**< (PMC_SLPWK_SR1) SleepWalking Status Register 1 Offset */
#define PMC_SLPWK_ASR1_OFFSET        (0x140)        /**< (PMC_SLPWK_ASR1) SleepWalking Activity Status Register 1 Offset */
#define PMC_SLPWK_AIPR_OFFSET        (0x144)        /**< (PMC_SLPWK_AIPR) SleepWalking Activity In Progress Register Offset */
#define PMC_APLLACR_OFFSET           (0x158)        /**< (PMC_APLLACR) Audio PLL Analog Configuration Register Offset */
#define PMC_WMST_OFFSET              (0x15C)        /**< (PMC_WMST) Wait Mode Startup Time Register Offset */

