zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/pmc.h
/** \brief PMC register API structure */
typedef struct
{
  __O   __PMC_SCER_bits_t              PMC_SCER;      /**< Offset: 0x00 ( /W  32) System Clock Enable Register */
  __O   __PMC_SCDR_bits_t              PMC_SCDR;      /**< Offset: 0x04 ( /W  32) System Clock Disable Register */
  __I   __PMC_SCSR_bits_t              PMC_SCSR;      /**< Offset: 0x08 (R/   32) System Clock Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   __PMC_PCER0_bits_t             PMC_PCER0;     /**< Offset: 0x10 ( /W  32) Peripheral Clock Enable Register 0 */
  __O   __PMC_PCDR0_bits_t             PMC_PCDR0;     /**< Offset: 0x14 ( /W  32) Peripheral Clock Disable Register 0 */
  __I   __PMC_PCSR0_bits_t             PMC_PCSR0;     /**< Offset: 0x18 (R/   32) Peripheral Clock Status Register 0 */
  __IO  __CKGR_UCKR_bits_t             CKGR_UCKR;     /**< Offset: 0x1C (R/W  32) UTMI Clock Register */
  __IO  __CKGR_MOR_bits_t              CKGR_MOR;      /**< Offset: 0x20 (R/W  32) Main Oscillator Register */
  __IO  __CKGR_MCFR_bits_t             CKGR_MCFR;     /**< Offset: 0x24 (R/W  32) Main Clock Frequency Register */
  __IO  __CKGR_PLLAR_bits_t            CKGR_PLLAR;    /**< Offset: 0x28 (R/W  32) PLLA Register */
  __I   uint8_t                        Reserved2[0x04];
  __IO  __PMC_MCKR_bits_t              PMC_MCKR;      /**< Offset: 0x30 (R/W  32) Master Clock Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  __PMC_USB_bits_t               PMC_USB;       /**< Offset: 0x38 (R/W  32) USB Clock Register */
  __I   uint8_t                        Reserved4[0x04];
  __IO  __PMC_PCK_bits_t               PMC_PCK[8];    /**< Offset: 0x40 (R/W  32) Programmable Clock Register (chid = 0) 0 */
  __O   __PMC_IER_bits_t               PMC_IER;       /**< Offset: 0x60 ( /W  32) Interrupt Enable Register */
  __O   __PMC_IDR_bits_t               PMC_IDR;       /**< Offset: 0x64 ( /W  32) Interrupt Disable Register */
  __I   __PMC_SR_bits_t                PMC_SR;        /**< Offset: 0x68 (R/   32) Status Register */
  __I   __PMC_IMR_bits_t               PMC_IMR;       /**< Offset: 0x6C (R/   32) Interrupt Mask Register */
  __IO  __PMC_FSMR_bits_t              PMC_FSMR;      /**< Offset: 0x70 (R/W  32) Fast Startup Mode Register */
  __IO  __PMC_FSPR_bits_t              PMC_FSPR;      /**< Offset: 0x74 (R/W  32) Fast Startup Polarity Register */
  __O   __PMC_FOCR_bits_t              PMC_FOCR;      /**< Offset: 0x78 ( /W  32) Fault Output Clear Register */
  __I   uint8_t                        Reserved5[0x68];
  __IO  __PMC_WPMR_bits_t              PMC_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __PMC_WPSR_bits_t              PMC_WPSR;      /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved6[0x14];
  __O   __PMC_PCER1_bits_t             PMC_PCER1;     /**< Offset: 0x100 ( /W  32) Peripheral Clock Enable Register 1 */
  __O   __PMC_PCDR1_bits_t             PMC_PCDR1;     /**< Offset: 0x104 ( /W  32) Peripheral Clock Disable Register 1 */
  __I   __PMC_PCSR1_bits_t             PMC_PCSR1;     /**< Offset: 0x108 (R/   32) Peripheral Clock Status Register 1 */
  __IO  __PMC_PCR_bits_t               PMC_PCR;       /**< Offset: 0x10C (R/W  32) Peripheral Control Register */
  __IO  __PMC_OCR_bits_t               PMC_OCR;       /**< Offset: 0x110 (R/W  32) Oscillator Calibration Register */
  __O   __PMC_SLPWK_ER0_bits_t         PMC_SLPWK_ER0; /**< Offset: 0x114 ( /W  32) SleepWalking Enable Register 0 */
  __O   __PMC_SLPWK_DR0_bits_t         PMC_SLPWK_DR0; /**< Offset: 0x118 ( /W  32) SleepWalking Disable Register 0 */
  __I   __PMC_SLPWK_SR0_bits_t         PMC_SLPWK_SR0; /**< Offset: 0x11C (R/   32) SleepWalking Status Register 0 */
  __I   __PMC_SLPWK_ASR0_bits_t        PMC_SLPWK_ASR0; /**< Offset: 0x120 (R/   32) SleepWalking Activity Status Register 0 */
  __I   uint8_t                        Reserved7[0x0C];
  __IO  __PMC_PMMR_bits_t              PMC_PMMR;      /**< Offset: 0x130 (R/W  32) PLL Maximum Multiplier Value Register */
  __O   __PMC_SLPWK_ER1_bits_t         PMC_SLPWK_ER1; /**< Offset: 0x134 ( /W  32) SleepWalking Enable Register 1 */
  __O   __PMC_SLPWK_DR1_bits_t         PMC_SLPWK_DR1; /**< Offset: 0x138 ( /W  32) SleepWalking Disable Register 1 */
  __I   __PMC_SLPWK_SR1_bits_t         PMC_SLPWK_SR1; /**< Offset: 0x13C (R/   32) SleepWalking Status Register 1 */
  __I   __PMC_SLPWK_ASR1_bits_t        PMC_SLPWK_ASR1; /**< Offset: 0x140 (R/   32) SleepWalking Activity Status Register 1 */
  __I   __PMC_SLPWK_AIPR_bits_t        PMC_SLPWK_AIPR; /**< Offset: 0x144 (R/   32) SleepWalking Activity In Progress Register */
  __I   uint8_t                        Reserved8[0x10];
  __IO  __PMC_APLLACR_bits_t           PMC_APLLACR;   /**< Offset: 0x158 (R/W  32) Audio PLL Analog Configuration Register */
  __IO  __PMC_WMST_bits_t              PMC_WMST;      /**< Offset: 0x15C (R/W  32) Wait Mode Startup Time Register */
} pmc_registers_t;
/** @}  end of Power Management Controller */

#endif /* _PIC32CZ_CA70_PMC_COMPONENT_H_ */
